{
    "common": {
        "name": "iqontrol",
        "version": "0.0.27",
        "news": {
            "0.0.27": {
                "en": "Added marquee (scrolling text) for long states and device names (can be configured  in options), Added more toolbar-options, Enhanced handling of value lists, Disabled swiping when dialog is opened.",
                "de": "Laufschrift (Laufschrift) für lange Status und Gerätenamen hinzugefügt (kann in Optionen konfiguriert werden), Weitere Symbolleistenoptionen hinzugefügt, Verbesserte Handhabung von Wertelisten, Deaktiviertes Wischen beim Öffnen des Dialogfelds.",
                "ru": "Добавлен выделение (прокрутка текста) для длинных состояний и имен устройств (можно настроить в настройках), добавлены дополнительные параметры панели инструментов, улучшена обработка списков значений, отключено считывание при открытии диалогового окна.",
                "pt": "Adicionado letreiro (texto de rolagem) para estados longos e nomes de dispositivos (pode ser configurado em opções), Adicionado mais opções da barra de ferramentas, Manuseio aprimorado de listas de valores, Deslizamento desativado quando a caixa de diálogo é aberta.",
                "nl": "Toegevoegd selectiekader (scrollen tekst) voor lange staten en apparaatnamen (kan worden geconfigureerd in opties), meer werkbalk-opties toegevoegd, verbeterde afhandeling van waardenlijsten, uitgeschakeld vegen wanneer dialoogvenster wordt geopend.",
                "fr": "Ajout d'un rectangle de sélection (texte défilant) pour les états longs et les noms de périphérique (pouvant être configurés dans des options), ajout d'options supplémentaires pour la barre d'outils, gestion améliorée des listes de valeurs, balayage désactivé lors de l'ouverture de la boîte de dialogue.",
                "it": "Aggiunto perimetro (testo a scorrimento) per stati lunghi e nomi di dispositivi (può essere configurato in opzioni), Aggiunto più opzioni per le barre degli strumenti, Gestione avanzata degli elenchi di valori, Scorrimento disattivato quando viene aperta la finestra di dialogo.",
                "es": "Marquesina agregada (texto de desplazamiento) para estados largos y nombres de dispositivos (se pueden configurar en opciones), Se agregaron más opciones de la barra de herramientas, Manejo mejorado de listas de valores, Deslizamiento deshabilitado cuando se abre el cuadro de diálogo.",
                "pl": "Dodano markizę (przewijany tekst) dla długich stanów i nazw urządzeń (można skonfigurować w opcjach), Dodano więcej opcji paska narzędzi, Rozszerzona obsługa list wartości, Wyłączone przesuwanie po otwarciu okna dialogowego.",
                "zh-cn": "为长状态和设备名称添加了选取框（滚动文本）（可以在选项中配置），添加了更多工具栏选项，增强了值列表的处理，打开对话框时禁用了滑动。"
            },
            "0.0.26": {
                "en": "Added brightness to motion-sensor, Added options tab, You can now configure colors of toolbar, Fixed rendering of constants, Resized the demo-wallpapers for faster loading.",
                "de": "Helligkeit für Bewegungssensor hinzugefügt, Registerkarte \"Optionen\" hinzugefügt. Sie können jetzt die Farben der Symbolleiste konfigurieren. Behobenes Rendern von Konstanten. Die Größe der Demo-Hintergründe wurde geändert, um das Laden zu beschleunigen.",
                "ru": "Добавлена ​​яркость датчика движения, Добавлена ​​вкладка настроек, Теперь вы можете настроить цвета панели инструментов, Исправлен рендеринг констант, Изменен размер демо-обоев для более быстрой загрузки.",
                "pt": "Adicionado brilho ao sensor de movimento, guia Opções adicionadas, agora você pode configurar cores da barra de ferramentas, renderização fixa de constantes, redimensionados os papéis de parede demo para o carregamento mais rápido.",
                "nl": "Helderheid aan bewegingssensor toegevoegd, tabblad met toegevoegde opties, u kunt nu kleuren van de werkbalk configureren, vaste weergave van constanten, de grootte van de demoviews aangepast om sneller te laden.",
                "fr": "Ajout de la luminosité au détecteur de mouvement, onglet Options ajoutées, vous pouvez maintenant configurer les couleurs de la barre d'outils, rendu fixe des constantes, redimensionner les fonds d'écran démo pour un chargement plus rapide.",
                "it": "Aggiunta luminosità al sensore di movimento, scheda Opzioni aggiunte, Ora è possibile configurare i colori della barra degli strumenti, Rendering fisso delle costanti, Ridimensionamento degli sfondi demo per un caricamento più veloce.",
                "es": "Brillo agregado al sensor de movimiento, pestaña Opciones agregadas, ahora puede configurar los colores de la barra de herramientas, la representación fija de constantes, cambiar el tamaño de los fondos de pantalla de demostración para una carga más rápida.",
                "pl": "Dodano czujnik jasności do ruchu, karta Dodane opcje, Możesz teraz skonfigurować kolory paska narzędzi, Naprawiono renderowanie stałych, Zmieniono rozmiar tapet demo dla szybszego ładowania.",
                "zh-cn": "增加了运动传感器的亮度，添加了选项选项卡，您现在可以配置工具栏的颜色，固定常量渲染，调整演示壁纸的大小以加快加载速度。"
            },
            "0.0.25": {
                "en": "Added motion-sensor, Added description, how the frontend works, Added dialog for editing constants like SET_VALUE, URL or HTML, Changed the way arrays are stored, Added submit-button for values of type string, Added saturation to hue-lights, Better icons for color-temperature and brightness-sensor.",
                "de": "Hinzugefügt Bewegungssensor, hinzugefügt Beschreibung, wie die Frontend-Werke, hinzugefügt Dialog zur Bearbeitung Konstanten wie SET_VALUE, URL oder HTML, änderte sich die Art und Weise Arrays gespeichert sind, hinzugefügt Absende-Button für Werte vom Typ String, hinzugefügt Sättigung Farbton-Lichter, Better ",
                "ru": "Добавлен датчик движения, Добавлено описание, как работает внешний интерфейс, Добавлен диалог для редактирования констант, таких как SET_VALUE, URL или HTML, Изменен способ хранения массивов, Добавлена ​​кнопка отправки для значений типа string, Добавлена ​​насыщенность для подсветки, Лучше ",
                "pt": "Adicionado sensor de movimento, Adicionado descrição, como funciona o frontend, Adicionado caixa de diálogo para edição de constantes como SET_VALUE, URL ou HTML, Alterado a forma como as matrizes são armazenadas, Adicionado botão submit para valores do tipo string, Saturação adicionada para hue-lights, Melhor ",
                "nl": "Toegevoegd motion-sensor, Toegevoegd beschrijving, hoe de frontend werkt, Toegevoegd dialoog voor het bewerken van constanten zoals SET_VALUE, URL of HTML, Gewijzigd de manier waarop arrays worden opgeslagen, Toegevoegde submit-knop voor waarden van het type string, Toegevoegd verzadiging aan hue-lichten, Beter ",
                "fr": "Ajout de motion-sensor, Ajout de description, du fonctionnement de l'interface, Ajout d'une boîte de dialogue pour éditer des constantes telles que SET_VALUE, URL ou HTML, Modification du mode de stockage des tableaux, Ajout d'un bouton de soumission pour les valeurs de type chaîne, Ajout de la saturation à hue-lights, Meilleure ",
                "it": "Aggiunto sensore di movimento, Aggiunta descrizione, come funziona il frontend, Aggiunto dialogo per modificare costanti come SET_VALUE, URL o HTML, Cambiato il modo in cui sono memorizzati gli array, Aggiunto pulsante di invio per i valori di tipo stringa, Aggiunta saturazione a luci di tonalità, Migliore ",
                "es": "Sensor de movimiento agregado, Descripción agregada, cómo funciona la interfaz, Diálogo agregado para editar constantes como SET_VALUE, URL o HTML, Se modificó la forma en que se almacenan las matrices, Se agregó el botón de envío para los valores de tipo de cadena, Se agregó la saturación a hue-lights, Mejor ",
                "pl": "Dodano czujnik ruchu, Dodano opis, jak działa frontend, Dodano okno dialogowe do edycji stałych, takich jak SET_VALUE, URL lub HTML, Zmieniono sposób przechowywania tablic, Dodano przycisk wysyłania dla wartości typu string, Dodano nasycenie do odcieni, Lepsze ",
                "zh-cn": "添加了运动传感器，添加了说明，前端如何工作，添加了用于编辑常量的对话框，如SET_VALUE，URL或HTML，更改了数组的存储方式，为类型字符串的值添加了提交按钮，为色调灯增加了饱和度，更好"
            },
            "0.0.24": {
                "en": "Fixed jittering whiles scrolling on iOS (was related to Pull2Refresh), System language of iobroker will be loaded and used.",
                "de": "Behobenes Jitter beim Scrollen unter iOS (war mit Pull2Refresh verbunden). Die Systemsprache von iobroker wird geladen und verwendet.",
                "ru": "Исправлено дрожание при прокрутке на iOS (было связано с Pull2Refresh), системный язык iobroker будет загружен и использован.",
                "pt": "Correção de jittering enquanto rolava no iOS (estava relacionado ao Pull2Refresh), a linguagem do sistema do iobroker será carregada e usada.",
                "nl": "Fixed jittering whiles screaming on iOS (was gerelateerd aan Pull2Refresh), de systeemtaal van iobroker zal worden geladen en gebruikt.",
                "fr": "Correction du tremblement lors du défilement sur iOS (liée à Pull2Refresh), la langue système de iobroker sera chargée et utilisée.",
                "it": "Risolto il problema del jittering che scorreva su iOS (era collegato a Pull2Refresh), il linguaggio di sistema di iobroker verrà caricato e utilizzato.",
                "es": "Se corrigieron los errores de jittering en iOS (relacionados con Pull2Refresh), el idioma del sistema de iobroker se cargará y se usará.",
                "pl": "Naprawiono drżenie podczas przewijania w systemie iOS (było związane z Pull2Refresh), język systemu iobroker zostanie załadowany i użyty.",
                "zh-cn": "修复了在iOS上滚动时的抖动（与Pull2Refresh有关），将加载和使用iobroker的系统语言。"
            },
            "0.0.23": {
                "en": "Rewrote how constant values (instead of linkedStates) are handeled - this is a requirement for further development, Fixed Pull2Refresh on android devices / chrome, Added external links Added popups with iframes.",
                "de": "Die Behandlung konstanter Werte (anstelle von linkedStates) wurde umgeschrieben. Dies ist eine Voraussetzung für die weitere Entwicklung. Pull2Refresh auf Android-Geräten / Chrome wurde behoben. Externe Links wurden hinzugefügt. Popups mit iframes wurden hinzugefügt.",
                "ru": "Переписано, как обрабатываются постоянные значения (вместо связанных элементов) - это требование для дальнейшей разработки, Исправлено Pull2Refresh на устройствах Android / Chrome, Добавлены внешние ссылки Добавлены всплывающие окна с iframes.",
                "pt": "Reescreva como valores constantes (em vez de linkedStates) são handeled - este é um requisito para o desenvolvimento posterior, Fixed Pull2Refresh em dispositivos android / chrome, links externos adicionados Pop-ups adicionados com iframes.",
                "nl": "Herschrijf hoe constante waarden (in plaats van linkedStates) worden verwerkt - dit is een vereiste voor verdere ontwikkeling, Vaste Pull2Refresh op Android-apparaten / chroom, Externe koppelingen toegevoegd Pop-ups met iframes toegevoegd.",
                "fr": "Réécrivez la manière dont les valeurs constantes (au lieu des états liés) sont gérées - c’est une exigence pour un développement ultérieur, Correction de Pull2Refresh sur les appareils Android / chrome, Ajout de liens externes Ajout de popups avec iframes.",
                "it": "Riscrivi come vengono gestiti i valori costanti (invece di linkedStates) - questo è un requisito per ulteriori sviluppi, Fixed Pull2Refresh su dispositivi Android / chrome, Aggiunto link esterni Aggiunto popup con iframe.",
                "es": "Reescribió cómo se distribuyen los valores constantes (en lugar de los estados vinculados): esto es un requisito para un mayor desarrollo, Fix2Refresh corregido en dispositivos Android / chrome, Se agregaron enlaces externos agregados con iframes.",
                "pl": "Przepisz jak stałe wartości (zamiast sprzężonych stanów) są traktowane - jest to wymóg dalszego rozwoju, Naprawiono Pull2Refresh na urządzeniach z Androidem / chrome, Dodano zewnętrzne linki Dodano wyskakujące okienka z iframe.",
                "zh-cn": "重写了如何对常量值（而不是linkedStates）进行处理 - 这是进一步开发的要求，在Android设备/ chrome上固定Pull2Refresh，添加了外部链接添加了iframe的弹出窗口。"
            },
            "0.0.22": {
                "en": "Improved german translation, Short after another coming reconnect-events (<5s) are ignored now.",
                "de": "Verbesserte deutsche Übersetzung. Kurz nach einem erneuten Wiederverbinden werden Ereignisse (<5s) jetzt ignoriert.",
                "ru": "Улучшен перевод на немецкий язык, Коротко за очередными событиями повторного соединения (<5 с) теперь игнорируются.",
                "pt": "Aprimorada tradução alemã, Short após outro próximo evento de reconexão (<5s) é ignorado agora.",
                "nl": "Verbeterde Duitse vertaling, kort nadat een andere komende reconnect-gebeurtenissen (<5s) nu worden genegeerd.",
                "fr": "Amélioration de la traduction en allemand. Un court après un autre événement de reconnexion (<5) est maintenant ignoré.",
                "it": "Miglioramento della traduzione in tedesco, breve dopo l'altro gli eventi di riconnessione in corso (<5s) vengono ignorati ora.",
                "es": "Traducción al alemán mejorada, Corto tras otro evento de reconexión que viene (<5s) se ignoran ahora.",
                "pl": "Poprawione tłumaczenie na język niemiecki. Krótko po kolejnym nadchodzące zdarzenia ponownego połączenia (<5s) są teraz ignorowane.",
                "zh-cn": "改进的德语翻译，现在忽略了另一个重新连接事件（<5s）之后的短暂翻译。"
            },
            "0.0.21": {
                "en": "Added Push2Reload on mobile devices - reloads whole page when pushing down on homepage, otherwise only the acual view is reloaded: Improved reloading on reconnect (hoepefully to get it finally good working on iOS 12-2).",
                "de": "Push2Reload auf Mobilgeräten hinzugefügt - Lädt die gesamte Seite neu, wenn Sie auf die Startseite klicken. Andernfalls wird nur die aktuelle Ansicht neu geladen: Verbessertes Neuladen bei erneuter Verbindung (hoffentlich funktioniert es jetzt auch unter iOS 12-2).",
                "ru": "Добавлена ​​Push2Reload на мобильных устройствах - перезагружается вся страница при нажатии на домашнюю страницу, в противном случае перезагружается только актуальный вид: Улучшена перезагрузка при переподключении (с надеждой, чтобы наконец-то все хорошо работало на iOS 12-2).",
                "pt": "Adicionado Push2Reload em dispositivos móveis - recarrega toda a página ao empurrar para baixo na página inicial, caso contrário, apenas a visão real é recarregada: Melhoria de recarga na reconexão (hoepefully para obtê-lo finalmente bom trabalho no iOS 12-2).",
                "nl": "Push2Reload toegevoegd op mobiele apparaten - laadt de hele pagina opnieuw bij het indrukken van de startpagina, anders wordt alleen de virtuele weergave opnieuw geladen: verbeterde herladen bij opnieuw verbinden (hopelijk om het eindelijk goed te laten werken op iOS 12-2).",
                "fr": "Ajout de Push2Reload sur les appareils mobiles: recharge la page entière lorsque vous appuyez sur la page d’accueil, sinon seule la vue réelle est rechargée: Rechargement amélioré lors de la reconnexion (pour que cela fonctionne enfin correctement sur iOS 12-2).",
                "it": "Aggiunto Push2Reload sui dispositivi mobili - ricarica tutta la pagina quando si spinge verso il basso nella home page, altrimenti viene ricaricata solo la vista in tempo reale: Migliorato il ricaricamento sulla riconnessione (finalmente per farlo funzionare bene su iOS 12-2).",
                "es": "Push2Reload agregado en dispositivos móviles: vuelve a cargar toda la página cuando se empuja hacia abajo en la página de inicio; de lo contrario, solo se recarga la vista real: se mejoró la recarga al volver a conectarse (sin darme cuenta para que finalmente funcione bien en iOS 12-2).",
                "pl": "Dodano Push2Reload na urządzeniach mobilnych - przeładowuje całą stronę po naciśnięciu na stronę główną, w przeciwnym razie przeładowywany jest tylko widok główny: Poprawione przeładowanie na ponowne połączenie (hoepefully, aby w końcu dobrze działało na iOS 12-2).",
                "zh-cn": "在移动设备上添加Push2Reload  - 在主页上按下时重新加载整个页面，否则只重新加载视图：改进重新连接时的重新加载（最终使其在iOS 12-2上工作得很好）。"
            },
            "0.0.20": {
                "en": "New trial to get it working in iOs 12-2.",
                "de": "Neue Testversion, um es in iOS 12-2 zum Laufen zu bringen.",
                "ru": "Новое испытание, чтобы заставить его работать в iOs 12-2.",
                "pt": "Novo teste para fazê-lo funcionar em iOs 12-2.",
                "nl": "Nieuwe proef om het te laten werken in iOs 12-2.",
                "fr": "Nouvel essai pour le faire fonctionner dans iOs 12-2.",
                "it": "Nuovo processo per farlo funzionare in iOs 12-2.",
                "es": "Nueva prueba para que funcione en iOs 12-2.",
                "pl": "Nowa wersja próbna umożliwiająca pracę w iOs 12-2.",
                "zh-cn": "新的试验让它在iOs中工作12-2。"
            },
            "0.0.19": {
                "en": "Improved reloading of page in new PWD-Mode of iOs 12-2.",
                "de": "Verbessertes Neuladen von Seiten im neuen PWD-Modus von iOs 12-2.",
                "ru": "Улучшена перезагрузка страницы в новом PWD-режиме iOs 12-2.",
                "pt": "Melhoria do recarregamento da página no novo modo PWD de iOs 12-2.",
                "nl": "Verbeterd herladen van pagina in nieuwe PWD-modus van iOs 12-2.",
                "fr": "Rechargement amélioré de la page dans le nouveau PWD-Mode of iOs 12-2.",
                "it": "Miglioramento del ricaricamento della pagina nella nuova modalità PWD di iOs 12-2.",
                "es": "Se ha mejorado la recarga de la página en el nuevo modo PWD de iOs 12-2.",
                "pl": "Poprawione przeładowanie strony w nowym trybie PWD iOs 12-2.",
                "zh-cn": "改进了iOs 12-2的新PWD模式中页面的重新加载。"
            },
            "0.0.18": {
                "en": "Improved fetching of VALVE_STATES, Changed Button Icon, Added Loading-Spinner if disconnected, Due to new iOs 12-2 PWD-Mode added visibility-check and connectivity-check, Added role-icons to role-selectbox in edit device dialog, Fixed missing value-list for states of the type string.",
                "de": "Verbessertes Abrufen von VALVE_STATES, Geändertes Schaltflächensymbol, Hinzufügen von Loading-Spinner, falls nicht verbunden, Aufgrund neuer iOS 12-2 PWD-Modus Sichtbarkeitsprüfung und Konnektivitätsprüfung hinzugefügt, Hinzufügen von Rollensymbolen zur Rollenselektionsbox im Gerätedialog, Fehler behoben ",
                "ru": "Улучшено извлечение VALVE_STATES, изменен значок кнопки, добавлен Spinner загрузки, если он отключен, из-за новых iOs 12-2 PWD-Mode добавлены проверка видимости и проверка соединения, добавлены значки ролей в поле выбора ролей в диалоге редактирования устройства, исправлено отсутствие ",
                "pt": "Recuperação aprimorada de VALVE_STATES, Ícone do botão alterado, Adicionado o Loading-Spinner se desconectado, Devido a novos iOs 12-2 O modo PWD adicionou verificação de visibilidade e verificação de conectividade, Ícones de função adicionados à caixa de seleção de função na caixa de diálogo Editar dispositivo, Fixo ausente ",
                "nl": "Verbeterd ophalen van VALVE_STATES, pictogram met gewijzigde knop, toegevoegde Loading-Spinner indien losgekoppeld, als gevolg van nieuwe iO's 12-2 PWD-modus toegevoegde zichtbaarheid-controle en connectiviteit-controle, rolpictogrammen toegevoegd aan rol-selectbox in bewerkingsapparaatdialoog, vastgelopen ",
                "fr": "Amélioration de la récupération de VALVE_STATES, icône du bouton modifié, ajout de Loading-Spinner en cas de déconnexion, en raison de nouveaux iOs 12-2 Contrôle de visibilité et contrôle de connectivité ajouté, mode ajouté ",
                "it": "Recupero migliorato di VALVE_STATES, icona del pulsante modificato, aggiunto caricamento-Spinner se disconnessi, A causa di nuovi iOs 12-2 Modalità PWD aggiunto controllo di visibilità e connettività-controllo, Aggiunte icone di ruolo a selectbox ruolo nella finestra di dialogo di modifica del dispositivo, Risolto mancante ",
                "es": "Recuperación mejorada de VALVE_STATES, icono de botón modificado, agregado Spinner de carga si está desconectado, debido a los nuevos iOs 12-2 Modo de PWD agregado control de visibilidad y conectividad, agregado iconos de rol al cuadro de selección de rol en el cuadro de diálogo del dispositivo de edición, Se corrigió ",
                "pl": "Ulepszono pobieranie VALVE_STATES, zmieniono ikonę przycisku, dodano ładowanie-spinner, jeśli jest odłączony, z powodu nowych iOs 12-2 Tryb PWD dodał kontrolę widoczności i kontrolę łączności, Dodano ikony ról do pola wyboru roli w oknie dialogowym edycji urządzenia, Naprawiono brak ",
                "zh-cn": "改进了VALVE_STATES的获取，更改了按钮图标，添加了加载 - 微调器，如果断开连接，由于新的iOs 12-2 PWD模式添加了可见性检查和连接检查，在编辑设备对话框中添加了角色选择框的角色图标，修复了丢失"
            },
            "0.0.17": {
                "en": "Changed description of slider (level/dimmer/value/height).",
                "de": "Geänderte Beschreibung des Sliders (Level / Dimmer / Wert / Höhe).",
                "ru": "Изменено описание слайдера (уровень / диммер / значение / высота).",
                "pt": "Descrição alterada do controle deslizante (nível / dimmer / valor / altura).",
                "nl": "Gewijzigde beschrijving van schuifregelaar (niveau / dimmer / waarde / hoogte).",
                "fr": "Modification de la description du curseur (niveau / gradateur / valeur / hauteur).",
                "it": "Descrizione modificata del cursore (livello / dimmer / valore / altezza).",
                "es": "Se modificó la descripción del control deslizante (nivel / dimmer / valor / altura).",
                "pl": "Zmieniono opis suwaka (poziom / dimmer / wartość / wysokość).",
                "zh-cn": "更改了滑块的说明（水平/调光器/值/高度）。"
            },
            "0.0.16": {
                "en": "Role of device is displayed in devices-table, VALVE_STATES is now editable via GUI (show opening of valves associated with a thermostat in percentage), Added Role 'Button': You can define a constant SET_VALUE wich will be written to the ID that is linked with STATE if the button is pressed, Rewritten parts of front-end to guarentee better compatibility, Boost-Mode for Homematic-Thermostat should work now, Added state BOOST_STATE for Homematic-Thermostat - ability to display remaining boost-time if in boost-mode, Added dessription of roles and corresponding states, Temperature und Humidity-Sensors can now display a STATE at bottom of device, and both, TEMPERATURE and HUMIDITY, in small in the upper right corner, Better handling of Auto-Create of Temperature- und Humidity-Sensors, German translation: 'geöffnet' lower case, Zigbee humidity and temperature added to auto-creation, Fixed not scrollable selectbox at devices tab.",
                "de": "Die Rolle des Geräts wird in der Gerätetabelle angezeigt. VALVE_STATES kann jetzt über die grafische Benutzeroberfläche bearbeitet werden (Anzeige des Öffnens von Ventilen, die einem Thermostat zugeordnet sind, in Prozent). Hinzugefügte Rolle 'Button': Sie können eine Konstante SET_VALUE definieren, die in die ID geschrieben wird, die ist ",
                "ru": "Роль устройства отображается в таблице устройств, VALVE_STATES теперь редактируется через GUI (отображать открытие клапанов, связанных с термостатом в процентах), Добавлена ​​роль «Кнопка»: вы можете определить постоянную SET_VALUE, которая будет записана в идентификатор, который ",
                "pt": "A função do dispositivo é exibida na tabela de dispositivos, VALVE_STATES é agora editável via GUI (mostrar abertura de válvulas associada a um termostato em porcentagem), Adicionado função 'Botão': Você pode definir uma constante SET_VALUE que será gravada no ID que é ",
                "nl": "De rol van het apparaat wordt weergegeven in de apparaten-tabel, VALVE_STATES kan nu worden bewerkt via GUI (toon opening van kleppen geassocieerd met een thermostaat in percentage), Toegevoegd Rol 'Knop': U kunt een constante SET_VALUE definiëren die zal worden geschreven naar de ID die is ",
                "fr": "Le rôle de l'appareil est affiché dans la table des appareils, VALVE_STATES est maintenant éditable via une interface graphique (affiche l'ouverture des vannes associées à un thermostat en pourcentage), Bouton 'Rôle' ajouté: vous pouvez définir une constante SET_VALUE qui sera écrite dans l'ID ",
                "it": "Il ruolo del dispositivo viene visualizzato nella tabella dei dispositivi, VALVE_STATES ora è modificabile tramite GUI (mostra l'apertura delle valvole associate a un termostato in percentuale), Ruolo aggiunto 'Pulsante': puoi definire una costante SET_VALUE che verrà scritta nell'ID che è ",
                "es": "El rol del dispositivo se muestra en la tabla de dispositivos, VALVE_STATES ahora se puede editar a través de la GUI (muestre la apertura de las válvulas asociadas con un termostato en porcentaje), 'Botón' de rol agregado: puede definir una constante SET_VALUE que se escribirá en la ID que es ",
                "pl": "Rola urządzenia jest wyświetlana w tabeli urządzeń, VALVE_STATES można teraz edytować za pomocą GUI (pokaż otwarcie zaworów związanych z termostatem w procentach), Dodano przycisk „Rola”: Możesz zdefiniować stałą SET_VALUE, która zostanie zapisana na identyfikatorze, który jest ",
                "zh-cn": "设备的角色显示在设备表中，VALVE_STATES现在可通过GUI编辑（显示与恒温器相关的阀门打开百分比），添加角色'按钮'：您可以定义一个常量SET_VALUE，它将写入ID，即"
            },
            "0.0.15": {
                "en": "Improved check for value type of states, Improved slider-tooltip to lower font-size at large numbers.",
                "de": "Verbesserte Überprüfung des Werttyps von Zuständen. Verbesserter Slider-Tooltip zum Verringern der Schriftgröße bei großen Zahlen.",
                "ru": "Улучшена проверка типа значений состояний, Улучшена подсказка ползунка для уменьшения размера шрифта при больших числах.",
                "pt": "Verificação aprimorada do tipo de valor dos estados, Melhoria na dica da barra deslizante para diminuir o tamanho da fonte em grandes números.",
                "nl": "Verbeterde controle op waardetype toestanden, verbeterde schuifregelaar-tooltip om de lettergrootte bij grote aantallen te verlagen.",
                "fr": "Amélioration de la vérification du type d’états de valeur, info-bulle du curseur améliorée pour réduire la taille de la police pour les grands nombres.",
                "it": "Controllo migliorato per il tipo di valore degli stati, migliorato tooltip per ridurre la dimensione del font a grandi numeri.",
                "es": "Comprobación mejorada para el tipo de valor de los estados, Mejorada la información sobre herramientas de control deslizante para reducir el tamaño de fuente en números grandes",
                "pl": "Ulepszone sprawdzanie typu wartości stanów, Ulepszona etykieta suwaka, aby zmniejszyć rozmiar czcionki w dużych ilościach.",
                "zh-cn": "改进了对值类型状态的检查，改进了滑块 - 工具提示以降低大数字的字体大小。"
            },
            "0.0.14": {
                "en": "If role of state is not further specified, then check for role of parent object.",
                "de": "Wenn die Rolle des Status nicht weiter spezifiziert ist, prüfen Sie, ob das übergeordnete Objekt die Rolle hat.",
                "ru": "Если роль состояния не указана, проверьте роль родительского объекта.",
                "pt": "Se a função do estado não for especificada posteriormente, verifique a função do objeto pai.",
                "nl": "Als de rol van de staat niet nader wordt gespecificeerd, controleert u de rol van het bovenliggende object.",
                "fr": "Si le rôle de l'état n'est pas précisé, recherchez le rôle de l'objet parent.",
                "it": "Se il ruolo dello stato non viene ulteriormente specificato, controllare il ruolo dell'oggetto principale.",
                "es": "Si no se especifica más la función de estado, verifique la función del objeto principal.",
                "pl": "Jeśli rola stanu nie jest dalej określona, ​​sprawdź rolę obiektu nadrzędnego.",
                "zh-cn": "如果未进一步指定state的角色，则检查父对象的角色。"
            },
            "0.0.13": {
                "en": "Doors and Windows now force true/false to be translated to opened/closed, Double Entrys on WelcomeScreen/Overview removed, States are now set with the correct value type, Changed recognition of state types.",
                "de": "Türen und Fenster erzwingen nun die Übersetzung von wahr / falsch in geöffnet / geschlossen, Doppeleinträge auf Begrüßungsbildschirm / Übersicht entfernt, Zustände werden jetzt mit dem richtigen Werttyp festgelegt, Erkennung von Zustandstypen geändert.",
                "ru": "Двери и Windows теперь принудительно переводят значение true / false в открытое / закрытое состояние, двойные записи на WelcomeScreen / Overview удалены, состояния теперь устанавливаются с правильным типом значения, измененное распознавание типов состояний.",
                "pt": "Portas e Windows agora forçam true / false para serem convertidos para aberto / fechado, Entradas duplas no WelcomeScreen / Overview removidas, Estados agora são definidos com o tipo de valor correto, Reconhecimento de tipos de estado alterado.",
                "nl": "Deuren en Windows dwingen nu waar / vals om te worden vertaald naar geopend / gesloten, dubbele vermeldingen op WelcomeScreen / Overzicht verwijderd, Staten zijn nu ingesteld met het juiste waardetype, Gewijzigde herkenning van statietypen.",
                "fr": "Les portes et les fenêtres forcent maintenant la conversion de vrai / faux en ouvert / fermé, les entrées doubles sur WelcomeScreen / Overview sont supprimées, les états sont maintenant définis avec le type de valeur correct, Reconnaissance modifiée des types d'état.",
                "it": "Porte e Windows ora impongono true / false per la conversione in aperto / chiuso, Double Entrys su WelcomeScreen / Panoramica rimossa, Gli stati sono ora impostati con il tipo di valore corretto, Riconoscimento modificato dei tipi di stato.",
                "es": "Las puertas y Windows ahora obligan a verdadero / falso a ser traducido a abierto / cerrado, se eliminan las entradas dobles en WelcomeScreen / Overview, los estados ahora se configuran con el tipo de valor correcto, se cambió el reconocimiento de los tipos de estado.",
                "pl": "Drzwi i Windows wymuszają teraz przetłumaczenie true / false na otwarte / zamknięte, Double Entrys na WelcomeScreen / Overview usunięte, Stany są teraz ustawione z poprawnym typem wartości, Zmieniono rozpoznawanie typów stanów.",
                "zh-cn": "门和Windows现在强制将true / false转换为打开/关闭，删除WelcomeScreen / Overview上的Double Entrys，现在使用正确的值类型设置状态，更改状态类型的识别。"
            },
            "0.0.12": {
                "en": "Check for unallowed chars in object names, Check for duplicates in view names, Level fires a slider in dialog - even when it has a state list (HUE again), Added Blinds (Homematic) - please test it, i don't have one to test.",
                "de": "Prüfe auf unzulässige Zeichen in Objektnamen, Prüfe auf Duplikate in Ansichtsnamen, Level löst einen Schieberegler im Dialogfeld aus - auch wenn es eine Statusliste (wieder HUE) hat, Blinds hinzugefügt (Homematic) - bitte teste es, ich habe keine ",
                "ru": "Проверьте наличие недопустимых символов в именах объектов, Проверьте наличие дубликатов в именах представлений, Уровень запускает ползунок в диалоге - даже когда у него есть список состояний (снова HUE), Добавлены жалюзи (Homematic) - пожалуйста, проверьте его, у меня его нет ",
                "pt": "Verifique por chars não permitidos em nomes de objetos, verifique se há duplicatas em nomes de exibição, Level dispara um controle deslizante na caixa de diálogo - mesmo quando tem uma lista de estado (HUE novamente), Blinds Adicionado (Homematic) - teste, não tenho ",
                "nl": "Controleer op niet-toegestane tekens in objectnamen, Controleer op duplicaten in weergavenamen, Niveau vuurt een schuifregelaar in dialoog - zelfs wanneer het een toestandslijst heeft (HUE opnieuw), Toegevoegde blinds (Homematic) - test het, ik heb er geen ",
                "fr": "Vérifiez les caractères non autorisés dans les noms d'objet, Vérifiez les doublons dans les noms de vue, Level déclenche un curseur dans la boîte de dialogue - même s'il contient une liste d'états (HUE encore), Added Blinds (Homematic) - testez-le, je n'en ai pas. ",
                "it": "Controlla i caratteri non consentiti nei nomi degli oggetti, Controlla i duplicati nei nomi delle visualizzazioni, Livello attiva un cursore nella finestra di dialogo - anche quando ha una lista di stati (HUE di nuovo), Aggiunti Blinds (Homematic) - per favore testalo, non ne ho uno ",
                "es": "Compruebe si hay caracteres no permitidos en los nombres de los objetos, Compruebe si hay duplicados en los nombres de las vistas, Level dispara un control deslizante en el cuadro de diálogo, incluso cuando tiene una lista de estados (HUE nuevamente), Blinds agregados (Homematic): pruébelo, no tengo uno ",
                "pl": "Sprawdź, czy nie ma niedozwolonych znaków w nazwach obiektów, Sprawdź, czy nie ma duplikatów w nazwach widoków, Level uruchamia suwak w oknie dialogowym - nawet jeśli ma listę stanów (ponownie HUE), Dodano Blinds (Homematic) - sprawdź, czy nie ",
                "zh-cn": "检查对象名称中的不允许的字符，检查视图名称中的重复项，Level会在对话框中触发滑块 - 即使它有状态列表（再次是HUE），添加了Blinds（Homematic） - 请测试它，我没有"
            },
            "0.0.11": {
                "en": "Added compatibility for edge and firefox, Again Hue bugfixes, Removed Tooltip from Toolbar.",
                "de": "Kompatibilität für Edge und Firefox hinzugefügt, Fehlerbehebungen in Again Hue, Tooltip aus der Toolbar entfernt.",
                "ru": "Добавлена ​​совместимость для edge и firefox, исправлены ошибки Hue, удалена подсказка с панели инструментов.",
                "pt": "Adicionado compatibilidade para borda e firefox, Correções de bugs Novamente em Matiz, Removido Tooltip da Barra de Ferramentas.",
                "nl": "Compatibiliteit toegevoegd voor edge en firefox, Again Hue-bugfixes, Removed Tooltip from Toolbar.",
                "fr": "Compatibilité ajoutée pour edge et firefox, corrections de bugs Again Hue, info-bulle supprimée de la barre d'outils.",
                "it": "Aggiunta compatibilità per edge e firefox, correzioni di bug di nuovo hue, tooltip rimosso dalla barra degli strumenti.",
                "es": "Se agregó compatibilidad para Edge y Firefox, una vez más las correcciones de errores, se eliminó la información sobre herramientas de la barra de herramientas.",
                "pl": "Dodano kompatybilność z krawędziami i firefoxem, poprawiono ponownie błędy Hue, usunięto podpowiedź z paska narzędzi.",
                "zh-cn": "添加了edge和firefox的兼容性，再次Hue错误修正，从工具栏删除了工具提示。"
            },
            "0.0.10": {
                "en": "Added ColorTemperature - Hoepfully HUE works now? Can't test ist, because i do not own any hue lamp :)",
                "de": "ColorTemperature hinzugefügt - Hoepfully HUE funktioniert jetzt? ",
                "ru": "Добавлена ​​ColorTe Temperature - HoUEful HUE теперь работает? ",
                "pt": "Adicionado ColorTemperature - Hoepfully HUE funciona agora? ",
                "nl": "Kleurtemperatuur toegevoegd - Hoepfully HUE werkt nu? ",
                "fr": "Ajouté ColorTemperature - Hoepfully HUE fonctionne maintenant? ",
                "it": "Aggiunto ColorTemperature - Hoepfully HUE funziona ora? ",
                "es": "Se agregó ColorTemperature - Hoepfully HUE funciona ahora? ",
                "pl": "Dodano ColorTemperature - Hoepfully HUE działa teraz? ",
                "zh-cn": "添加ColorTemperature  -  Hoepfully HUE现在可以使用吗？"
            },
            "0.0.9": {
                "en": "HUE added, LinkedView now also works on windows, doors and fire-sensor, Added translation (thanks ldittmar!)",
                "de": "HUE hinzugefügt, LinkedView funktioniert jetzt auch für Fenster, Türen und Feuersensor. Übersetzung hinzugefügt (danke ldittmar!)",
                "ru": "Добавлен HUE, LinkedView теперь также работает на окнах, дверях и пожарном датчике, Добавлен перевод (спасибо ldittmar!)",
                "pt": "HUE acrescentou, LinkedView agora também funciona em janelas, portas e sensores de incêndio, Tradução adicionada (obrigado ldittmar!)",
                "nl": "HUE toegevoegd, LinkedView werkt nu ook op ramen, deuren en brandsensoren, vertaling toegevoegd (bedankt ldittmar!)",
                "fr": "HUE ajouté, LinkedView fonctionne désormais aussi sur les fenêtres, les portes et les capteurs d’incendie, Traduction ajoutée (merci ldittmar!)",
                "it": "Aggiunta HUE, LinkedView ora funziona anche su finestre, porte e sensori antincendio, Aggiunta traduzione (grazie a ldittmar!)",
                "es": "Se agregó HUE, LinkedView ahora también funciona en ventanas, puertas y sensores de incendios, Traducción agregada (¡gracias ldittmar!)",
                "pl": "Dodano HUE, LinkedView teraz działa również na okna, drzwi i czujnik ognia, Dodano tłumaczenie (dzięki ldittmar!)",
                "zh-cn": "HUE补充说，LinkedView现在也适用于窗户，门和火灾传感器，添加翻译（感谢ldittmar！）"
            },
            "0.0.8": {
                "en": "Added icons to image selectboxes.",
                "de": "Icons zu Bildauswahlfeldern hinzugefügt.",
                "ru": "Добавлены значки в окна выбора изображений.",
                "pt": "Adicionado ícones para selecionar caixas de imagem.",
                "nl": "Pictogrammen toegevoegd aan beeldselectieboxen.",
                "fr": "Ajout d'icônes dans les sélections d'images.",
                "it": "Aggiunte icone per selezionare le caselle di immagine.",
                "es": "Se agregaron iconos a los cuadros de selección de imágenes.",
                "pl": "Dodano ikony do skrzynek wyboru obrazów.",
                "zh-cn": "为图像选择框添加了图标。"
            },
            "0.0.7": {
                "en": "Changed order of tabs, Shelly added to autocreate.",
                "de": "Die Reihenfolge der Registerkarten wurde geändert, und Shelly fügte hinzu, dass sie automatisch erstellt.",
                "ru": "Изменен порядок вкладок, добавлена ​​Шелли в автореагентство.",
                "pt": "Ordem mudada das abas, Shelly adicionado ao autocreate.",
                "nl": "De volgorde van de tabbladen is gewijzigd, Shelly is toegevoegd aan autocreate.",
                "fr": "Ordre modifié des onglets, ajouta Shelly pour créer automatiquement.",
                "it": "Ordine modificato delle schede, Shelly aggiunto per l'autocreazione.",
                "es": "Se modificó el orden de las pestañas, Shelly agregó a autocrear.",
                "pl": "Zmieniono kolejność kart, dodano Shelly do autokreacji.",
                "zh-cn": "改变了选项卡的顺序，Shelly添加到autocreate。"
            },
            "0.0.6": {
                "en": "Improved speed of select id and autocreate, set filter to channel on autocreate.",
                "de": "Verbesserte Geschwindigkeit beim Auswählen der ID und beim automatischen Erstellen. Setzen Sie den Filter auf Kanal beim automatischen Erstellen.",
                "ru": "Улучшена скорость выбора идентификатора и автоматического создания, установите фильтр на канал при автоматическом создании.",
                "pt": "Melhor velocidade de seleção de ID e autocreate, defina o filtro para canal em autocreate.",
                "nl": "Verbeterde snelheid van select id en autocreate, zet filter op kanaal bij automatisch maken.",
                "fr": "Amélioration de la vitesse de sélection de l'identifiant et de la création automatique, définissez le filtre sur channel pour la création automatique",
                "it": "Migliorata la velocità di selezionare id e autocreare, impostare il filtro sul canale su autocreate.",
                "es": "Mejora la velocidad de selección de identificación y creación automática, configure el filtro a canal en la creación automática.",
                "pl": "Zwiększona prędkość wyboru identyfikatora i autokreacji, ustaw filtr na kanał w autokreacji.",
                "zh-cn": "改进了select id和autocreate的速度，在自动创建时将过滤器设置为通道。"
            },
            "0.0.5": {
                "en": "Bugfix: creation of many devices schould work now.",
                "de": "Bugfix: Erstellung vieler Geräte sollte jetzt funktionieren.",
                "ru": "Исправлено: создание многих устройств должно работать сейчас.",
                "pt": "Bugfix: a criação de muitos dispositivos deve funcionar agora.",
                "nl": "Bugfix: het maken van veel apparaten zou nu kunnen werken.",
                "fr": "Correction: la création de nombreux périphériques devrait fonctionner maintenant.",
                "it": "Bugfix: la creazione di molti dispositivi funziona ora.",
                "es": "Corrección de errores: la creación de muchos dispositivos debería funcionar ahora.",
                "pl": "Bugfix: tworzenie wielu urządzeń powinno teraz działać.",
                "zh-cn": "修正：创建许多设备现在可以工作。"
            },
            "0.0.4": {
                "en": "Bugfix: copy device created just a reference to old object, added Toolbar icons.",
                "de": "Bugfix: Kopiergerät erstellt nur einen Verweis auf altes Objekt, Toolbar Icons hinzugefügt.",
                "ru": "Исправлено: при копировании устройства создавалась просто ссылка на старый объект, добавлены значки панели инструментов.",
                "pt": "Bugfix: dispositivo de cópia criado apenas uma referência ao objeto antigo, adicionado ícones da barra de ferramentas.",
                "nl": "Bugfix: kopie apparaat gemaakt alleen een verwijzing naar oud object, werkbalkpictogrammen toegevoegd.",
                "fr": "Correction: le périphérique de copie créait uniquement une référence à un ancien objet, ajoutant des icônes de la barre d’outils.",
                "it": "Bugfix: copia dispositivo creato solo un riferimento al vecchio oggetto, aggiunte le icone della barra degli strumenti.",
                "es": "Solución de error: el dispositivo de copia creó solo una referencia a un objeto antiguo, agregó íconos de la barra de herramientas.",
                "pl": "Bugfix: urządzenie kopiujące stworzyło tylko odniesienie do starego obiektu, dodano ikony paska narzędzi.",
                "zh-cn": "修正：复制设备只创建了对旧对象的引用，添加了工具栏图标。"
            },
            "0.0.3": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "iQontrol",
        "titleLang": {
            "en": "iQontrol",
            "de": "iQontrol",
            "ru": "iQontrol",
            "pt": "iQontrol",
            "nl": "iQontrol",
            "fr": "iQontrol",
            "it": "iQontrol",
            "es": "iQontrol",
            "pl": "iQontrol",
            "zh-cn": "iQontrol"
        },
        "desc": {
            "en": "Fast Web-App for Visualization",
            "de": "Schnelle Web-App zur Visualisierung",
            "ru": "Быстрое веб-приложение для визуализации",
            "pt": "Fast Web-App para visualização",
            "nl": "Snelle web-app voor visualisatie",
            "fr": "Web-App rapide pour la visualisation",
            "it": "App Web veloce per visualizzazione",
            "es": "Rápida aplicación web para visualización",
            "pl": "Szybka aplikacja internetowa do wizualizacji",
            "zh-cn": "用于可视化的快速Web应用程序"
        },
        "authors": [
            "Sebastian Bormann <sebastian@bormann.net>"
        ],
        "keywords": [
            "visualization",
            "user",
            "interface",
            "webapp",
            "ui"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "iqontrol.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/sbormann/ioBroker.iqontrol/master/admin/iqontrol.png",
        "readme": "https://github.com/sbormann/ioBroker.iqontrol/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "visualization",
        "highlight": true,
        "compact": true,
        "singleton": false,
        "materialize": true,
        "materializeTab": true,
        "localLink": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
        "welcomeScreen": false,
        "welcomeScreenPro": {
            "link": "iqontrol/index.html",
            "name": "iQontrol",
            "img": "iqontrol.admin/iqontrol.png",
            "color": "gray",
            "order": 1
        },
        "noIntro": false,
        "adminTab": {
            "singleton": true,
            "name": {
                "en": "iQontrol",
                "de": "iQontrol",
                "ru": "iQontrol",
                "pt": "iQontrol",
                "nl": "iQontrol",
                "fr": "iQontrol",
                "it": "iQontrol",
                "es": "iQontrol",
                "pl": "iQontrol",
                "zh-cn": "iQontrol"
            },
            "link": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
            "fa-icon": "blur_on"
        },
        "supportCustoms": false,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=1.4.2"
            },
            {
                "web": ">=1.7.1"
            }
        ]
    },
    "native": {
        "demotoolbar": [
            {
                "commonName": "Home",
                "nativeLinkedView": "Home",
                "nativeIcon": "home"
            },
            {
                "commonName": "Rooms",
                "nativeLinkedView": "Rooms",
                "nativeIcon": "grid"
            },
            {
                "commonName": "Functions",
                "nativeLinkedView": "Functions",
                "nativeIcon": "gear"
            }
        ],
        "demoviews": [
            {
                "commonName": "Home",
                "nativeBackgroundImage": ".\\userimages\\demo\\4k-wallpaper-architektur-backstein-1308624.jpg",
                "devices": [
                    {
                        "commonName": "ioBroker uptime",
                        "nativeHeading": "ioBroker",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": ".\\userimages\\demo\\design-farbe-kunst-891030.jpg",
                        "commonRole": "iQontrolValue",
                        "states": [
                            {
                                "state": "STATE",
                                "value": "system.adapter.admin.0.uptime"
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Rooms",
                "nativeBackgroundImage": ".\\userimages\\demo\\farbe-flora-gras-1275415.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "1st floor",
                        "nativeLinkedView": "Living-Room",
                        "nativeBackgroundImage": ".\\userimages\\demo\\angewandte-kunst-aromatherapie-behandlung-5914.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "2nd floor",
                        "nativeLinkedView": "Kitchen",
                        "nativeBackgroundImage": ".\\userimages\\demo\\architektur-attraktiv-aussen-988873.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Functions",
                "nativeBackgroundImage": ".\\userimages\\demo\\abbildung-attraktiv-dekor-990824.jpg",
                "devices": [
                    {
                        "commonName": "Lights",
                        "nativeHeading": "",
                        "nativeLinkedView": "Lights",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Climate-Control",
                        "nativeHeading": "",
                        "nativeLinkedView": "Climate-Control",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Living-Room",
                "nativeBackgroundImage": ".\\userimages\\demo\\angewandte-kunst-aromatherapie-behandlung-5914.jpg",
                "devices": [
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Heater",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "TV",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolSwitch",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Kitchen",
                "nativeBackgroundImage": ".\\userimages\\demo\\architektur-attraktiv-aussen-988873.jpg",
                "devices": [
                    {
                        "commonName": "Fan",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolFan",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Lights",
                "nativeBackgroundImage": ".\\userimages\\demo\\design-farbe-kunst-891030.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Climate-Control",
                "nativeBackgroundImage": ".\\userimages\\demo\\bau-boden-dekorativ-131634.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "objects": [],
    "instanceObjects": []
}