{
    "common": {
        "name": "iqontrol",
        "version": "0.3.7",
        "news": {
            "0.3.7": {
                "en": "Added more options to timestamp."
            },
            "0.3.6": {
                "en": "Added failback to variables, Added option to add timestamp to state.",
                "de": "Failback zu Variablen hinzugefügt, Option hinzugefügt, um dem Status einen Zeitstempel hinzuzufügen.",
                "ru": "Добавлен возврат к переменным, добавлена ​​опция для добавления отметки времени в состояние.",
                "pt": "Adicionado failback nas variáveis, opção adicionada para adicionar o registro de data e hora ao estado.",
                "nl": "Failback toegevoegd aan variabelen, Optie toegevoegd om tijdstempel toe te voegen aan de staat.",
                "fr": "Ajout d'un rétablissement aux variables, ajout d'une option pour ajouter un horodatage à l'état.",
                "it": "Aggiunto failback alle variabili, aggiunta opzione per aggiungere timestamp allo stato.",
                "es": "Se agregó la recuperación de fallas a las variables, se agregó la opción para agregar una marca de tiempo al estado.",
                "pl": "Dodano powrót po awarii do zmiennych, Dodano opcję dodawania znacznika czasu do stanu.",
                "zh-cn": "将故障回复添加到变量，添加选项以将时间戳添加到状态。"
            },
            "0.3.5": {
                "en": "Added variables to icons and backgroundimages (see readme), It is now possible to remove toolbar (the first view is then the home view).",
                "de": "Es wurden Variablen zu Symbolen und Hintergrundbildern hinzugefügt (siehe Readme-Datei). Es ist jetzt möglich, die Symbolleiste zu entfernen (die erste Ansicht ist dann die Startansicht).",
                "ru": "Добавлены переменные к иконкам и фоновым изображениям (см. Readme), теперь можно удалить панель инструментов (первый вид - это домашний вид).",
                "pt": "Adicionadas variáveis ​​aos ícones e imagens de fundo (consulte o leia-me). Agora é possível remover a barra de ferramentas (a primeira visualização é a visualização inicial).",
                "nl": "Variabelen toegevoegd aan pictogrammen en achtergrondafbeeldingen (zie leesmij). Het is nu mogelijk om de werkbalk te verwijderen (de eerste weergave is dan de startweergave).",
                "fr": "Ajout de variables aux icônes et images d'arrière-plan (voir le fichier Lisezmoi), il est désormais possible de supprimer la barre d'outils (la première vue est alors la vue d'accueil).",
                "it": "Aggiunte variabili alle icone e alle immagini di sfondo (vedi il file Leggimi), è ora possibile rimuovere la barra degli strumenti (la prima vista è quindi la vista principale).",
                "es": "Se agregaron variables a los iconos y las imágenes de fondo (consulte el archivo Léame). Ahora es posible eliminar la barra de herramientas (la primera vista es la vista de inicio).",
                "pl": "Dodano zmienne do ikon i obrazów w tle (patrz plik Readme). Można teraz usunąć pasek narzędzi (pierwszy widok to widok główny).",
                "zh-cn": "在图标和背景图像中添加了变量（请参阅自述文件），现在可以删除工具栏（第一个视图是主视图）。"
            },
            "0.3.3": {
                "en": "Fixed device readonly for toggle state, Fixed devices with same name, Removed some old code",
                "de": "Gerät schreibgeschützt für Umschaltstatus behoben, Geräte mit demselben Namen behoben, alter Code entfernt",
                "ru": "Исправлено устройство, доступное только для переключения, Исправлено устройство с тем же именем, Удален старый код.",
                "pt": "Dispositivo fixo somente leitura para o estado de alternância, Dispositivos fixos com o mesmo nome, Removido algum código antigo",
                "nl": "Vaste apparaten die alleen kunnen worden gelezen om te wisselen, Vaste apparaten met dezelfde naam, Enkele oude code verwijderd",
                "fr": "Appareil fixe en lecture seule pour basculer, Appareils fixes du même nom, Suppression d'un ancien code",
                "it": "Risolto il problema del dispositivo di sola lettura per lo stato di attivazione / disattivazione, i dispositivi fissi con lo stesso nome, rimossi alcuni vecchi codici",
                "es": "Dispositivo fijo de solo lectura para alternar estado, Dispositivos fijos con el mismo nombre, Se eliminó algún código antiguo",
                "pl": "Naprawiono urządzenie tylko do odczytu stanu przełączania, Naprawiono urządzenia o tej samej nazwie, Usunięto trochę starego kodu",
                "zh-cn": "固定设备为切换状态只读，固定设备同名，删除了一些旧代码"
            },
            "0.3.2": {
                "en": "Fixed loading toolbar with no entries on linked view, Fixed views with quotes in name, Fixed Flood-Sensor.",
                "de": "Problem beim Laden der Symbolleiste ohne Einträge in der verknüpften Ansicht behoben, Feste Ansichten mit Anführungszeichen im Namen, Feste Flutsensor behoben.",
                "ru": "Исправлена ​​загрузка панели инструментов без записей в связанном виде, Исправлены виды с кавычками в имени, Исправлен датчик наводнения.",
                "pt": "Barra de ferramentas de carregamento fixa, sem entradas na exibição vinculada, Exibições fixas com aspas no nome, Sensor de inundação fixo.",
                "nl": "Vaste laadwerkbalk zonder invoer in gekoppelde weergave, Vaste weergaven met aanhalingstekens in naam, Vaste overstromingssensor.",
                "fr": "Barre d'outils de chargement fixe sans aucune entrée sur la vue liée, vues fixes avec des citations dans le nom, capteur d'inondation fixe.",
                "it": "Barra degli strumenti di caricamento fissa senza voci sulla vista collegata, viste fisse con virgolette nel nome, sensore di inondazione fisso.",
                "es": "Barra de herramientas de carga fija sin entradas en la vista vinculada, Vistas fijas con comillas en el nombre, Sensor de inundación fijo.",
                "pl": "Naprawiono ładowanie paska narzędzi bez wpisów w połączonym widoku, Naprawiono widoki z cytatami w nazwie, Naprawiono czujnik zalania.",
                "zh-cn": "修复了链接视图中没有条目的加载工具栏，修复了名称中带引号的视图，修复了Flood-Sensor。"
            },
            "0.3.1": {
                "en": "Breaking change - The complete configuration is no longer stored in ioBroker channels and states, but is fetched as one complete object, thus saving the configuration is much much faster than before, Views, devices and toolbar entries are now sortable via drag- and drop in the configuration dialog, After saving the configuration the instance ist now yellow until the configuration is completely written, Added invert UNREACH to device options, Added Flood-Sensor, Enhanced autocreation-feature by using ioBroker-Type-Detector by bluefox, Enhanced hue-lights when using alternative colorspace without white-values and changing ct, Enhanced hue-lights when using alternative colorspace to keep uppercase if needed.",
                "de": "Breaking Change - Die vollständige Konfiguration wird nicht mehr in ioBroker-Kanälen und -Zuständen gespeichert, sondern als ein vollständiges Objekt abgerufen. Das Speichern der Konfiguration ist also viel schneller als zuvor. Ansichten, Geräte und Symbolleisteneinträge können jetzt per Drag & Drop sortiert werden ",
                "ru": "Прерывистое изменение - полная конфигурация больше не сохраняется в каналах и состояниях ioBroker, но выбирается как один законченный объект, поэтому сохранение конфигурации выполняется намного быстрее, чем раньше, представления, устройства и записи панели инструментов теперь можно сортировать с помощью перетаскивания. ",
                "pt": "Mudança de última hora - A configuração completa não é mais armazenada nos canais e estados do ioBroker, mas é buscada como um objeto completo, portanto, salvar a configuração é muito mais rápido do que antes, exibições, dispositivos e entradas da barra de ferramentas agora podem ser classificadas por meio de arrastar e soltar ",
                "nl": "Breaking change - De volledige configuratie wordt niet langer opgeslagen in ioBroker-kanalen en -statussen, maar wordt opgehaald als één compleet object, waardoor het opslaan van de configuratie veel veel sneller is dan voorheen. Weergaven, apparaten en werkbalkitems zijn nu sorteerbaar via slepen en neerzetten in ",
                "fr": "Changement de rupture - La configuration complète n'est plus stockée dans les canaux et les états ioBroker, mais est récupérée comme un objet complet, enregistrant ainsi la configuration est beaucoup plus rapide qu'auparavant, les vues, les appareils et les entrées de la barre d'outils sont désormais triables par glisser-déposer ",
                "it": "Ultime modifiche: la configurazione completa non viene più memorizzata nei canali e negli stati di ioBroker, ma viene recuperata come un oggetto completo, pertanto il salvataggio della configurazione è molto più rapido rispetto a prima, viste, dispositivi e voci della barra degli strumenti sono ora ordinabili tramite trascinamento della selezione ",
                "es": "Cambio de última hora: la configuración completa ya no se almacena en los canales y estados de ioBroker, sino que se recupera como un objeto completo, por lo que guardar la configuración es mucho más rápido que antes, las vistas, dispositivos y entradas de la barra de herramientas ahora se pueden ordenar mediante arrastrar y soltar ",
                "pl": "Przełomowa zmiana - pełna konfiguracja nie jest już przechowywana w kanałach i stanach ioBroker, ale jest pobierana jako jeden kompletny obiekt, dzięki czemu zapisywanie konfiguracji jest znacznie szybsze niż wcześniej, Widoki, urządzenia i pozycje paska narzędzi można teraz sortować poprzez przeciąganie i upuszczanie ",
                "zh-cn": "重大更改-完整的配置不再存储在ioBroker通道和状态中，而是作为一个完整的对象获取，因此保存配置的速度比以前快得多，现在可以通过拖放操作对视图，设备和工具栏条目进行排序"
            },
            "0.2.20": {
                "en": "If value for POWER is greater than 100, it is rounded withour decimal places, Bugfixed invert-function with custom min and max, Added reload-link to loading page, Updated dependencies.",
                "de": "Wenn der Wert für POWER größer als 100 ist, wird er mit unseren Dezimalstellen gerundet. Bugfixed Invert-Funktion mit benutzerdefinierten Min und Max. Reload-Link zur Ladeseite hinzugefügt. Aktualisierte Abhängigkeiten.",
                "ru": "Если значение для POWER больше 100, оно округляется с нашими десятичными разрядами, исправлена ​​обратная функция с пользовательскими минимальными и максимальными значениями, добавлена ​​ссылка для перезагрузки страницы загрузки, обновлены зависимости.",
                "pt": "Se o valor de POWER for maior que 100, ele será arredondado com nossas casas decimais, função invertida corrigida com bug com mínimo e máximo personalizados, link de recarregamento adicionado à página de carregamento, dependências atualizadas.",
                "nl": "Als de waarde voor POWER groter is dan 100, wordt deze afgerond met onze decimalen, Bugfixed invert-functie met aangepaste min en max, toegevoegde reload-link naar laadpagina, bijgewerkte afhankelijkheden.",
                "fr": "Si la valeur de POWER est supérieure à 100, elle est arrondie avec nos décimales, fonction inversée corrigée des bogues avec min et max personnalisés, lien de rechargement ajouté à la page de chargement, dépendances mises à jour.",
                "it": "Se il valore di POWER è maggiore di 100, viene arrotondato con le nostre posizioni decimali, funzione di inversione corretta con min e max personalizzati, collegamento di ricarica aggiunto alla pagina di caricamento, dipendenze aggiornate.",
                "es": "Si el valor de POWER es mayor que 100, se redondea con nuestros decimales, función invertida arreglada con errores con min y max personalizados, enlace de recarga agregado a la página de carga, dependencias actualizadas.",
                "pl": "Jeśli wartość MOCY jest większa niż 100, jest ona zaokrąglana z naszymi miejscami po przecinku, Poprawiona funkcja odwracania z niestandardowymi wartościami minimalnymi i maksymalnymi, Dodany link reload do strony ładowania, Zaktualizowane zależności.",
                "zh-cn": "如果POWER的值大于100，则将其四舍五入到小数点后，修正具有自定义最小值和最大值的反转函数，将重新加载链接添加到加载页面，更新了相关性。"
            },
            "0.2.19": {
                "en": "Updated dependencies.",
                "de": "Aktualisierte Abhängigkeiten.",
                "ru": "Обновлены зависимости.",
                "pt": "Dependências atualizadas.",
                "nl": "Bijgewerkte afhankelijkheden.",
                "fr": "Dépendances mises à jour.",
                "it": "Dipendenze aggiornate.",
                "es": "Dependencias actualizadas.",
                "pl": "Zaktualizowano zależności.",
                "zh-cn": "更新了依赖性。"
            },
            "0.2.18": {
                "en": "Updated dependencies.",
                "de": "Aktualisierte Abhängigkeiten.",
                "ru": "Обновлены зависимости.",
                "pt": "Dependências atualizadas.",
                "nl": "Bijgewerkte afhankelijkheden.",
                "fr": "Dépendances mises à jour.",
                "it": "Dipendenze aggiornate.",
                "es": "Dependencias actualizadas.",
                "pl": "Zaktualizowano zależności.",
                "zh-cn": "更新了依赖性。"
            },
            "0.2.17": {
                "en": "Added option to open dialog by clicking on tile for View, Window, Door, Fire, Temperatur, Humidity, Brightness and Motion, Added option to hide device, if it is inactive (handle with care, as you may not be able to switch it on again).",
                "de": "Option zum Öffnen des Dialogfelds durch Klicken auf die Kachel für Ansicht, Fenster, Tür, Feuer, Temperatur, Luftfeuchtigkeit, Helligkeit und Bewegung hinzugefügt. Option zum Ausblenden des Geräts hinzugefügt, wenn es inaktiv ist (vorsichtig behandeln, da Sie es möglicherweise nicht wechseln können ",
                "ru": "Добавлена ​​возможность открыть диалог, нажав на плитку для Вид, Окно, Дверь, Огонь, Температура, Влажность, Яркость и Движение, Добавлена ​​возможность скрыть устройство, если оно неактивно (обращайтесь с осторожностью, так как вы не сможете его переключить ",
                "pt": "Foi adicionada a opção para abrir a caixa de diálogo clicando no bloco para Exibir, Janela, Porta, Incêndio, Temperatura, Umidade, Brilho e Movimento, Opção adicionada para ocultar o dispositivo, se estiver inativo (manuseie com cuidado, pois pode não ser possível alterná-lo ",
                "nl": "Optie toegevoegd om dialoogvenster te openen door te klikken op tegel voor Beeld, Venster, Deur, Vuur, Temperatur, Vochtigheid, Helderheid en Beweging, Optie toegevoegd om apparaat te verbergen, als het inactief is (voorzichtig behandelen, omdat u het misschien niet kunt schakelen ",
                "fr": "Ajout d'une option pour ouvrir la boîte de dialogue en cliquant sur la tuile pour la vue, la fenêtre, la porte, le feu, la température, l'humidité, la luminosité et le mouvement. ",
                "it": "Aggiunta opzione per aprire la finestra di dialogo facendo clic su riquadro per Visualizza, Finestra, Porta, Fuoco, Temperatura, Umidità, Luminosità e movimento, Aggiunta opzione per nascondere il dispositivo, se è inattivo (maneggiare con cura, poiché potrebbe non essere possibile cambiarlo ",
                "es": "Opción agregada para abrir el diálogo haciendo clic en el mosaico para Ver, Ventana, Puerta, Fuego, Temperatura, Humedad, Brillo y Movimiento, Opción agregada para ocultar el dispositivo, si está inactivo (maneje con cuidado, ya que es posible que no pueda cambiarlo ",
                "pl": "Dodano opcję otwierania okna dialogowego poprzez kliknięcie kafelka dla Widok, Okno, Drzwi, Ogień, Temperatur, Wilgotność, Jasność i Ruch, Dodano opcję ukrywania urządzenia, jeśli jest nieaktywne (obchodź się ostrożnie, ponieważ możesz nie być w stanie go zmienić ",
                "zh-cn": "添加选项以通过单击视图，窗口，门，火，温度，湿度，亮度和运动的图块来打开对话框，添加选项以隐藏设备（如果其处于非活动状态）（请谨慎处理，因为您可能无法切换它）"
            },
            "0.2.16": {
                "en": "Fixed custom step for heating control, Added option to open dialog by clicking on tile for View, Window, Door, Fire, Temperatur, Humidity, Brightness and Motion, Fixed universal popup wich was displayed, even when empty.",
                "de": "Benutzerdefinierter Schritt für die Heizungssteuerung korrigiert. Option zum Öffnen des Dialogfelds durch Klicken auf die Kachel für Ansicht, Fenster, Tür, Feuer, Temperatur, Luftfeuchtigkeit, Helligkeit und Bewegung hinzugefügt. Universelles Popup korrigiert, das angezeigt wurde, auch wenn leer.",
                "ru": "Исправлен пользовательский шаг для управления обогревом, Добавлена ​​возможность открывать диалог, нажав на плитку для Вид, Окно, Дверь, Огонь, Температура, Влажность, Яркость и Движение, Исправлено универсальное всплывающее окно, которое отображалось, даже когда пусто.",
                "pt": "Corrigido passo personalizado para controle de aquecimento, opção adicionada para abrir a caixa de diálogo clicando no ladrilho para Exibir, Janela, Porta, Incêndio, Temperatura, Umidade, Brilho e movimento, Pop-up universal fixo que era exibido, mesmo quando vazio.",
                "nl": "Vaste aangepaste stap voor verwarmingsregeling, optie toegevoegd om dialoogvenster te openen door te klikken op tegel voor Beeld, Venster, Deur, Vuur, Temperatuur, Vochtigheid, Helderheid en Beweging, Vaste universele pop-up die werd weergegeven, zelfs als deze leeg was.",
                "fr": "Correction d'une étape personnalisée pour le contrôle du chauffage, Ajout d'une option pour ouvrir la boîte de dialogue en cliquant sur la tuile pour la vue, la fenêtre, la porte, le feu, la température, l'humidité, la luminosité et le mouvement, popup universel fixe qui était affiché, même lorsqu'il était vide.",
                "it": "Risolto il problema con il passaggio personalizzato per il controllo del riscaldamento. Aggiunta l'opzione per aprire la finestra di dialogo facendo clic su un riquadro per Visualizza, Finestra, Porta, Fuoco, Temperatura, Umidità, Luminosità e movimento, Risolto popup universale che veniva visualizzato, anche se vuoto.",
                "es": "Se corrigió el paso personalizado para el control de calefacción, se agregó la opción para abrir el diálogo haciendo clic en el mosaico para Ver, Ventana, Puerta, Fuego, Temperatura, Humedad, Brillo y Movimiento, Ventana emergente universal fija que se mostró, incluso cuando estaba vacía.",
                "pl": "Naprawiono niestandardowy krok do sterowania ogrzewaniem, Dodano opcję otwierania okna dialogowego poprzez kliknięcie kafelka dla Widok, Okno, Drzwi, Ogień, Temperatur, Wilgotność, Jasność i ruch, Naprawiono uniwersalne okienko wyskakujące, które było wyświetlane, nawet gdy jest puste.",
                "zh-cn": "固定了加热控制的自定义步骤，添加了通过单击“视图”，“窗口”，“门”，“火”，“温度”，“湿度”，“亮度”和“运动”的图块来打开对话框的选项，显示了固定的通用弹出窗口，即使是空的也是如此。"
            }
        },
        "title": "iQontrol",
        "titleLang": {
            "en": "iQontrol",
            "de": "iQontrol",
            "ru": "iQontrol",
            "pt": "iQontrol",
            "nl": "iQontrol",
            "fr": "iQontrol",
            "it": "iQontrol",
            "es": "iQontrol",
            "pl": "iQontrol",
            "zh-cn": "iQontrol"
        },
        "desc": {
            "en": "Fast Web-App for Visualization",
            "de": "Schnelle Web-App zur Visualisierung",
            "ru": "Быстрое веб-приложение для визуализации",
            "pt": "Fast Web-App para visualização",
            "nl": "Snelle web-app voor visualisatie",
            "fr": "Web-App rapide pour la visualisation",
            "it": "App Web veloce per visualizzazione",
            "es": "Rápida aplicación web para visualización",
            "pl": "Szybka aplikacja internetowa do wizualizacji",
            "zh-cn": "用于可视化的快速Web应用程序"
        },
        "authors": [
            "Sebastian Bormann <sebastian@bormann.net>"
        ],
        "keywords": [
            "visualization",
            "user",
            "interface",
            "webapp",
            "ui"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "iqontrol.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/sbormann/ioBroker.iqontrol/master/admin/iqontrol.png",
        "readme": "https://github.com/sbormann/ioBroker.iqontrol/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "visualization",
        "highlight": true,
        "compact": true,
        "singleton": false,
        "materialize": true,
        "materializeTab": true,
        "localLink": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
        "welcomeScreen": false,
        "welcomeScreenPro": {
            "link": "iqontrol/index.html",
            "name": "iQontrol",
            "img": "iqontrol.admin/iqontrol.png",
            "color": "gray",
            "order": 1,
            "localLink": false
        },
        "noIntro": false,
        "adminTab": {
            "singleton": true,
            "name": {
                "en": "iQontrol",
                "de": "iQontrol",
                "ru": "iQontrol",
                "pt": "iQontrol",
                "nl": "iQontrol",
                "fr": "iQontrol",
                "it": "iQontrol",
                "es": "iQontrol",
                "pl": "iQontrol",
                "zh-cn": "iQontrol"
            },
            "link": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
            "fa-icon": "blur_on"
        },
        "supportCustoms": true,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=1.4.2"
            },
            {
                "web": ">=1.7.1"
            }
        ]
    },
    "native": {
        "demotoolbar": [
            {
                "commonName": "Home",
                "nativeLinkedView": "Home",
                "nativeIcon": "home"
            },
            {
                "commonName": "Rooms",
                "nativeLinkedView": "Rooms",
                "nativeIcon": "grid"
            },
            {
                "commonName": "Functions",
                "nativeLinkedView": "Functions",
                "nativeIcon": "gear"
            }
        ],
        "demoviews": [
            {
                "commonName": "Home",
                "nativeBackgroundImage": ".\\userimages\\demo\\bakestone.jpg",
                "devices": [
                    {
                        "commonName": "ioBroker uptime",
                        "nativeHeading": "ioBroker",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                        "commonRole": "iQontrolValue",
                        "states": [
                            {
                                "state": "STATE",
                                "value": "system.adapter.admin.0.uptime"
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Rooms",
                "nativeBackgroundImage": ".\\userimages\\demo\\grass.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "1st floor",
                        "nativeLinkedView": "Living-Room",
                        "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "2nd floor",
                        "nativeLinkedView": "Kitchen",
                        "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Functions",
                "nativeBackgroundImage": ".\\userimages\\demo\\decor.jpg",
                "devices": [
                    {
                        "commonName": "Lights",
                        "nativeHeading": "",
                        "nativeLinkedView": "Lights",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Climate-Control",
                        "nativeHeading": "",
                        "nativeLinkedView": "Climate-Control",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Living-Room",
                "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                "devices": [
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Heater",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "TV",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolSwitch",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Kitchen",
                "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                "devices": [
                    {
                        "commonName": "Fan",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolFan",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Lights",
                "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Climate-Control",
                "nativeBackgroundImage": ".\\userimages\\demo\\green.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "objects": [
        {
            "_id": "iqontrol.meta",
            "type": "meta",
            "common": {
                "name": "userfiles and images for iQontrol",
                "type": "meta.user",
                "expert": true
            },
            "native": {}
        }
    ],
    "instanceObjects": []
}