{
    "common": {
        "name": "iqontrol",
        "version": "0.1.11",
        "news": {
            "0.1.11": {
                "en": "Bugfix for chrome opacity transition bug, Added placeholder for default values for text inputs on options page, Added placeholder for default icon and blank icon to device options, Extended thermostat CONTROL_MODE by type switch, Fixed crash when using thermostat with setpoint an non homematic-devices, Added min and max to custom dialog, Now you can set none as a devices background image for active devices (formerly this was copied from inactive devices for backward-compatibility-reasons).",
                "de": "Bugfix für Chrome Opacity Transition Bug, Platzhalter für Standardwerte für Texteingaben auf Optionsseite hinzugefügt, Platzhalter für Standardsymbol und leeres Symbol für Geräteoptionen hinzugefügt, Erweiterter Thermostat CONTROL_MODE nach Typenschalter, Absturz bei Verwendung von Thermostat mit Sollwert und nicht homematischen Geräten behoben ",
                "ru": "Исправлена ​​ошибка с переходом непрозрачности Chrome, добавлен заполнитель для значений по умолчанию для ввода текста на странице параметров, добавлен заполнитель для значка по умолчанию и пустого значка для параметров устройства, расширенный термостат CONTROL_MODE по типу переключателя, исправлен сбой при использовании термостата с заданным значением для устройств без homematic-устройств ",
                "pt": "Bugfix para bug de transição de cromo opacidade, Adicionado espaço reservado para valores padrão para entradas de texto na página de opções, Espaço reservado adicionado para ícone padrão e opções de ícone em branco para dispositivo, Termostato estendido CONTROL_MODE por tipo switch, Falha fixa ao usar termostato com ponto de ajuste e dispositivos não homematic ",
                "nl": "Bugfix voor overgangsfout in chroomdekking, tijdelijke aanduiding toegevoegd voor standaardwaarden voor tekstinvoer op optiepagina, tijdelijke aanduiding voor standaardpictogram en leeg pictogram toegevoegd aan apparaatopties, uitgebreide thermostaat CONTROL_MODE per typeschakelaar, vaste crash bij gebruik van thermostaat met setpoint en niet-homematische apparaten ",
                "fr": "Correction de bug pour la transition de l'opacité de chrome, Ajout d'un espace réservé pour les valeurs par défaut pour les entrées de texte sur la page des options, Ajout d'un espace réservé pour l'icône par défaut et l'icône vide pour les options de l'appareil, Thermostat étendu CONTROL_MODE par type, Correction d'un crash lors de l'utilisation du thermostat avec une valeur de consigne non homématique ",
                "it": "Bugfix per il bug di transizione dell'opacità di Chrome, segnaposto aggiunto per valori predefiniti per input di testo nella pagina delle opzioni, segnaposto aggiunto per icona predefinita e icona vuota alle opzioni del dispositivo, termostato esteso CONTROL_MODE per interruttore di tipo, crash fisso quando si utilizza termostato con setpoint e dispositivi non omologati ",
                "es": "Corrección de errores para el error de transición de opacidad de cromo, marcador de posición agregado para los valores predeterminados para las entradas de texto en la página de opciones, marcador de posición agregado para el icono predeterminado y el icono en blanco a las opciones del dispositivo, termostato extendido CONTROL_MODE por tipo de interruptor, bloqueo fijo cuando se usa el termostato con punto de ajuste de dispositivos no homemáticos ",
                "pl": "Poprawka dla błędu przejścia nieprzezroczystości chromu, Dodano symbol zastępczy dla wartości domyślnych dla wprowadzania tekstu na stronie opcji, Dodano symbol zastępczy dla domyślnej ikony i pustą ikonę w opcjach urządzenia, Rozszerzony termostat CONTROL_MODE według przełącznika typu, Naprawiono awarię podczas używania termostatu z wartością zadaną dla urządzeń innych niż homematic ",
                "zh-cn": "chrome opacity过渡错误的修正，为选项页面上的文本输入的默认值添加了占位符，为默认图标添加了占位符，为设备选项添加了空白图标，通过类型开关扩展恒温器CONTROL_MODE，使用恒温器与设定点固定崩溃非主流设备"
            },
            "0.1.10": {
                "en": "You can now define different units if value is zero or if value is one in custom dialog, When changing an image via the new drop-down, save button will be activated now, Added option, to remove overlay of tile, if device is active or inactive, Enhanced conversion function when converting booelan to number, Fixed renaming of image files (links to used images are now also correctly renamed), Fixed handling of spaces in image filenames.",
                "de": "Sie können jetzt im benutzerdefinierten Dialogfeld verschiedene Einheiten definieren, wenn der Wert Null oder der Wert Eins ist. Wenn Sie ein Bild über das neue Dropdown-Menü ändern, wird jetzt die Schaltfläche Speichern (Option Hinzugefügt) aktiviert, um die Überlagerung der Kacheln zu entfernen, wenn das Gerät aktiv ist ",
                "ru": "Теперь вы можете определять различные единицы измерения, если значение равно нулю или если оно равно единице в настраиваемом диалоговом окне. При изменении изображения с помощью нового раскрывающегося меню теперь будет активирована кнопка сохранения, добавлена ​​опция удаления наложения плитки, если устройство активно. ",
                "pt": "Agora você pode definir unidades diferentes se o valor for zero ou se o valor for um na caixa de diálogo personalizada, Ao alterar uma imagem através da nova lista suspensa, o botão Salvar será ativado agora, opção Adicionado, para remover a sobreposição de bloco, se o dispositivo estiver ativo ",
                "nl": "U kunt nu verschillende eenheden definiëren als de waarde nul is of als de waarde één is in het aangepaste dialoogvenster. Wanneer u een afbeelding wijzigt via de nieuwe vervolgkeuzelijst, wordt de knop Opslaan nu geactiveerd, optie Toegevoegd, om de overlay van de tegel te verwijderen, als het apparaat actief is ",
                "fr": "Vous pouvez maintenant définir différentes unités si la valeur est zéro ou si la valeur en est une dans la boîte de dialogue personnalisée. Lorsque vous modifiez une image via le nouveau menu déroulant, le bouton d’enregistrement est activé, option ajoutée pour supprimer la superposition de la mosaïque, si le périphérique est actif. ",
                "it": "Ora puoi definire diverse unità se il valore è zero o se il valore è uno nella finestra di dialogo personalizzata, quando si cambia un'immagine tramite il nuovo menu a discesa, il pulsante Salva verrà ora attivato, opzione aggiunta, per rimuovere la sovrapposizione di riquadri, se il dispositivo è attivo ",
                "es": "Ahora puede definir diferentes unidades si el valor es cero o si el valor es uno en el cuadro de diálogo personalizado. Al cambiar una imagen a través del nuevo menú desplegable, el botón Guardar se activará ahora, opción agregada, para eliminar la superposición de mosaico, si el dispositivo está activo ",
                "pl": "Możesz teraz zdefiniować różne jednostki, jeśli wartość wynosi zero lub jeśli wartość jest równa jedności w niestandardowym oknie dialogowym, Podczas zmiany obrazu za pomocą nowego menu rozwijanego zostanie teraz aktywowany przycisk Zapisz, Dodano opcję, aby usunąć nakładkę kafelka, jeśli urządzenie jest aktywne ",
                "zh-cn": "如果值为零或者自定义对话框中的值为1，您现在可以定义不同的单位。当通过新的下拉列表更改图像时，现在将激活保存按钮，添加选项，以删除图块的叠加，如果设备处于活动状态"
            },
            "0.1.9": {
                "en": "Modified cache manifest to remove EISDIR-errors from log, Fixed toggle-entry in pressure menu, Added multiple file upload to images tab, Added check for dead links to other views when saving settings, You can now assign external urls to background images and icons (for example to add a weather-live-map), Removed options clickOnIconOpensDialog and clickOnTileToggles for Values and Programs as they are not switchable, Added OFF_SET_VALUE and the option 'Return to OFF_SET_VALUE after [ms]' to button.",
                "de": "Geändertes Cache-Manifest, um EISDIR-Fehler aus dem Protokoll zu entfernen. Behobener Wechseleintrag im Druckmenü. Hinzufügen mehrerer Dateien zur Registerkarte Bilder. Überprüfung auf tote Links zu anderen Ansichten beim Speichern von Einstellungen. Sie können jetzt Hintergrundbildern und Symbolen externe URLs zuweisen ",
                "ru": "Изменен манифест кеша для удаления ошибок EISDIR из журнала, Исправлен тумблер в меню давления, Добавлена ​​загрузка нескольких файлов на вкладку изображений, Добавлена ​​проверка неработающих ссылок на другие виды при сохранении настроек, Теперь вы можете назначать внешние URL-адреса фоновым изображениям и значкам ",
                "pt": "Manifesto de cache modificado para remover erros EISDIR do log, entrada de alternância fixa no menu de pressão, Adicionado upload de vários arquivos na guia de imagens, Adicionado verificação de links mortos para outras exibições ao salvar configurações, agora você pode atribuir urls externas para imagens de fundo e ícones ",
                "nl": "Gewijzigd cache-manifest om EISDIR-fouten uit het logboek te verwijderen, vaste invoer in drukmenu hersteld, uploaden van meerdere bestanden naar tabblad afbeeldingen toegevoegd, controle op dode links naar andere weergaven toegevoegd bij het opslaan van instellingen, u kunt nu externe URL's toewijzen aan achtergrondafbeeldingen en pictogrammen ",
                "fr": "Manifeste de cache modifié pour supprimer les erreurs EISDIR du journal, menu Entrée de basculement fixe dans la pression, onglet Ajout de fichiers multiples à importer dans les images, Vérification des liens morts vers d'autres vues lors de l'enregistrement des paramètres, Vous pouvez désormais affecter des URL externes aux images et icônes de fond ",
                "it": "Cache manifest modificata per rimuovere gli errori EISDIR dal registro, Risolto il problema con l'immissione / disattivazione del menu della pressione, Aggiunto il caricamento di più file nella scheda immagini, Aggiunto controllo per collegamenti non funzionanti ad altre viste durante il salvataggio delle impostazioni, Ora puoi assegnare URL esterni a immagini e icone di sfondo ",
                "es": "Se modificó el manifiesto de caché para eliminar los errores EISDIR del registro, se arregló la entrada de alternar en el menú de presión, se agregó la carga de múltiples archivos a la pestaña de imágenes, se agregó la verificación de enlaces muertos a otras vistas al guardar la configuración, ahora puede asignar URL externas a imágenes e iconos de fondo ",
                "pl": "Zmodyfikowany manifest pamięci podręcznej, aby usunąć błędy EISDIR z dziennika, Naprawiono przełączanie przełączania w menu ciśnienia, Dodano zakładkę wielokrotnego przesyłania plików do zdjęć, Dodano sprawdzanie martwych linków do innych widoków podczas zapisywania ustawień, Możesz teraz przypisywać zewnętrzne adresy URL do obrazów i ikon w tle ",
                "zh-cn": "修改缓存清单以从日志中删除EISDIR错误，在压力菜单中修复切换条目，添加多个文件上传到图像选项卡，添加检查保存设置时其他视图的死链接，您现在可以将外部URL分配给背景图像和图标"
            },
            "0.1.8": {
                "en": "Further improvements on connecting over iobroker.pro, COLOR_BRIGHTNESS and WHITE_BRIGHTNESS are now displayed, if LEVEL is not defined on hue lights, Added thumbnail-previews of fonts, Added clickOnIconOpensDialog and clickOnTileToggles to device options.",
                "de": "Weitere Verbesserungen bei der Verbindung über iobroker.pro, COLOR_BRIGHTNESS und WHITE_BRIGHTNESS werden jetzt angezeigt, wenn LEVEL für Farbtonlichter nicht definiert ist. Hinzugefügte Miniaturansichten von Schriftarten, hinzugefügte clickOnIconOpensDialog und clickOnTileToggles für Geräteoptionen.",
                "ru": "Дальнейшие улучшения при подключении через iobroker.pro, COLOR_BRIGHTNESS и WHITE_BRIGHTNESS теперь отображаются, если LEVEL не определен для подсветки оттенка, Добавлены миниатюры-предварительный просмотр шрифтов, Добавлены clickOnIconOpensDialog и clickOnTileToggles для параметров устройства.",
                "pt": "Melhorias adicionais na conexão através de iobroker.pro, COLOR_BRIGHTNESS e WHITE_BRIGHTNESS agora são exibidas, se LEVEL não estiver definido em luzes de matiz, Visualizações de miniaturas de fontes adicionadas, Adicionado clickOnIconOpensDialog e clickOnTileToggles às opções do dispositivo.",
                "nl": "Verdere verbeteringen bij het verbinden via iobroker.pro, COLOR_BRIGHTNESS en WHITE_BRIGHTNESS worden nu weergegeven, als LEVEL niet is gedefinieerd voor tintlichten, miniatuurvoorbeelden van lettertypen toegevoegd, clickOnIconOpensDialog en clickOnTileToggles toegevoegd aan apparaatopties.",
                "fr": "Des améliorations supplémentaires concernant la connexion via iobroker.pro, COLOR_BRIGHTNESS et WHITE_BRIGHTNESS sont maintenant affichées. Si LEVEL n'est pas défini sur les voyants de nuance, les vignettes-aperçus des polices, ClickOnIconOpensDialog et clickOnTileToggles sont ajoutés aux options de l'appareil.",
                "it": "Ulteriori miglioramenti sulla connessione tramite iobroker.pro, COLOR_BRIGHTNESS e WHITE_BRIGHTNESS sono ora visualizzati, se LEVEL non è definito sulle luci tonalità, Aggiunte anteprime dei caratteri aggiunte, clickOnIconOpensDialog e clickOnTileToggles alle opzioni del dispositivo.",
                "es": "Ahora se muestran mejoras adicionales en la conexión a través de iobroker.pro, COLOR_BRIGHTNESS y WHITE_BRIGHTNESS, si LEVEL no está definido en las luces de tono, se agregaron vistas previas en miniatura de las fuentes, se agregó clickOnIconOpensDialog y clickOnTileToggles a las opciones del dispositivo.",
                "pl": "Wyświetlane są teraz dalsze ulepszenia w łączeniu za pomocą iobroker.pro, COLOR_BRIGHTNESS i WHITE_BRIGHTNESS, jeśli POZIOM nie jest zdefiniowany w światłach barwy, Dodano podgląd miniatur czcionek, Dodano clickOnIconOpensDialog i clickOnTileToggles do opcji urządzenia.",
                "zh-cn": "如果未在色调灯上定义LEVEL，则添加了对iobroker.pro，COLOR_BRIGHTNESS和WHITE_BRIGHTNESS连接的进一步改进，添加了字体的缩略图预览，添加了clickOnIconOpensDialog和clickOnTileToggles到设备选项。"
            },
            "0.1.7": {
                "en": "Added font-family, -size, -weight and -style to options for toolbar, headers, device-name, device-state and device-info-text, Added icon-size, icon-background-size and icon-background-corner-size to options for toolbar.",
                "de": "Optionen für Symbolleiste, Überschriften, Gerätenamen, Gerätestatus und Geräteinformationstext wurden um Schriftfamilie, -größe, -stärke und -stil erweitert. Hinzugefügte Symbolgröße, Symbolhintergrundgröße und Symbolhintergrundecke ",
                "ru": "Добавлены font-family, -size, -weight и -style для опций панели инструментов, заголовков, имени устройства, состояния устройства и info-text-устройства, добавлен размер значка, размер значка фона и угол фона значка ",
                "pt": "Adicionado font-family, -size, -weight e -style às opções de barra de ferramentas, cabeçalhos, nome do dispositivo, estado do dispositivo e texto da informação do dispositivo, tamanho do ícone Adicionado, ícone-fundo-tamanho e ícone-fundo-canto ",
                "nl": "Lettertype-familie, -grootte, -gewicht en -stijl toegevoegd aan opties voor werkbalk, kopteksten, apparaatnaam, apparaatstatus en apparaat-info-tekst, pictogramgrootte, pictogram-achtergrondgrootte en pictogram-achtergrond-hoek toegevoegd ",
                "fr": "Ajout de font-family, -size, -weight et -style aux options pour la barre d'outils, les en-têtes, le nom du périphérique, l'état du périphérique et le texte de l'information du périphérique, Ajout de la taille de l'icône, de la taille de l'arrière-plan et du coin de l'arrière-plan ",
                "it": "Aggiunta famiglia di caratteri, dimensioni, peso e stile alle opzioni per barra degli strumenti, intestazioni, nome dispositivo, stato dispositivo e testo informazioni dispositivo, dimensione icona aggiunta, dimensione sfondo icona e angolo sfondo icona ",
                "es": "Se agregó la familia de fuentes, el tamaño, el peso y el estilo a las opciones para la barra de herramientas, encabezados, nombre del dispositivo, estado del dispositivo y texto de información del dispositivo, tamaño de icono agregado, tamaño de fondo de icono e esquina de fondo de icono ",
                "pl": "Dodano rodzinę czcionek, rozmiar, wagę i styl do opcji paska narzędzi, nagłówków, nazwy urządzenia, stanu urządzenia i informacji o urządzeniu, dodano rozmiar ikony, rozmiar tła i narożnik ikony ",
                "zh-cn": "为工具栏，标题，设备名称，设备状态和设备信息文本添加了font-family，-size，-weight和-style，添加了图标大小，图标背景大小和图标背景角"
            },
            "0.1.6": {
                "en": "Next try to connect via iobroker.pro",
                "de": "Versuchen Sie als nächstes, eine Verbindung über iobroker.pro herzustellen",
                "ru": "Далее попробуйте подключиться через iobroker.pro",
                "pt": "Em seguida, tente se conectar via iobroker.pro",
                "nl": "Probeer vervolgens verbinding te maken via iobroker.pro",
                "fr": "Ensuite, essayez de vous connecter via iobroker.pro",
                "it": "Quindi provare a connettersi tramite iobroker.pro",
                "es": "Luego intente conectarse a través de iobroker.pro",
                "pl": "Następnie spróbuj połączyć się przez iobroker.pro",
                "zh-cn": "接下来尝试通过iobroker.pro进行连接"
            },
            "0.1.5": {
                "en": "Added validation to options, Extended alarm with CONTROL_MODE-datapoint and icons for disarmed, armed and triggered, To save memory, only used states are saved in local memory (before all used AND all updated states were saved), Optimized socket-connectionLink to try to connect via iobroker.pro.",
                "de": "Validierung zu Optionen hinzugefügt, Erweiterter Alarm mit CONTROL_MODE-Datenpunkt und Symbolen für Unscharf, Scharf und Ausgelöst. Um Speicherplatz zu sparen, werden nur verwendete Zustände im lokalen Speicher gespeichert (bevor alle verwendeten UND alle aktualisierten Zustände gespeichert wurden). Optimierte Socket-Verbindung ",
                "ru": "Добавлена ​​проверка параметров, расширенный аварийный сигнал с CONTROL_MODE-datapoint и значки для снятия с охраны, постановки на охрану и запуска. Для сохранения памяти в локальной памяти сохраняются только использованные состояния (до сохранения всех использованных И все обновленные состояния), Оптимизированное соединение сокетовСвязать, чтобы попробовать ",
                "pt": "Adicionada validação às opções Alarme estendido com CONTROL_MODE-datapoint e ícones para desarmado, armado e acionado, Para economizar memória, somente os estados usados ​​são salvos na memória local (antes de todos os estados usados ​​e todos os atualizados foram salvos), Otimizado socket-connectionLink para tentar ",
                "nl": "Bevestiging toegevoegd aan opties, uitgebreid alarm met CONTROL_MODE-datapunt en pictogrammen voor uitgeschakeld, ingeschakeld en geactiveerd, om geheugen te besparen, worden alleen gebruikte statussen opgeslagen in lokaal geheugen (voordat alle gebruikte EN alle bijgewerkte statussen werden opgeslagen), geoptimaliseerde socket-verbindingLink om te proberen ",
                "fr": "Validation ajoutée aux options, Alarme étendue avec CONTROL_MODE-datapoint et icônes pour désarmé, armé et déclenché, Pour économiser de la mémoire, seuls les états utilisés sont enregistrés dans la mémoire locale (avant que tous les états utilisés ET mis à jour aient été enregistrés), Prise de connexion optimisée à essayer ",
                "it": "Aggiunta convalida alle opzioni, Allarme esteso con CONTROL_MODE-datapoint e icone per disinserito, inserito e attivato, Per salvare la memoria, solo gli stati utilizzati vengono salvati nella memoria locale (prima di salvare tutti gli stati utilizzati E tutti gli stati aggiornati), Connessione socket ottimizzataLink per provare ",
                "es": "Se agregó validación a las opciones, alarma extendida con CONTROL_MODE-datapoint e íconos para desarmado, armado y activado, para guardar la memoria, solo los estados usados ​​se guardan en la memoria local (antes de que todos los estados usados ​​y todos los estados actualizados fueran guardados), conexión de socket optimizada ",
                "pl": "Dodano sprawdzanie poprawności opcji, Rozszerzony alarm z punktem danych CONTROL_MODE i ikonami dla rozbrojonych, uzbrojonych i wyzwolonych, Aby zaoszczędzić pamięć, tylko używane stany są zapisywane w pamięci lokalnej (zanim wszystkie używane ORAZ wszystkie zaktualizowane stany zostały zapisane), Zoptymalizowane połączenie z gniazdem Link, aby spróbować ",
                "zh-cn": "添加了对选项的验证，带有CONTROL_MODE-datapoint的扩展警报以及用于撤防，布防和触发的图标，为了节省内存，只有使用的状态保存在本地内存中（在所有使用和保存所有更新状态之前），优化socket-connectionLink以尝试"
            },
            "0.1.4": {
                "en": "Optimized fading of tiles, Added toggle-button to blind, if no up/down button is defined, Added detection of protocol for socket in admin, Added confirm-flag inside custom datapoint configuration dialog to enable asking user to confirm before changing values, Added Toggle-Button to Garage-Door.",
                "de": "Optimiertes Ausblenden von Kacheln, Hinzufügen eines Umschalters zum Blinden, wenn kein Auf- / Ab-Knopf definiert ist, Hinzufügen einer Erkennung des Protokolls für den Socket im Administrator, Hinzufügen eines Bestätigungskennzeichens im Konfigurationsdialog für benutzerdefinierte Datenpunkte, um den Benutzer aufzufordern, vor dem Ändern von Werten zu bestätigen, Hinzufügen ",
                "ru": "Оптимизировано замирание плиток, добавлена ​​кнопка-переключатель для слепых, если не определена кнопка вверх / вниз, добавлено определение протокола для сокета в админке, добавлен флаг подтверждения в диалоговом окне конфигурации пользовательского назначения данных, чтобы пользователь мог запросить подтверждение перед изменением значений, добавлено ",
                "pt": "Desvanecimento otimizado de telhas, botão de alternância Adicionado para cego, se nenhum botão para cima / baixo estiver definido, detecção adicional de protocolo para soquete em admin, sinalizador de confirmação adicionado dentro da caixa de diálogo de configuração de ponto de dados personalizado para permitir que o usuário solicite confirmação antes de alterar valores ",
                "nl": "Geoptimaliseerde fading van tegels, Toggle-knop toegevoegd aan blind, als er geen up / down-knop is gedefinieerd, Detectie van protocol voor socket in admin toegevoegd, Bevestiging-vlag toegevoegd in aangepast dialoogvenster voor datapuntconfiguratie om de gebruiker te vragen om te bevestigen voordat waarden worden gewijzigd, Toegevoegd ",
                "fr": "Évanouissement optimisé des tuiles, Ajout d'un bouton bascule à l'aveugle, si aucun bouton haut / bas n'est défini, Ajout de la détection du protocole pour le socket dans l'admin, Ajout d'un indicateur de confirmation dans la boîte de dialogue de configuration de point de données personnalisée pour permettre à l'utilisateur de confirmer avant de modifier les valeurs, Ajouté ",
                "it": "Dissolvenza ottimizzata dei riquadri, aggiunto il pulsante di attivazione / disattivazione per accecare, se non viene definito alcun pulsante su / giù, Aggiunto rilevamento del protocollo per socket in admin, Aggiunto flag di conferma all'interno della finestra di dialogo di configurazione del punto dati personalizzato per consentire all'utente di confermare prima di modificare i valori, Aggiunto ",
                "es": "Desvanecimiento optimizado de mosaicos, botón de alternar agregado para cegar, si no se define un botón arriba / abajo, detección de protocolo agregada para socket en administrador, indicador de confirmación agregado dentro del cuadro de diálogo de configuración de punto de datos personalizado para permitir que el usuario confirme antes de cambiar valores, agregado ",
                "pl": "Zoptymalizowane zanikanie kafelków, Dodano przycisk przełączający do zaślepienia, jeśli nie zdefiniowano przycisku góra / dół, Dodano wykrywanie protokołu dla gniazda w admin, Dodano flagę potwierdzenia w niestandardowym oknie dialogowym konfiguracji punktu danych, aby umożliwić użytkownikowi potwierdzenie przed zmianą wartości, Dodano ",
                "zh-cn": "优化了图块的淡入淡出，如果没有定义上/下按钮，则添加切换按钮到盲区，在管理员中添加了套接字协议检测，在自定义数据点配置对话框中添加了confirm-flag，以便在更改值之前要求用户确认，添加"
            },
            "0.1.3": {
                "en": "Added seperate background image for active devices, Fixed background-options (color and opacity) for active and inactive device tiles, Added more space to views bottom, Fixed invert level for blinds, Organized options in collapsible layout.",
                "de": "Separates Hintergrundbild für aktive Geräte hinzugefügt. Feste Hintergrundoptionen (Farbe und Deckkraft) für aktive und inaktive Gerätekacheln. Mehr Platz für Ansichten unten hinzugefügt. Feste Umkehrstufe für Jalousien. Organisierte Optionen im reduzierbaren Layout.",
                "ru": "Добавлено отдельное фоновое изображение для активных устройств, Исправлены параметры фона (цвет и непрозрачность) для плиток активных и неактивных устройств, Добавлено больше места для нижней части просмотров, Исправлен уровень инвертирования для жалюзи, Организованные параметры в разборном макете",
                "pt": "Adicionado imagem de fundo separada para dispositivos ativos, Opções de plano de fundo fixo (cor e opacidade) para blocos de dispositivos ativos e inativos, Adicionado mais espaço para vistas inferior, Nível de inversão fixo para persianas, Opções organizadas no layout recolhível.",
                "nl": "Afzonderlijke achtergrondafbeelding toegevoegd voor actieve apparaten, vaste achtergrondopties (kleur en dekking) voor actieve en inactieve apparaattegels, meer ruimte toegevoegd voor weergaven onderaan, vast omkeerniveau voor jaloezieën, georganiseerde opties in opvouwbare lay-out.",
                "fr": "Ajout d'une image d'arrière-plan séparée pour les périphériques actifs, Options d'arrière-plan fixes (couleur et opacité) pour les mosaïques de périphériques actifs et inactifs, Ajout d'un espace supplémentaire au bas des vues, Niveau d'inversion fixe pour les stores, Options organisées dans une présentation réductible.",
                "it": "Aggiunta immagine di sfondo separata per i dispositivi attivi, Opzioni di sfondo fisse (colore e opacità) per i riquadri dei dispositivi attivi e inattivi, Aggiunto più spazio al fondo delle viste, Livello di inversione fisso per persiane, Opzioni organizzate in layout pieghevole.",
                "es": "Se agregó imagen de fondo separada para dispositivos activos, Opciones de fondo fijas (color y opacidad) para mosaicos de dispositivos activos e inactivos, Se agregó más espacio para vistas inferiores, Nivel de inversión fijo para persianas, Opciones organizadas en diseño plegable.",
                "pl": "Dodano oddzielny obraz tła dla aktywnych urządzeń, Naprawiono opcje tła (kolor i krycie) dla aktywnych i nieaktywnych kafelków urządzeń, Dodano więcej miejsca na widoki na dole, Stały poziom odwrotny dla rolet, Opcje zorganizowane w układzie zwijanym.",
                "zh-cn": "为活动设备添加了单独的背景图像，为活动和非活动设备切片添加了固定背景选项（颜色和不透明度），为视图底部添加了更多空间，为窗帘添加了固定反转级别，在可折叠布局中添加了有组织的选项。"
            },
            "0.1.2": {
                "en": "Added FAVORITE_POSITION (with configurable button caption) and SET_VALUE for UP, DOWN and FAVORITE_POSITION to Blinds, Added 'No Icon' as option to icon configuration, Addes icon to 'Link to other view', Added a bunch of new standard-icons.",
                "de": "FAVORITE_POSITION (mit konfigurierbarer Tastenbeschriftung) und SET_VALUE für UP, DOWN und FAVORITE_POSITION zu Blinds hinzugefügt, 'Kein Icon' als Option zur Icon-Konfiguration hinzugefügt, Icon zu 'Link zu anderer Ansicht' hinzugefügt",
                "ru": "Добавлены FAVORITE_POSITION (с настраиваемым заголовком кнопки) и SET_VALUE для UP, DOWN и FAVORITE_POSITION для жалюзи, добавлено «Нет значков» в качестве опции для конфигурации значков, значок «Добавляет» в «Ссылка на другой вид», Добавлена ​​куча новых стандартных значков.",
                "pt": "Adicionado FAVORITE_POSITION (com legenda de botão configurável) e SET_VALUE para UP, DOWN e FAVORITE_POSITION para Blinds, Adicionado 'No Icon' como opção para configuração de ícone, ícone Add to 'Link to other view', Adicionado um monte de novos ícones padrão.",
                "nl": "FAVORITE_POSITION (met instelbaar bijschrift) en SET_VALUE voor UP, DOWN en FAVORITE_POSITION toegevoegd aan Blinds, 'Geen pictogram' toegevoegd als optie voor pictogramconfiguratie, pictogram toegevoegd aan 'Link naar andere weergave', een aantal nieuwe standaardpictogrammen toegevoegd.",
                "fr": "Ajout de FAVORITE_POSITION (avec légende de bouton configurable) et SET_VALUE pour UP, DOWN et FAVORITE_POSITION aux stores, Ajout de l'option \"Aucune icône\" dans la configuration de l'icône, Ajout d'une icône pour \"Lien vers une autre vue\", Ajout d'un ensemble de nouvelles icônes standard.",
                "it": "Aggiunti FAVORITE_POSITION (con didascalia pulsante configurabile) e SET_VALUE per UP, DOWN e FAVORITE_POSITION a Blinds, aggiunta 'No Icon' come opzione alla configurazione dell'icona, aggiunge icona a 'Link ad altra vista', aggiunta una serie di nuove icone standard.",
                "es": "Se agregó FAVORITE_POSITION (con título de botón configurable) y SET_VALUE para ARRIBA, ABAJO y FAVORITE_POSITION a las persianas, se agregó 'Sin icono' como opción a la configuración del icono, se agrega el icono a 'Enlace a otra vista', se agregaron un montón de nuevos iconos estándar.",
                "pl": "Dodano FAVORITE_POSITION (z konfigurowalnym podpisem przycisku) i SET_VALUE dla UP, DOWN i FAVORITE_POSITION do żaluzji, Dodano opcję „Brak ikony” jako opcję do konfiguracji ikony, ikonę Addes do „Link do innego widoku”, Dodano kilka nowych standardowych ikon.",
                "zh-cn": "添加了FAVORITE_POSITION（带有可配置按钮标题）和SET_VALUE用于UP，DOWN和FAVORITE_POSITION到Blinds，添加了'No Icon'作为图标配置选项，Addes图标添加到'链接到其他视图'，添加了一堆新的标准图标。"
            },
            "0.1.1": {
                "en": "Added usericons.",
                "de": "Usericons hinzugefügt.",
                "ru": "Добавлены usericons.",
                "pt": "Adicionado usericons.",
                "nl": "Gebruikersicons toegevoegd.",
                "fr": "Ajout des utilisateurs.",
                "it": "Usericon aggiunti.",
                "es": "Añadido usericons.",
                "pl": "Dodano usericons.",
                "zh-cn": "添加了用户。"
            },
            "0.1.0": {
                "en": "First stable release, Added show Timestamp to device options to chose default behaviour and a small timestamp-icon in the dialog to show and hide timestamps, Fixed readonly handling of control mode for Homematic Thermostats.",
                "de": "Erste stabile Version, Zeitstempel für Geräteoptionen anzeigen hinzugefügt, um das Standardverhalten zu wählen, und ein kleines Zeitstempelsymbol im Dialogfeld, um Zeitstempel anzuzeigen und auszublenden. Die schreibgeschützte Behandlung des Steuermodus für Homematic Thermostats wurde behoben.",
                "ru": "Первый стабильный выпуск. Добавлено отображение метки времени в параметрах устройства для выбора поведения по умолчанию и небольшая иконка отметки времени в диалоговом окне для отображения и скрытия меток времени. Исправлена ​​обработка режима управления для термостатов Homematic только для чтения.",
                "pt": "Primeira versão estável, Adicionado show Timestamp às opções do dispositivo para escolher o comportamento padrão e um pequeno timestamp-icon na caixa de diálogo para mostrar e ocultar timestamps, Fixo readonly manipulação do modo de controle para Termostatos Homematic.",
                "nl": "Eerste stabiele release, toegevoegd Toon tijdstempel aan apparaatopties om standaardgedrag te kiezen en een klein tijdstempel-pictogram in het dialoogvenster om tijdstempels te tonen en te verbergen, vaste readonly afhandeling van regelmodus voor homematische thermostaten.",
                "fr": "Première version stable, Added affiche les options show timestamp to device pour choisir le comportement par défaut et une petite icône timestamp dans la boîte de dialogue permettant d'afficher et de masquer les horodatages.",
                "it": "Prima versione stabile, aggiunta mostra timestamp alle opzioni del dispositivo per scegliere il comportamento predefinito e una piccola icona timestamp nella finestra di dialogo per mostrare e nascondere i timestamp, risolta la gestione in sola lettura della modalità di controllo per i termostati omematici.",
                "es": "Primera versión estable, Se agregaron opciones de marca de tiempo a dispositivo para elegir el comportamiento predeterminado y un pequeño icono de marca de tiempo en el cuadro de diálogo para mostrar y ocultar las marcas de tiempo.",
                "pl": "Pierwsze stabilne wydanie, Dodano opcję Pokaż znacznik czasu do opcji urządzenia, aby wybrać domyślne zachowanie i małą ikonę znacznika czasu w oknie dialogowym, aby pokazać i ukryć znaczniki czasu, Naprawiono obsługę trybu sterowania tylko dla termostatów homematycznych.",
                "zh-cn": "第一个稳定版本，添加show timestamp到设备选项以选择默认行为，并在对话框中显示一个小时间戳图标以显示和隐藏时间戳，修复了Homematic恒温器控制模式的只读处理。"
            },
            "0.0.49": {
                "en": "Added common type and common role to custom dialog, Added pressure menu for toolbar.",
                "de": "Allgemeiner Typ und allgemeine Rolle zum benutzerdefinierten Dialogfeld hinzugefügt. Druckmenü für Symbolleiste hinzugefügt.",
                "ru": "Добавлен общий тип и общая роль в пользовательский диалог, Добавлено меню давления для панели инструментов.",
                "pt": "Adicionado tipo comum e papel comum ao diálogo personalizado, Adicionado menu de pressão para a barra de ferramentas.",
                "nl": "Gemeenschappelijk type en gemeenschappelijke rol toegevoegd aan aangepast dialoogvenster, Drukmenu toegevoegd voor werkbalk.",
                "fr": "Ajout d'un type commun et d'un rôle commun dans la boîte de dialogue personnalisée, menu Ajout de pression pour la barre d'outils.",
                "it": "Aggiunto tipo comune e ruolo comune nella finestra di dialogo personalizzata, menu di pressione aggiunto per la barra degli strumenti.",
                "es": "Se agregó el tipo común y el rol común al cuadro de diálogo personalizado. Se agregó el menú de presión para la barra de herramientas.",
                "pl": "Dodano wspólny typ i wspólną rolę do niestandardowego okna dialogowego, Dodano menu ciśnienia dla paska narzędzi.",
                "zh-cn": "为自定义对话框添加了常用类型和常用角色，为工具栏添加了压力菜单。"
            },
            "0.0.48": {
                "en": "Datapoint BATTERY can now be a level - the battery-empty-icon will be shown if value is less than 10%, Added additional colorspaces for hue lights (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, RGB Hue Only), Added Garage Door.",
                "de": "Der Datenpunkt BATTERY kann jetzt einen Ladezustand annehmen - das Batterie-Leer-Symbol wird angezeigt, wenn der Wert unter 10% liegt. Zusätzliche Farbräume für Farblichter (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, RGB Hue Only) wurden hinzugefügt ",
                "ru": "Datapoint BATTERY теперь может быть уровнем - значок батареи будет отображаться, если значение меньше 10%, добавлены дополнительные цветовые пространства для подсветки оттенка (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, только RGB Hue Only), добавлено ",
                "pt": "A BATERIA de dados agora pode ser um nível - o ícone de bateria vazia será exibido se o valor for menor que 10%, Áreas de cores adicionais adicionadas para luzes de matiz (RGB, RGBW, RGBWWCW, RGBCWWW, Matiz Milight, Somente Matiz RGB), Adicionado ",
                "nl": "Datapunt BATTERIJ kan nu een niveau zijn - het batterij-leeg-pictogram wordt getoond als de waarde minder is dan 10%, Extra kleurruimten toegevoegd voor tintlichten (RGB, RGBW, RGBWWCW, RGBCWWW, Alleen Milight-Hue, RGB-tint), Toegevoegd ",
                "fr": "Datapoint BATTERY peut maintenant être un niveau - l'icône batterie vide sera affichée si la valeur est inférieure à 10%, ajout d'espaces de couleurs supplémentaires pour les éclairages de teinte (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, RGB Hue uniquement), ajouté ",
                "it": "Datapoint BATTERY ora può essere un livello: l'icona della batteria scarica verrà visualizzata se il valore è inferiore al 10%, Aggiunti spazi colore aggiuntivi per le luci tonalità (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, Solo tonalità RGB), Aggiunto ",
                "es": "Datapoint BATTERY ahora puede ser un nivel: se mostrará el ícono de batería vacía si el valor es inferior al 10%, Se agregaron espacios de color adicionales para las luces de tono (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, RGB solo), agregado ",
                "pl": "BATERIA Datapoint może być teraz poziomem - ikona pustej baterii będzie wyświetlana, jeśli wartość jest mniejsza niż 10%, Dodano dodatkowe przestrzenie kolorów dla świateł barwy (RGB, RGBW, RGBWWCW, RGBCWWW, Milight-Hue, tylko RGB Hue), Dodano ",
                "zh-cn": "Datapoint BATTERY现在可以是一个级别 - 如果值小于10％，将显示电池空图标，为色调灯添加额外的色彩空间（RGB，RGBW，RGBWWCW，RGBCWWW，Milight-Hue，仅RGB色调），添加"
            },
            "0.0.47": {
                "en": "Added targetValueId inside custom datapoint configuration dialog wich allowes to have different datapoints vor actual value and for target value, Added invert-flag inside custom datapoint configuration dialog.",
                "de": "TargetValueId im Konfigurationsdialog für benutzerdefinierte Datenpunkte hinzugefügt, der es ermöglicht, unterschiedliche Datenpunkte für den tatsächlichen Wert und für den Zielwert zu verwenden. Invert-flag im Konfigurationsdialog für benutzerdefinierte Datenpunkte hinzugefügt.",
                "ru": "Добавлен targetValueId в настраиваемом диалоговом окне конфигурации точек данных, который позволяет иметь разные точки данных в зависимости от фактического значения и целевого значения. Добавлен флаг инвертирования в настраиваемом диалоговом окне конфигурации точек данных.",
                "pt": "O targetValueId foi adicionado dentro da caixa de diálogo de configuração do ponto de dados personalizado, que permite ter diferentes pontos de dados para o valor real e para o valor de destino. Adicionado sinalizador invertido dentro da caixa de diálogo de configuração do ponto de dados personalizado.",
                "nl": "TargetValueId toegevoegd in aangepast dialoogvenster voor datapuntconfiguratie waarmee verschillende datapunten voor de werkelijke waarde en voor doelwaarde kunnen worden toegevoegd, vlag Invert-flag toegevoegd in aangepast dialoogvenster voor datapuntconfiguratie.",
                "fr": "Ajout de targetValueId dans la boîte de dialogue de configuration de point de données personnalisée, ce qui permet d’avoir différents points de données par rapport à la valeur réelle et pour la valeur cible, Ajout d’invert-flag dans la boîte de dialogue de configuration de points de données personnalisée.",
                "it": "Aggiunto targetValueId all'interno della finestra di dialogo di configurazione personalizzata del punto dati che consente di avere punti dati diversi per il valore reale e, per il valore di destinazione, aggiunto flag di inversione nella finestra di configurazione personalizzata del punto dati.",
                "es": "Se agregó targetValueId dentro del cuadro de diálogo de configuración de punto de datos personalizado que permite tener diferentes puntos de datos para el valor real y, para el valor objetivo, se agregó un indicador invertido dentro del cuadro de diálogo de configuración de punto de datos personalizado.",
                "pl": "Dodano targetValueId wewnątrz niestandardowego okna konfiguracji punktu danych, które pozwala na posiadanie różnych punktów danych i wartości rzeczywistej oraz wartości docelowej, Dodano flagę odwracania wewnątrz niestandardowego okna konfiguracji punktu danych.",
                "zh-cn": "在自定义数据点配置对话框中添加了targetValueId，允许具有不同的数据点和实际值以及目标值，在自定义数据点配置对话框中添加了invert-flag。"
            },
            "0.0.46": {
                "en": "Added options to device configuration dialog, Added readonly-flag to device options, Added invert color temperature flag to device options for lights, Added invert flag to device options for blinds.",
                "de": "Optionen zum Gerätekonfigurationsdialog hinzugefügt, Readonly-Flag zu Geräteoptionen hinzugefügt, Farbtemperatur-Flag zu Geräteoptionen für Lichter umkehren hinzugefügt, Invert-Flag zu Geräteoptionen für Jalousien hinzugefügt.",
                "ru": "Добавлены опции в диалог конфигурации устройства, Добавлен флаг readonly для параметров устройства, Добавлен флаг инвертирования цветовой температуры для параметров устройства для освещения, Добавлен флаг инвертирования для параметров устройства для жалюзи.",
                "pt": "Adicionado opções para a caixa de diálogo de configuração do dispositivo, Adicionado readonly-bandeira para as opções do dispositivo, Adicionado sinalizador de temperatura da cor invertida para as opções do dispositivo para luzes, Adicionado inverter bandeira para as opções do dispositivo para blinds.",
                "nl": "Opties toegevoegd aan apparaatconfiguratiedialoog, readonly-flag toegevoegd aan apparaatopties, vlag inverteer kleurtemperatuur toegevoegd aan apparaatopties voor lichten, vlag in invert toegevoegd aan apparaatopties voor blinds.",
                "fr": "Ajout d'options à la boîte de dialogue de configuration du périphérique, Ajout de readonly-flag aux options de périphérique, Ajout d'un indicateur de température de couleur inversé aux options de dispositif pour les lumières, Ajout d'un indicateur d'inversion aux options de dispositif pour les stores.",
                "it": "Aggiunte opzioni alla finestra di configurazione del dispositivo, aggiunte le opzioni readonly flag alle opzioni del dispositivo, il contrassegno della temperatura del colore invertito aggiunto alle opzioni del dispositivo per le luci, Aggiunto il contrassegno invertito alle opzioni del dispositivo per i bui.",
                "es": "Se agregaron opciones al cuadro de diálogo de configuración del dispositivo, Se agregó la marca de solo lectura a las opciones del dispositivo, Se agregó la marca de temperatura de color invertido a las opciones del dispositivo para las luces, Se agregó la bandera de inversión a las opciones del dispositivo para persianas.",
                "pl": "Dodano opcje do okna konfiguracji urządzenia, Dodano opcje tylko do odczytu do opcji urządzenia, Dodano flagę odwróconej temperatury koloru do opcji urządzenia dla świateł, Dodano flagę odwracania do opcji urządzenia dla rolet.",
                "zh-cn": "添加了设备配置对话框的选项，为设备选项添加了readonly-flag，为灯光的设备选项添加了反转色温标志，为百叶窗的设备选项添加了反转标志。"
            },
            "0.0.45": {
                "en": "Devices are now zoomed to fit screen (configurable under options)",
                "de": "Geräte werden jetzt gezoomt, um sie an den Bildschirm anzupassen (konfigurierbar unter Optionen)",
                "ru": "Устройства теперь масштабируются по размеру экрана (настраивается в настройках)",
                "pt": "Os dispositivos agora são ampliados para caber na tela (configurável em opções)",
                "nl": "Apparaten worden nu ingezoomd om op het scherm te passen (configureerbaar onder opties)",
                "fr": "Les appareils sont maintenant zoomés pour s'adapter à l'écran (configurable dans les options)",
                "it": "I dispositivi ora sono ingranditi per adattarsi allo schermo (configurabile sotto opzioni)",
                "es": "Los dispositivos ahora se acercan para adaptarse a la pantalla (configurable en las opciones)",
                "pl": "Urządzenia są teraz powiększane w celu dopasowania do ekranu (konfigurowalne w opcjach)",
                "zh-cn": "设备现在缩放到适合屏幕（可在选项下配置）"
            },
            "0.0.44": {
                "en": "Fixed incomplete loading of admin page with some settings, Added datapoint-configuration via custom-dialog",
                "de": "Das unvollständige Laden der Admin-Seite mit einigen Einstellungen wurde behoben. Die Datenpunkt-Konfiguration wurde über einen benutzerdefinierten Dialog hinzugefügt",
                "ru": "Исправлена ​​неполная загрузка страницы администратора с некоторыми настройками, добавлена ​​конфигурация datapoint через custom-диалог",
                "pt": "Corrigido o carregamento incompleto da página de administração com algumas configurações. Adicionada configuração de ponto de dados via caixa de diálogo personalizada",
                "nl": "Vast onvolledig laden van admin-pagina met enkele instellingen, Toegevoegd datapoint-configuratie via custom-dialoog",
                "fr": "Correction du chargement incomplet de la page d'administration avec certains paramètres, Ajout de la configuration du point de donnée via un dialogue personnalisé",
                "it": "Correzione del caricamento incompleto della pagina di amministrazione con alcune impostazioni, aggiunta della configurazione di punti di accesso tramite finestra di dialogo personalizzata",
                "es": "Se corrigió la carga incompleta de la página de administración con algunas configuraciones. Se agregó la configuración del punto de datos a través del diálogo personalizado",
                "pl": "Naprawiono niekompletne ładowanie strony administracyjnej z niektórymi ustawieniami, Dodano konfigurację punktu danych poprzez niestandardowe okno dialogowe",
                "zh-cn": "修复了管理页面的不完整加载和一些设置，通过自定义对话框添加了数据点配置"
            },
            "0.0.43": {
                "en": "Changed initialization of socket.io to an asynchronous process to wait for connection before trying to use file-operations, Added general datapoint ADDITIONAL_INFO to display additional datapoints at the bottom of the info-dialog, Fixed value list type conflict.",
                "de": "Die Initialisierung von socket.io wurde in einen asynchronen Prozess geändert, um auf die Verbindung zu warten, bevor versucht wird, Dateioperationen zu verwenden. Der allgemeine Datenpunkt ADDITIONAL_INFO wurde hinzugefügt, um zusätzliche Datenpunkte am unteren Rand des Infodialogs anzuzeigen.",
                "ru": "Изменена инициализация socket.io для асинхронного процесса ожидания соединения, прежде чем пытаться использовать файловые операции. Добавлена ​​общая точка назначения данных ADDITIONAL_INFO для отображения дополнительных точек данных в нижней части информационного диалога. Конфликт типа списка фиксированных значений.",
                "pt": "Alterada a inicialização de socket.io para um processo assíncrono para aguardar conexão antes de tentar usar operações de arquivo, Adicionado ponto de dados geral ADDITIONAL_INFO para exibir pontos de dados adicionais na parte inferior do diálogo de informações, Conflito de tipo de lista de valores fixos.",
                "nl": "Gewijzigde initialisatie van socket.io in een asynchroon proces om te wachten op verbinding voordat geprobeerd werd om bestandsbewerkingen te gebruiken, Toegevoegd algemeen datapunt ADDITIONAL_INFO om extra datapunten weer te geven onderaan in het infodialoogvenster, Type conflict met vaste waarde lijst.",
                "fr": "Initialisation de socket.io modifiée en un processus asynchrone pour attendre la connexion avant d'essayer d'utiliser les opérations sur les fichiers, Point de données général ajouté ADDITIONAL_INFO pour afficher des points de données supplémentaires au bas de la boîte de dialogue d'informations, Conflit de types de liste de valeurs fixes.",
                "it": "Inizializzazione modificata di socket.io in un processo asincrono per attendere la connessione prima di provare a utilizzare le operazioni sui file, Aggiunto datapoint generale ADDITIONAL_INFO per visualizzare punti dati aggiuntivi nella parte inferiore della finestra di dialogo delle informazioni, Conflitto di tipo elenco di valori fissi.",
                "es": "Se cambió la inicialización de socket.io a un proceso asíncrono para esperar la conexión antes de intentar usar operaciones de archivo. Se agregó el punto de datos general ADDITIONAL_INFO para mostrar puntos de datos adicionales en la parte inferior del diálogo de información, conflicto de tipo de lista de valor fijo.",
                "pl": "Zmieniono inicjalizację socket.io na proces asynchroniczny, aby poczekać na połączenie przed próbą użycia operacji na plikach, Dodano ogólny punkt danych ADDITIONAL_INFO, aby wyświetlić dodatkowe punkty danych na dole okna dialogowego informacji, Konflikt listy wartości stałych.",
                "zh-cn": "在尝试使用文件操作之前，将socket.io的初始化更改为异步进程以等待连接，添加了通用数据点ADDITIONAL_INFO以在信息对话框底部显示其他数据点，固定值列表类型冲突。"
            },
            "0.0.42": {
                "en": "Adjusted pathes of demo-files.",
                "de": "Angepasste Pfade von Demo-Dateien.",
                "ru": "Скорректированы патчи демо-файлов.",
                "pt": "Correções ajustadas de arquivos de demonstração.",
                "nl": "Aangepaste paden van demo-bestanden.",
                "fr": "Chemins ajustés des fichiers de démonstration.",
                "it": "Percorsi corretti dei file demo.",
                "es": "Ajustado las rutas de los archivos de demostración.",
                "pl": "Dostosowane patche plików demo.",
                "zh-cn": "调整了演示文件的路径。"
            },
            "0.0.41": {
                "en": "Major Change - The location of the uploaded userimages has changed, so the images can be accessed by backup-function of iobroker - the images will be moved to the new location automatically - please open admin-page for ALL instances and save the settings to adjust the filenames of used images automatically, Inverted colortemperature-scale for hue-lights (now it uses the mired-scale = micro reciprocal degree-scale instead of kelvin), (Ansgar Schulte) Added Up and Down Buttons to Blinds, When creating a directory it will be entered, When creating a directory it will be entered, Added Effect-Section to Light, If a state is not set yet, a standard value will be used.",
                "de": "Wichtige Änderung - Der Speicherort der hochgeladenen Benutzerbilder hat sich geändert, so dass über die Backup-Funktion von iobroker auf die Bilder zugegriffen werden kann. Die Bilder werden automatisch an den neuen Speicherort verschoben. Bitte öffnen Sie die Admin-Seite für ALLE Instanzen und speichern Sie die Einstellungen, um sie anzupassen ",
                "ru": "Основные изменения - местоположение загруженных образов пользователя изменилось, поэтому к изображениям можно получить доступ с помощью функции резервного копирования iobroker - изображения будут автоматически перемещены в новое местоположение - откройте страницу администратора для ВСЕХ экземпляров и сохраните настройки для настройки ",
                "pt": "Major Change - A localização das imagens do usuário enviadas foi alterada, para que as imagens possam ser acessadas pela função de backup do iobroker - as imagens serão movidas para o novo local automaticamente - abra a página de administração para TODAS as instâncias e salve as configurações para ajustar ",
                "nl": "Grote verandering - De locatie van de geüploade afbeeldingen is gewijzigd, dus de afbeeldingen zijn toegankelijk via de backup-functie van iobroker - de afbeeldingen worden automatisch naar de nieuwe locatie verplaatst - open de admin-pagina voor ALLE instanties en sla de instellingen op om aan te passen ",
                "fr": "Changement majeur - L'emplacement des images utilisateur téléchargées a été modifié. Il est donc possible d'accéder aux images à l'aide de la fonction de sauvegarde d'iobroker. Les images seront automatiquement déplacées vers le nouvel emplacement. Ouvrez la page admin pour TOUTES les instances et enregistrez les paramètres à ajuster. ",
                "it": "Modifica principale: la posizione delle immagini utente caricate è cambiata, quindi è possibile accedere alle immagini tramite la funzione di backup di iobroker - le immagini verranno spostate automaticamente nella nuova posizione - aprire la pagina di amministrazione per TUTTE le istanze e salvare le impostazioni per regolare ",
                "es": "Cambio importante: la ubicación de las imágenes de usuario cargadas ha cambiado, por lo que se puede acceder a las imágenes con la función de respaldo de iobroker. Las imágenes se moverán a la nueva ubicación automáticamente. Abra la página de administración para TODAS las instancias y guarde las configuraciones para ajustarlas. ",
                "pl": "Duża zmiana - Położenie przesłanych zdjęć użytkowników zmieniło się, więc dostęp do obrazów można uzyskać za pomocą funkcji kopii zapasowej iobroker - obrazy zostaną automatycznie przeniesione do nowej lokalizacji - otwórz stronę administratora dla WSZYSTKICH wystąpień i zapisz ustawienia, aby dostosować ",
                "zh-cn": "主要更改 - 上传的userimages的位置已更改，因此可以通过iobroker的备份功能访问图像 - 图像将自动移动到新位置 - 请打开所有实例的admin-page并保存设置以进行调整"
            },
            "0.0.40": {
                "en": "Appended missing conn_js in admin-folder.",
                "de": "Fehlende conn_js im Admin-Ordner angehängt.",
                "ru": "Добавлен недостающий conn_js в админ-папку.",
                "pt": "Appended missing conn_js in admin-folder.",
                "nl": "Bijgesloten ontbrekende conn_js in admin-map.",
                "fr": "Conn_js manquant ajouté dans le dossier admin.",
                "it": "Aggiunti conn_js mancanti nella cartella admin.",
                "es": "Adjunto faltan conn_js en la carpeta admin.",
                "pl": "Dodano brakujące conn_js w folderze administracyjnym.",
                "zh-cn": "管理文件夹中缺少conn_js。"
            },
            "0.0.39": {
                "en": "Now file-operations in admin should work (file and directory renaming and deleting), Added Image-Popup in admin.",
                "de": "Jetzt sollten die Dateioperationen in admin funktionieren (Umbenennen und Löschen von Dateien und Verzeichnissen). Image-Popup in admin hinzugefügt.",
                "ru": "Теперь файловые операции в админке должны работать (переименование и удаление файлов и каталогов), добавлен Image-Popup в админке.",
                "pt": "Agora as operações de arquivo no admin devem funcionar (renomeação e exclusão de arquivos e diretórios), Adicionado Image-Popup no admin.",
                "nl": "Nu moeten bestandsbewerkingen in admin werken (bestands- en map hernoemen en verwijderen), Image-Popup toegevoegd in admin.",
                "fr": "Maintenant, les opérations de fichier dans admin devraient fonctionner (renommer et supprimer des fichiers et des répertoires), a ajouté Image-Popup dans admin.",
                "it": "Ora le operazioni sui file in admin dovrebbero funzionare (file e directory rinominare e cancellare), Aggiunto Image-Popup in admin.",
                "es": "Ahora las operaciones de archivo en admin deberían funcionar (cambio de nombre y eliminación de archivos y directorios), se agregó Image-Popup en admin.",
                "pl": "Teraz operacje na plikach w admin powinny działać (zmiana nazwy pliku i katalogu oraz usuwanie), Dodano Image-Popup w admin.",
                "zh-cn": "现在admin中的文件操作应该工作（文件和目录重命名和删除），在admin中添加了Image-Popup。"
            },
            "0.0.38": {
                "en": "Again changes to forced touch for gained compatibility",
                "de": "Erneut Änderungen an erzwungener Berührung, um Kompatibilität zu erreichen",
                "ru": "Снова изменения принудительного прикосновения для получения совместимости",
                "pt": "Mais uma vez muda para toque forçado para compatibilidade ganhada",
                "nl": "Wederom verandert dit in geforceerde aanrakingen voor verbeterde compatibiliteit",
                "fr": "Encore une fois des changements au contact forcé pour une compatibilité améliorée",
                "it": "Di nuovo cambia in tocco forzato per ottenere compatibilità",
                "es": "Nuevamente cambia al toque forzado para ganar compatibilidad",
                "pl": "Ponownie zmiany wymuszonego dotyku dla uzyskania kompatybilności",
                "zh-cn": "再次改为强制触摸以获得兼容性"
            },
            "0.0.37": {
                "en": "Some more little changes to forced touch, Added option to open a view via url by adding 'home=<viewId>' to url-parameters",
                "de": "Weitere kleine Änderungen bei der erzwungenen Berührung. Option zum Öffnen einer Ansicht über die URL durch Hinzufügen von 'home = <viewId>' zu den URL-Parametern hinzugefügt",
                "ru": "Еще несколько небольших изменений в принудительном касании. Добавлена ​​возможность открывать представление через URL, добавив home = <viewId> к параметрам url.",
                "pt": "Mais algumas pequenas alterações ao toque forçado, opção adicionada para abrir uma visualização via URL, adicionando 'home = <viewId>' aos parâmetros-url",
                "nl": "Nog wat kleine wijzigingen aan geforceerde aanrakingen, optie toegevoegd om een ​​weergave te openen via url door 'home = <viewId>' toe te voegen aan URL-parameters",
                "fr": "Quelques modifications supplémentaires apportées au toucher forcé, option ajoutée pour ouvrir une vue via une URL en ajoutant 'home = <viewId>' à url-parameters",
                "it": "Alcune più piccole modifiche al tocco forzato, opzione aggiunta per aprire una vista tramite url aggiungendo 'home = <viewId>' ai parametri url",
                "es": "Algunos cambios más pequeños al toque forzado, opción agregada para abrir una vista vía url agregando 'home = <viewId>' a url-parameters",
                "pl": "Kilka drobnych zmian w wymuszonym dotknięciu, Dodano opcję otwierania widoku przez URL, dodając „home = <viewId>” do parametrów url",
                "zh-cn": "对强制触摸的一些更改很少，添加了通过url打开视图的选项，将“home = <viewId>”添加到url-parameters"
            },
            "0.0.36": {
                "en": "Added compatibility for some android devices to forced touch, Changed the way hue and ct is displayed for better compatibility to some devices.",
                "de": "Kompatibilität für einige Android-Geräte zur erzwungenen Berührung hinzugefügt. Die Anzeige von Farbton und ct wurde geändert, um die Kompatibilität mit einigen Geräten zu verbessern.",
                "ru": "Добавлена ​​совместимость для некоторых устройств Android для принудительного касания, Изменен способ отображения оттенков и ct для лучшей совместимости с некоторыми устройствами.",
                "pt": "Adicionado compatibilidade para alguns dispositivos Android para toque forçado, mudou a maneira como matiz e ct é exibido para melhor compatibilidade com alguns dispositivos.",
                "nl": "Compatibiliteit toegevoegd voor sommige Android-apparaten om geforceerd aan te raken, veranderde de manier waarop tint en ct worden weergegeven voor betere compatibiliteit met sommige apparaten.",
                "fr": "Ajout de la compatibilité de certains appareils Android au contact forcé, modification de la façon dont la teinte et le ct sont affichés pour une meilleure compatibilité avec certains appareils.",
                "it": "Aggiunta compatibilità per alcuni dispositivi Android al tocco forzato, Modificata la modalità di visualizzazione di hue e ct per una migliore compatibilità con alcuni dispositivi.",
                "es": "Se agregó compatibilidad para algunos dispositivos Android al toque forzado. Se modificó la forma en que se muestran el tono y el sonido para una mejor compatibilidad con algunos dispositivos.",
                "pl": "Dodano kompatybilność niektórych urządzeń z systemem Android z wymuszonym dotknięciem, Zmieniono sposób wyświetlania odcienia i ct, aby uzyskać lepszą kompatybilność z niektórymi urządzeniami.",
                "zh-cn": "添加了一些Android设备与强制触摸的兼容性，更改了hue和ct的显示方式，以便更好地兼容某些设备。"
            },
            "0.0.35": {
                "en": "Fixed crash of frontend, if a device has no role and added info to admin to chose a role, Removed filtering of states in select-id-dialog for autocreate, Further improvement of forced touch with force-indicator and hopefully a better compatibility with more devices.",
                "de": "Absturz des Frontends behoben, wenn ein Gerät keine Rolle hat und dem Administrator Informationen hinzugefügt wurden, um eine Rolle auszuwählen. Das Filtern von Zuständen im Auswahl-ID-Dialog für die automatische Erstellung wurde entfernt. Eine weitere Verbesserung der erzwungenen Berührung mit der Kraftanzeige und hoffentlich eine bessere Kompatibilität mit mehr ",
                "ru": "Исправлен сбой внешнего интерфейса, если устройство не имеет роли и добавлена ​​информация для администратора по выбору роли, Удалена фильтрация состояний в диалоге выбора идентификатора для автоматического создания, Дальнейшее улучшение принудительного прикосновения с помощью индикатора силы и, возможно, лучшая совместимость с другими ",
                "pt": "Corrigido o travamento do frontend, se um dispositivo não tiver função e adicionado informações ao administrador para escolher uma função, Removido o filtro de estados na caixa de diálogo select-id para autocreate, Melhoria adicional do toque forçado com indicador de força e esperançosamente uma melhor compatibilidade com mais ",
                "nl": "Vaste crash van frontend, als een apparaat geen rol heeft en toegevoegde info aan admin om een ​​rol te kiezen, Verwijderd filteren van toestanden in select-id-dialoog voor autocreate, Verdere verbetering van geforceerde aanrakingen met force-indicator en hopelijk een betere compatibiliteit met meer ",
                "fr": "Correction du crash de l'interface, si un périphérique n'a pas de rôle et ajout d'informations à l'administrateur pour choisir un rôle, Filtrage supprimé des états dans select-id-dialog pour la création automatique, Amélioration du contact forcé avec indicateur de force et, espérons-le, d'une meilleure compatibilité avec d'autres ",
                "it": "Risolto il crash del frontend, se un dispositivo non ha ruolo e ha aggiunto informazioni all'amministratore per scegliere un ruolo, Rimosso il filtraggio degli stati in select-id-dialog per autocreate, Ulteriore miglioramento del tocco forzato con indicatore di forza e si spera una migliore compatibilità con più ",
                "es": "Se solucionó el bloqueo de la interfaz, si un dispositivo no tiene un rol y se agregó información a la administración para elegir un rol, se eliminó el filtrado de estados en el cuadro de diálogo Seleccionar-ID para autocrear, una mejora adicional del contacto forzado con el indicador de fuerza y, con suerte, una mejor compatibilidad con más ",
                "pl": "Naprawiono awarię nakładki, jeśli urządzenie nie ma żadnej roli i dodało informacje do administratora, aby wybrać rolę, Usunięto filtrowanie stanów w oknie dialogowym select-id dla autokreacji, Dalsza poprawa wymuszonego dotyku ze wskaźnikiem siły i, miejmy nadzieję, lepsza kompatybilność z więcej ",
                "zh-cn": "修复了前端崩溃，如果设备没有角色并向管理员添加信息以选择角色，则在select-id-dialog中删除状态过滤以进行自动创建，使用强制指示器进一步改善强制触摸，并希望更好地兼容更多"
            },
            "0.0.34": {
                "en": "Added forced touch menu (press hard or press long on unsupported devices), wich will give more room for extended features in future, Linked Views can now be set for all roles and are available in the dialog and by a forced touch, Added timestamp for Window, Door, Fire, Temperature, Humidity, Brightness and Motion, Fixed state for switch if type is number",
                "de": "Menü mit erzwungener Berührung hinzugefügt (Fest drücken oder Lang drücken bei nicht unterstützten Geräten), das zukünftig mehr Platz für erweiterte Funktionen bietet. Verknüpfte Ansichten können jetzt für alle Rollen festgelegt werden und sind im Dialogfeld und durch erzwungene Berührung verfügbar. Zeitstempel hinzugefügt für ",
                "ru": "Добавлено принудительное сенсорное меню (жмите сильно или долго нажимайте на неподдерживаемых устройствах), которое даст больше места для расширенных функций в будущем, теперь можно установить связанные виды для всех ролей и доступны в диалоге и принудительным касанием, Добавлена ​​метка времени для ",
                "pt": "Adicionado menu de toque forçado (pressione ou pressione longamente em dispositivos não suportados), o que dará mais espaço para recursos estendidos no futuro, Linked Views agora pode ser definido para todas as funções e estão disponíveis na caixa de diálogo e por um toque forçado, Adicionado timestamp para ",
                "nl": "Toegevoegd geforceerd aanraakmenu (druk hard of druk lang op niet-ondersteunde apparaten), wat in de toekomst meer ruimte zal bieden voor uitgebreide functies, Linked Views kunnen nu worden ingesteld voor alle rollen en zijn beschikbaar in het dialoogvenster en door een geforceerde aanrakingen, Toegevoegd tijdstempel voor ",
                "fr": "Ajout du menu tactile forcé (appuyer fort ou appuyer longuement sur des appareils non pris en charge), ce qui laissera plus de place pour les fonctionnalités étendues, Les vues liées peuvent maintenant être définies pour tous les rôles et sont disponibles dans la boîte de dialogue ",
                "it": "Aggiunto menu a sfioramento forzato (premere a lungo o premere a lungo sui dispositivi non supportati), che in futuro offrirà più spazio per funzionalità estese, le viste collegate possono ora essere impostate per tutti i ruoli e sono disponibili nella finestra di dialogo e con un tocco forzato, Aggiunto timestamp per ",
                "es": "Se agregó el menú de toque forzado (presione con fuerza o presione prolongadamente en dispositivos no compatibles), lo que le dará más espacio para funciones extendidas en el futuro, las Vistas vinculadas ahora se pueden configurar para todos los roles y están disponibles en el diálogo y con un toque forzado. ",
                "pl": "Dodano wymuszone menu dotykowe (naciskaj mocno lub naciskaj długo na nieobsługiwanych urządzeniach), co da więcej miejsca na rozszerzone funkcje w przyszłości. Połączone widoki można teraz ustawić dla wszystkich ról i są one dostępne w oknie dialogowym i wymuszonym dotknięciu, Dodano znacznik czasu dla ",
                "zh-cn": "添加了强制触摸菜单（在不支持的设备上按下或长按），将来会为扩展功能提供更多空间，现在可以为所有角色设置链接视图，并且可以在对话框中通过强制触摸获得，添加了时间戳"
            },
            "0.0.33": {
                "en": "Added WINDOW_OPENING_REPORTING to thermostat and homematic-thermostat, Fixed marquee not always starting correctly",
                "de": "WINDOW_OPENING_REPORTING für Thermostat und Homematic-Thermostat hinzugefügt. Laufschrift startet nicht immer korrekt",
                "ru": "Добавлен WINDOW_OPENING_REPORTING для термостата и homematic-термостата, исправлена ​​ошибка, при которой не всегда корректно запускался шатер",
                "pt": "Adicionou WINDOW_OPENING_REPORTING ao termostato e ao termostato homematic. Marcação fixa nem sempre é iniciada corretamente",
                "nl": "WINDOW_OPENING_REPORTING toegevoegd aan thermostaat en homematicethermostaat, vast kader niet altijd correct gestart",
                "fr": "Ajout de WINDOW_OPENING_REPORTING au thermostat et au thermostat homematic, le rectangle de sélection fixe ne démarre pas toujours correctement",
                "it": "Aggiunto WINDOW_OPENING_REPORTING a termostato e termostato omostatico, Selezione fissa non sempre avviata correttamente",
                "es": "Se agregó WINDOW_OPENING_REPORTING al termostato y al termostato homemático. La marquesina fija no siempre se inicia correctamente",
                "pl": "Dodano WINDOW_OPENING_REPORTING do termostatu i termostatu homematyki, Naprawiono nie zawsze poprawne uruchamianie markizy",
                "zh-cn": "将WINDOW_OPENING_REPORTING添加到恒温器和家庭恒温器，固定选框并不总是正确启动"
            },
            "0.0.32": {
                "en": "Added Battery, Heaters are displayed as inactive, if set-value is at its minimum, Added check for existance of common.role before rendering view",
                "de": "Batterie hinzugefügt, Heizungen werden als inaktiv angezeigt, wenn der eingestellte Wert am niedrigsten ist. Überprüfung auf Vorhandensein einer gemeinsamen Rolle vor dem Rendern der Ansicht hinzugefügt",
                "ru": "Добавлена ​​батарея, нагреватели отображаются как неактивные, если заданное значение минимально, добавлена ​​проверка на наличие common.role перед просмотром рендера",
                "pt": "Bateria adicionada, Aquecedores são exibidos como inativos, se o valor-conjunto estiver no mínimo, Verificação adicionada para existência de common.role antes da exibição de renderização",
                "nl": "Toegevoegd batterij, Verwarmers worden weergegeven als inactief, als de ingestelde waarde op zijn minimum is, Toegevoegd controle voor het bestaan ​​van common.role vóór weergave weergave",
                "fr": "Batterie ajoutée, les éléments chauffants sont affichés comme étant inactifs, si la valeur définie est minimale, Vérification ajoutée de l'existence de common.role avant de rendre la vue",
                "it": "Aggiunta batteria, i riscaldatori vengono visualizzati come inattivi, se il valore impostato è al minimo, Aggiunto controllo dell'esistenza di common.role prima della visualizzazione rendering",
                "es": "Batería agregada, los calentadores se muestran como inactivos, si el valor establecido es mínimo, compruebe la existencia de common.role antes de mostrar la vista",
                "pl": "Dodano baterię, grzałki są wyświetlane jako nieaktywne, jeśli ustawiona wartość jest na minimalnym poziomie, Dodano sprawdzenie istnienia common.role przed renderowaniem widoku",
                "zh-cn": "添加电池，加热器显示为非活动状态，如果设置值最小，则在渲染视图之前添加检查common.role是否存在"
            },
            "0.0.31": {
                "en": "Fixed some typos, Enhanced colour-mixing of light with seperate brightness-datapoints for color and white, Rewritten rendering of view and dialog as praparation for further enhancements, Added option to colorize Device-Texts.",
                "de": "Einige Tippfehler behoben, Verbesserte Farbmischung von Licht mit separaten Helligkeitsdatenpunkten für Farbe und Weiß, Umgeschriebene Darstellung von Ansicht und Dialogfeld als Vorbereitung für weitere Verbesserungen, Option zum Einfärben von Gerätetexten hinzugefügt.",
                "ru": "Исправлены некоторые опечатки, улучшено смешение цветов с отдельными точками яркости для цвета и белого, переписан рендеринг вида и диалога в качестве подготовки к дальнейшим улучшениям, добавлена ​​опция для раскрашивания текстов устройства.",
                "pt": "Corrigido alguns erros de digitação, Melhoria da mistura de cores da luz com distintas datapoints de brilho para cor e branco, Reescrita renderização de visão e diálogo como praparação para melhorias adicionais, Opção adicionada para colorir Textos de Dispositivos.",
                "nl": "Enkele typfouten gecorrigeerd, Verbeterde kleurmenging van licht met afzonderlijke helderheidsdatapunten voor kleur en wit, Herschreven weergaveweergave en dialoogvenster als praparatie voor verdere verbeteringen, Optie toegevoegd om apparaatteksten in te kleuren.",
                "fr": "Correction de quelques fautes de frappe, Amélioration du mélange de couleurs de lumière avec des points de données de luminosité distincts pour la couleur et le blanc, Rendu du rendu de vue et de dialogue réécrit en guise de préparation pour des améliorations supplémentaires, Ajout d'une option permettant de colorier les textes de l'appareil.",
                "it": "Risolti alcuni errori di battitura, miglioramento della miscelazione dei colori della luce con punti luce separati per il colore e il bianco, Riscritto il rendering della vista e il dialogo come miglioramento per ulteriori miglioramenti, Aggiunta l'opzione per colorare i Testi dispositivo.",
                "es": "Se corrigieron algunos errores tipográficos, se mejoró la mezcla de color de la luz con puntos de datos de brillo separados para el color y el blanco, se volvió a escribir la vista y el diálogo como praparación para otras mejoras, se agregó la opción para colorear los textos del dispositivo",
                "pl": "Naprawiono kilka literówek, ulepszone mieszanie kolorów światła z oddzielnymi punktami jasności-koloru dla koloru i bieli, Przepisane renderowanie widoku i okno dialogowe jako przygotowanie do dalszych ulepszeń, Dodano opcję kolorowania tekstu urządzenia.",
                "zh-cn": "修正了一些拼写错误，增强了颜色混合的光线和单独的亮度 - 颜色和白色的数据点，重写了视图和对话框的渲染作为进一步增强的准备，增加了设备文本着色的选项。"
            },
            "0.0.30": {
                "en": "Fixed io-package-json.",
                "de": "Io-package-json behoben.",
                "ru": "Исправлено io-package-json.",
                "pt": "Corrigido io-package-json.",
                "nl": "Vaste io-pakket-json.",
                "fr": "Correction de io-package-json.",
                "it": "Risolto il problema con io-package-json.",
                "es": "Arreglado el io-package-json.",
                "pl": "Naprawiono io-package-json.",
                "zh-cn": "修复了io-package-json。"
            },
            "0.0.29": {
                "en": "Changed parts of the code to be backward-compatible to older browsers like ie 11, Now its possible to define a value list for a data point under native-states wich will have a greater priority than a value list under common-states, Updated dependency for axios to v0-0-19 to fix a scurity issue.",
                "de": "Teile des Codes wurden geändert, um mit älteren Browsern wie z. B. 11 abwärtskompatibel zu sein. Es ist jetzt möglich, eine Werteliste für einen Datenpunkt unter Native-States zu definieren, die eine höhere Priorität als eine Werteliste unter Common-States haben ",
                "ru": "Изменены части кода для обеспечения обратной совместимости со старыми браузерами, такими как, например, 11. Теперь возможно определить список значений для точки данных в собственных состояниях, которые будут иметь больший приоритет, чем список значений в общих состояниях, Обновлена ​​зависимость ",
                "pt": "Partes alteradas do código para ser compatível com versões anteriores para navegadores mais antigos como, por exemplo, 11, agora é possível definir uma lista de valores para um ponto de dados sob estados nativos que terão uma prioridade maior que uma lista de valores em estados comuns ",
                "nl": "Veranderde delen van de code om achterwaarts compatibel te zijn met oudere browsers zoals bv. 11, Nu is het mogelijk om een ​​waardenlijst voor een gegevenspunt onder natiestaten te definiëren die een grotere prioriteit hebben dan een waardenlijst onder common-states, bijgewerkte afhankelijkheid ",
                "fr": "Modification des parties du code pour une compatibilité ascendante avec les navigateurs plus anciens, par exemple 11, il est maintenant possible de définir une liste de valeurs pour un point de données dans des états natifs, qui aura une priorité supérieure à une liste de valeurs dans des états communs, dépendance mise à jour ",
                "it": "Parti modificate del codice per essere compatibili con le versioni precedenti di browser precedenti come 11, ora è possibile definire una lista valori per un punto dati in stati nativi che avrà una priorità maggiore di una lista valori in stati comuni, dipendenza aggiornata ",
                "es": "Las partes del código modificadas para que sean compatibles con versiones anteriores de navegadores más antiguos como, por ejemplo, 11, ahora es posible definir una lista de valores para un punto de datos en estados nativos que tendrá una prioridad mayor que una lista de valores en estados comunes, dependencia actualizada ",
                "pl": "Zmieniono części kodu, aby były kompatybilne wstecz ze starszymi przeglądarkami, takimi jak np. 11, Teraz możliwe jest zdefiniowanie listy wartości dla punktu danych w stanach natywnych, które będą miały wyższy priorytet niż lista wartości w stanach wspólnych, Aktualizacja zależności ",
                "zh-cn": "将部分代码更改为向后兼容旧版浏览器，例如11，现在可以为本机状态下的数据点定义值列表，其优先级高于常见状态下的值列表，更新后的依赖关系"
            },
            "0.0.28": {
                "en": "Added datapoint POWER to switch, fan and light, Fixed marquee for small info texts in the upper right corner at big screen sizes, Added more options for configuring header-colors and device-colors (experimental state), Text-color ist not configurable yet.",
                "de": "Datenpunkt POWER zum Schalten, Lüften und Beleuchten hinzugefügt. Feste Auswahl für kleine Infotexte in der oberen rechten Ecke bei großen Bildschirmgrößen. Weitere Optionen zum Konfigurieren von Kopf- und Gerätefarben (experimenteller Status) hinzugefügt. Textfarbe ist noch nicht konfigurierbar ",
                "ru": "Добавлено Datapoint POWER для переключения, вентилятора и подсветки, Исправлена ​​помеха для небольших информационных текстов в верхнем правом углу при больших размерах экрана, Добавлены дополнительные параметры для настройки цветов заголовка и цветов устройства (экспериментальное состояние), Цвет текста еще не настраивается ",
                "pt": "Adicionado Datapoint POWER para alternar, ventilador e luz, Marcador fixo para pequenos textos de informação no canto superior direito em tamanhos de tela grande, Adicionado mais opções para configurar cores de cabeçalho e cores do dispositivo (estado experimental), Cor de texto não é configurável ainda ",
                "nl": "Datapunt POWER toegevoegd om te schakelen, te ventileren en te verlichten, Vaste selectiekader voor kleine informatieteksten in de rechterbovenhoek bij grote schermformaten, Meer opties toegevoegd voor het configureren van koptekstkleuren en apparaatkleuren (experimentele status), Tekstkleur is nog niet configureerbaar ",
                "fr": "Point de données ajouté POWER pour allumer, allumer et éteindre, rectangle de sélection fixe pour les petits textes d’information dans le coin supérieur droit pour les grandes tailles d’écran, ajout de plus d’options pour la configuration des couleurs d’en-tête et des couleurs de périphérique (état expérimental), Couleur du texte n’a pas encore été configurée ",
                "it": "Aggiunto punto di riferimento POWER per passare, ventilatore e luce, riquadro fisso per piccoli messaggi informativi nell'angolo in alto a destra con schermi di grandi dimensioni, Aggiunte ulteriori opzioni per la configurazione di colori dell'intestazione e colori del dispositivo (stato sperimentale), Colore testo ist non ancora configurabile ",
                "es": "Se agregó el punto de datos POWER para cambiar, ventilador y luz, marquesina fija para pequeños textos de información en la esquina superior derecha en tamaños de pantalla grandes, se agregaron más opciones para configurar colores de encabezado y colores del dispositivo (estado experimental), el color del texto aún no se puede configurar ",
                "pl": "Dodano punkt danych POWER do przełączania, włączania i wyłączania światła, Naprawiono markizę dla małych tekstów informacyjnych w prawym górnym rogu przy dużych ekranach, Dodano więcej opcji konfiguracji kolorów nagłówka i kolorów urządzenia (stan eksperymentalny), Nie można jeszcze skonfigurować koloru tekstu ",
                "zh-cn": "为开关，风扇和灯添加了数据点POWER，在大屏幕尺寸的右上角为小信息文本添加了固定选框，添加了更多用于配置标题颜色和设备颜色的选项（实验状态），文本颜色不可配置"
            },
            "0.0.27": {
                "en": "Added marquee (scrolling text) for long states and device names (can be configured  in options), Added more toolbar-options, Enhanced handling of value lists, Disabled swiping when dialog is opened.",
                "de": "Laufschrift (Laufschrift) für lange Status und Gerätenamen hinzugefügt (kann in Optionen konfiguriert werden), Weitere Symbolleistenoptionen hinzugefügt, Verbesserte Handhabung von Wertelisten, Deaktiviertes Wischen beim Öffnen des Dialogfelds.",
                "ru": "Добавлен выделение (прокрутка текста) для длинных состояний и имен устройств (можно настроить в настройках), добавлены дополнительные параметры панели инструментов, улучшена обработка списков значений, отключено считывание при открытии диалогового окна.",
                "pt": "Adicionado letreiro (texto de rolagem) para estados longos e nomes de dispositivos (pode ser configurado em opções), Adicionado mais opções da barra de ferramentas, Manuseio aprimorado de listas de valores, Deslizamento desativado quando a caixa de diálogo é aberta.",
                "nl": "Toegevoegd selectiekader (scrollen tekst) voor lange staten en apparaatnamen (kan worden geconfigureerd in opties), meer werkbalk-opties toegevoegd, verbeterde afhandeling van waardenlijsten, uitgeschakeld vegen wanneer dialoogvenster wordt geopend.",
                "fr": "Ajout d'un rectangle de sélection (texte défilant) pour les états longs et les noms de périphérique (pouvant être configurés dans des options), ajout d'options supplémentaires pour la barre d'outils, gestion améliorée des listes de valeurs, balayage désactivé lors de l'ouverture de la boîte de dialogue.",
                "it": "Aggiunto perimetro (testo a scorrimento) per stati lunghi e nomi di dispositivi (può essere configurato in opzioni), Aggiunto più opzioni per le barre degli strumenti, Gestione avanzata degli elenchi di valori, Scorrimento disattivato quando viene aperta la finestra di dialogo.",
                "es": "Marquesina agregada (texto de desplazamiento) para estados largos y nombres de dispositivos (se pueden configurar en opciones), Se agregaron más opciones de la barra de herramientas, Manejo mejorado de listas de valores, Deslizamiento deshabilitado cuando se abre el cuadro de diálogo.",
                "pl": "Dodano markizę (przewijany tekst) dla długich stanów i nazw urządzeń (można skonfigurować w opcjach), Dodano więcej opcji paska narzędzi, Rozszerzona obsługa list wartości, Wyłączone przesuwanie po otwarciu okna dialogowego.",
                "zh-cn": "为长状态和设备名称添加了选取框（滚动文本）（可以在选项中配置），添加了更多工具栏选项，增强了值列表的处理，打开对话框时禁用了滑动。"
            },
            "0.0.26": {
                "en": "Added brightness to motion-sensor, Added options tab, You can now configure colors of toolbar, Fixed rendering of constants, Resized the demo-wallpapers for faster loading.",
                "de": "Helligkeit für Bewegungssensor hinzugefügt, Registerkarte \"Optionen\" hinzugefügt. Sie können jetzt die Farben der Symbolleiste konfigurieren. Behobenes Rendern von Konstanten. Die Größe der Demo-Hintergründe wurde geändert, um das Laden zu beschleunigen.",
                "ru": "Добавлена ​​яркость датчика движения, Добавлена ​​вкладка настроек, Теперь вы можете настроить цвета панели инструментов, Исправлен рендеринг констант, Изменен размер демо-обоев для более быстрой загрузки.",
                "pt": "Adicionado brilho ao sensor de movimento, guia Opções adicionadas, agora você pode configurar cores da barra de ferramentas, renderização fixa de constantes, redimensionados os papéis de parede demo para o carregamento mais rápido.",
                "nl": "Helderheid aan bewegingssensor toegevoegd, tabblad met toegevoegde opties, u kunt nu kleuren van de werkbalk configureren, vaste weergave van constanten, de grootte van de demoviews aangepast om sneller te laden.",
                "fr": "Ajout de la luminosité au détecteur de mouvement, onglet Options ajoutées, vous pouvez maintenant configurer les couleurs de la barre d'outils, rendu fixe des constantes, redimensionner les fonds d'écran démo pour un chargement plus rapide.",
                "it": "Aggiunta luminosità al sensore di movimento, scheda Opzioni aggiunte, Ora è possibile configurare i colori della barra degli strumenti, Rendering fisso delle costanti, Ridimensionamento degli sfondi demo per un caricamento più veloce.",
                "es": "Brillo agregado al sensor de movimiento, pestaña Opciones agregadas, ahora puede configurar los colores de la barra de herramientas, la representación fija de constantes, cambiar el tamaño de los fondos de pantalla de demostración para una carga más rápida.",
                "pl": "Dodano czujnik jasności do ruchu, karta Dodane opcje, Możesz teraz skonfigurować kolory paska narzędzi, Naprawiono renderowanie stałych, Zmieniono rozmiar tapet demo dla szybszego ładowania.",
                "zh-cn": "增加了运动传感器的亮度，添加了选项选项卡，您现在可以配置工具栏的颜色，固定常量渲染，调整演示壁纸的大小以加快加载速度。"
            },
            "0.0.25": {
                "en": "Added motion-sensor, Added description, how the frontend works, Added dialog for editing constants like SET_VALUE, URL or HTML, Changed the way arrays are stored, Added submit-button for values of type string, Added saturation to hue-lights, Better icons for color-temperature and brightness-sensor.",
                "de": "Hinzugefügt Bewegungssensor, hinzugefügt Beschreibung, wie die Frontend-Werke, hinzugefügt Dialog zur Bearbeitung Konstanten wie SET_VALUE, URL oder HTML, änderte sich die Art und Weise Arrays gespeichert sind, hinzugefügt Absende-Button für Werte vom Typ String, hinzugefügt Sättigung Farbton-Lichter, Better ",
                "ru": "Добавлен датчик движения, Добавлено описание, как работает внешний интерфейс, Добавлен диалог для редактирования констант, таких как SET_VALUE, URL или HTML, Изменен способ хранения массивов, Добавлена ​​кнопка отправки для значений типа string, Добавлена ​​насыщенность для подсветки, Лучше ",
                "pt": "Adicionado sensor de movimento, Adicionado descrição, como funciona o frontend, Adicionado caixa de diálogo para edição de constantes como SET_VALUE, URL ou HTML, Alterado a forma como as matrizes são armazenadas, Adicionado botão submit para valores do tipo string, Saturação adicionada para hue-lights, Melhor ",
                "nl": "Toegevoegd motion-sensor, Toegevoegd beschrijving, hoe de frontend werkt, Toegevoegd dialoog voor het bewerken van constanten zoals SET_VALUE, URL of HTML, Gewijzigd de manier waarop arrays worden opgeslagen, Toegevoegde submit-knop voor waarden van het type string, Toegevoegd verzadiging aan hue-lichten, Beter ",
                "fr": "Ajout de motion-sensor, Ajout de description, du fonctionnement de l'interface, Ajout d'une boîte de dialogue pour éditer des constantes telles que SET_VALUE, URL ou HTML, Modification du mode de stockage des tableaux, Ajout d'un bouton de soumission pour les valeurs de type chaîne, Ajout de la saturation à hue-lights, Meilleure ",
                "it": "Aggiunto sensore di movimento, Aggiunta descrizione, come funziona il frontend, Aggiunto dialogo per modificare costanti come SET_VALUE, URL o HTML, Cambiato il modo in cui sono memorizzati gli array, Aggiunto pulsante di invio per i valori di tipo stringa, Aggiunta saturazione a luci di tonalità, Migliore ",
                "es": "Sensor de movimiento agregado, Descripción agregada, cómo funciona la interfaz, Diálogo agregado para editar constantes como SET_VALUE, URL o HTML, Se modificó la forma en que se almacenan las matrices, Se agregó el botón de envío para los valores de tipo de cadena, Se agregó la saturación a hue-lights, Mejor ",
                "pl": "Dodano czujnik ruchu, Dodano opis, jak działa frontend, Dodano okno dialogowe do edycji stałych, takich jak SET_VALUE, URL lub HTML, Zmieniono sposób przechowywania tablic, Dodano przycisk wysyłania dla wartości typu string, Dodano nasycenie do odcieni, Lepsze ",
                "zh-cn": "添加了运动传感器，添加了说明，前端如何工作，添加了用于编辑常量的对话框，如SET_VALUE，URL或HTML，更改了数组的存储方式，为类型字符串的值添加了提交按钮，为色调灯增加了饱和度，更好"
            },
            "0.0.24": {
                "en": "Fixed jittering whiles scrolling on iOS (was related to Pull2Refresh), System language of iobroker will be loaded and used.",
                "de": "Behobenes Jitter beim Scrollen unter iOS (war mit Pull2Refresh verbunden). Die Systemsprache von iobroker wird geladen und verwendet.",
                "ru": "Исправлено дрожание при прокрутке на iOS (было связано с Pull2Refresh), системный язык iobroker будет загружен и использован.",
                "pt": "Correção de jittering enquanto rolava no iOS (estava relacionado ao Pull2Refresh), a linguagem do sistema do iobroker será carregada e usada.",
                "nl": "Fixed jittering whiles screaming on iOS (was gerelateerd aan Pull2Refresh), de systeemtaal van iobroker zal worden geladen en gebruikt.",
                "fr": "Correction du tremblement lors du défilement sur iOS (liée à Pull2Refresh), la langue système de iobroker sera chargée et utilisée.",
                "it": "Risolto il problema del jittering che scorreva su iOS (era collegato a Pull2Refresh), il linguaggio di sistema di iobroker verrà caricato e utilizzato.",
                "es": "Se corrigieron los errores de jittering en iOS (relacionados con Pull2Refresh), el idioma del sistema de iobroker se cargará y se usará.",
                "pl": "Naprawiono drżenie podczas przewijania w systemie iOS (było związane z Pull2Refresh), język systemu iobroker zostanie załadowany i użyty.",
                "zh-cn": "修复了在iOS上滚动时的抖动（与Pull2Refresh有关），将加载和使用iobroker的系统语言。"
            },
            "0.0.23": {
                "en": "Rewrote how constant values (instead of linkedStates) are handeled - this is a requirement for further development, Fixed Pull2Refresh on android devices / chrome, Added external links Added popups with iframes.",
                "de": "Die Behandlung konstanter Werte (anstelle von linkedStates) wurde umgeschrieben. Dies ist eine Voraussetzung für die weitere Entwicklung. Pull2Refresh auf Android-Geräten / Chrome wurde behoben. Externe Links wurden hinzugefügt. Popups mit iframes wurden hinzugefügt.",
                "ru": "Переписано, как обрабатываются постоянные значения (вместо связанных элементов) - это требование для дальнейшей разработки, Исправлено Pull2Refresh на устройствах Android / Chrome, Добавлены внешние ссылки Добавлены всплывающие окна с iframes.",
                "pt": "Reescreva como valores constantes (em vez de linkedStates) são handeled - este é um requisito para o desenvolvimento posterior, Fixed Pull2Refresh em dispositivos android / chrome, links externos adicionados Pop-ups adicionados com iframes.",
                "nl": "Herschrijf hoe constante waarden (in plaats van linkedStates) worden verwerkt - dit is een vereiste voor verdere ontwikkeling, Vaste Pull2Refresh op Android-apparaten / chroom, Externe koppelingen toegevoegd Pop-ups met iframes toegevoegd.",
                "fr": "Réécrivez la manière dont les valeurs constantes (au lieu des états liés) sont gérées - c’est une exigence pour un développement ultérieur, Correction de Pull2Refresh sur les appareils Android / chrome, Ajout de liens externes Ajout de popups avec iframes.",
                "it": "Riscrivi come vengono gestiti i valori costanti (invece di linkedStates) - questo è un requisito per ulteriori sviluppi, Fixed Pull2Refresh su dispositivi Android / chrome, Aggiunto link esterni Aggiunto popup con iframe.",
                "es": "Reescribió cómo se distribuyen los valores constantes (en lugar de los estados vinculados): esto es un requisito para un mayor desarrollo, Fix2Refresh corregido en dispositivos Android / chrome, Se agregaron enlaces externos agregados con iframes.",
                "pl": "Przepisz jak stałe wartości (zamiast sprzężonych stanów) są traktowane - jest to wymóg dalszego rozwoju, Naprawiono Pull2Refresh na urządzeniach z Androidem / chrome, Dodano zewnętrzne linki Dodano wyskakujące okienka z iframe.",
                "zh-cn": "重写了如何对常量值（而不是linkedStates）进行处理 - 这是进一步开发的要求，在Android设备/ chrome上固定Pull2Refresh，添加了外部链接添加了iframe的弹出窗口。"
            },
            "0.0.22": {
                "en": "Improved german translation, Short after another coming reconnect-events (<5s) are ignored now.",
                "de": "Verbesserte deutsche Übersetzung. Kurz nach einem erneuten Wiederverbinden werden Ereignisse (<5s) jetzt ignoriert.",
                "ru": "Улучшен перевод на немецкий язык, Коротко за очередными событиями повторного соединения (<5 с) теперь игнорируются.",
                "pt": "Aprimorada tradução alemã, Short após outro próximo evento de reconexão (<5s) é ignorado agora.",
                "nl": "Verbeterde Duitse vertaling, kort nadat een andere komende reconnect-gebeurtenissen (<5s) nu worden genegeerd.",
                "fr": "Amélioration de la traduction en allemand. Un court après un autre événement de reconnexion (<5) est maintenant ignoré.",
                "it": "Miglioramento della traduzione in tedesco, breve dopo l'altro gli eventi di riconnessione in corso (<5s) vengono ignorati ora.",
                "es": "Traducción al alemán mejorada, Corto tras otro evento de reconexión que viene (<5s) se ignoran ahora.",
                "pl": "Poprawione tłumaczenie na język niemiecki. Krótko po kolejnym nadchodzące zdarzenia ponownego połączenia (<5s) są teraz ignorowane.",
                "zh-cn": "改进的德语翻译，现在忽略了另一个重新连接事件（<5s）之后的短暂翻译。"
            },
            "0.0.21": {
                "en": "Added Push2Reload on mobile devices - reloads whole page when pushing down on homepage, otherwise only the acual view is reloaded: Improved reloading on reconnect (hoepefully to get it finally good working on iOS 12-2).",
                "de": "Push2Reload auf Mobilgeräten hinzugefügt - Lädt die gesamte Seite neu, wenn Sie auf die Startseite klicken. Andernfalls wird nur die aktuelle Ansicht neu geladen: Verbessertes Neuladen bei erneuter Verbindung (hoffentlich funktioniert es jetzt auch unter iOS 12-2).",
                "ru": "Добавлена ​​Push2Reload на мобильных устройствах - перезагружается вся страница при нажатии на домашнюю страницу, в противном случае перезагружается только актуальный вид: Улучшена перезагрузка при переподключении (с надеждой, чтобы наконец-то все хорошо работало на iOS 12-2).",
                "pt": "Adicionado Push2Reload em dispositivos móveis - recarrega toda a página ao empurrar para baixo na página inicial, caso contrário, apenas a visão real é recarregada: Melhoria de recarga na reconexão (hoepefully para obtê-lo finalmente bom trabalho no iOS 12-2).",
                "nl": "Push2Reload toegevoegd op mobiele apparaten - laadt de hele pagina opnieuw bij het indrukken van de startpagina, anders wordt alleen de virtuele weergave opnieuw geladen: verbeterde herladen bij opnieuw verbinden (hopelijk om het eindelijk goed te laten werken op iOS 12-2).",
                "fr": "Ajout de Push2Reload sur les appareils mobiles: recharge la page entière lorsque vous appuyez sur la page d’accueil, sinon seule la vue réelle est rechargée: Rechargement amélioré lors de la reconnexion (pour que cela fonctionne enfin correctement sur iOS 12-2).",
                "it": "Aggiunto Push2Reload sui dispositivi mobili - ricarica tutta la pagina quando si spinge verso il basso nella home page, altrimenti viene ricaricata solo la vista in tempo reale: Migliorato il ricaricamento sulla riconnessione (finalmente per farlo funzionare bene su iOS 12-2).",
                "es": "Push2Reload agregado en dispositivos móviles: vuelve a cargar toda la página cuando se empuja hacia abajo en la página de inicio; de lo contrario, solo se recarga la vista real: se mejoró la recarga al volver a conectarse (sin darme cuenta para que finalmente funcione bien en iOS 12-2).",
                "pl": "Dodano Push2Reload na urządzeniach mobilnych - przeładowuje całą stronę po naciśnięciu na stronę główną, w przeciwnym razie przeładowywany jest tylko widok główny: Poprawione przeładowanie na ponowne połączenie (hoepefully, aby w końcu dobrze działało na iOS 12-2).",
                "zh-cn": "在移动设备上添加Push2Reload  - 在主页上按下时重新加载整个页面，否则只重新加载视图：改进重新连接时的重新加载（最终使其在iOS 12-2上工作得很好）。"
            },
            "0.0.20": {
                "en": "New trial to get it working in iOs 12-2.",
                "de": "Neue Testversion, um es in iOS 12-2 zum Laufen zu bringen.",
                "ru": "Новое испытание, чтобы заставить его работать в iOs 12-2.",
                "pt": "Novo teste para fazê-lo funcionar em iOs 12-2.",
                "nl": "Nieuwe proef om het te laten werken in iOs 12-2.",
                "fr": "Nouvel essai pour le faire fonctionner dans iOs 12-2.",
                "it": "Nuovo processo per farlo funzionare in iOs 12-2.",
                "es": "Nueva prueba para que funcione en iOs 12-2.",
                "pl": "Nowa wersja próbna umożliwiająca pracę w iOs 12-2.",
                "zh-cn": "新的试验让它在iOs中工作12-2。"
            },
            "0.0.19": {
                "en": "Improved reloading of page in new PWD-Mode of iOs 12-2.",
                "de": "Verbessertes Neuladen von Seiten im neuen PWD-Modus von iOs 12-2.",
                "ru": "Улучшена перезагрузка страницы в новом PWD-режиме iOs 12-2.",
                "pt": "Melhoria do recarregamento da página no novo modo PWD de iOs 12-2.",
                "nl": "Verbeterd herladen van pagina in nieuwe PWD-modus van iOs 12-2.",
                "fr": "Rechargement amélioré de la page dans le nouveau PWD-Mode of iOs 12-2.",
                "it": "Miglioramento del ricaricamento della pagina nella nuova modalità PWD di iOs 12-2.",
                "es": "Se ha mejorado la recarga de la página en el nuevo modo PWD de iOs 12-2.",
                "pl": "Poprawione przeładowanie strony w nowym trybie PWD iOs 12-2.",
                "zh-cn": "改进了iOs 12-2的新PWD模式中页面的重新加载。"
            },
            "0.0.18": {
                "en": "Improved fetching of VALVE_STATES, Changed Button Icon, Added Loading-Spinner if disconnected, Due to new iOs 12-2 PWD-Mode added visibility-check and connectivity-check, Added role-icons to role-selectbox in edit device dialog, Fixed missing value-list for states of the type string.",
                "de": "Verbessertes Abrufen von VALVE_STATES, Geändertes Schaltflächensymbol, Hinzufügen von Loading-Spinner, falls nicht verbunden, Aufgrund neuer iOS 12-2 PWD-Modus Sichtbarkeitsprüfung und Konnektivitätsprüfung hinzugefügt, Hinzufügen von Rollensymbolen zur Rollenselektionsbox im Gerätedialog, Fehler behoben ",
                "ru": "Улучшено извлечение VALVE_STATES, изменен значок кнопки, добавлен Spinner загрузки, если он отключен, из-за новых iOs 12-2 PWD-Mode добавлены проверка видимости и проверка соединения, добавлены значки ролей в поле выбора ролей в диалоге редактирования устройства, исправлено отсутствие ",
                "pt": "Recuperação aprimorada de VALVE_STATES, Ícone do botão alterado, Adicionado o Loading-Spinner se desconectado, Devido a novos iOs 12-2 O modo PWD adicionou verificação de visibilidade e verificação de conectividade, Ícones de função adicionados à caixa de seleção de função na caixa de diálogo Editar dispositivo, Fixo ausente ",
                "nl": "Verbeterd ophalen van VALVE_STATES, pictogram met gewijzigde knop, toegevoegde Loading-Spinner indien losgekoppeld, als gevolg van nieuwe iO's 12-2 PWD-modus toegevoegde zichtbaarheid-controle en connectiviteit-controle, rolpictogrammen toegevoegd aan rol-selectbox in bewerkingsapparaatdialoog, vastgelopen ",
                "fr": "Amélioration de la récupération de VALVE_STATES, icône du bouton modifié, ajout de Loading-Spinner en cas de déconnexion, en raison de nouveaux iOs 12-2 Contrôle de visibilité et contrôle de connectivité ajouté, mode ajouté ",
                "it": "Recupero migliorato di VALVE_STATES, icona del pulsante modificato, aggiunto caricamento-Spinner se disconnessi, A causa di nuovi iOs 12-2 Modalità PWD aggiunto controllo di visibilità e connettività-controllo, Aggiunte icone di ruolo a selectbox ruolo nella finestra di dialogo di modifica del dispositivo, Risolto mancante ",
                "es": "Recuperación mejorada de VALVE_STATES, icono de botón modificado, agregado Spinner de carga si está desconectado, debido a los nuevos iOs 12-2 Modo de PWD agregado control de visibilidad y conectividad, agregado iconos de rol al cuadro de selección de rol en el cuadro de diálogo del dispositivo de edición, Se corrigió ",
                "pl": "Ulepszono pobieranie VALVE_STATES, zmieniono ikonę przycisku, dodano ładowanie-spinner, jeśli jest odłączony, z powodu nowych iOs 12-2 Tryb PWD dodał kontrolę widoczności i kontrolę łączności, Dodano ikony ról do pola wyboru roli w oknie dialogowym edycji urządzenia, Naprawiono brak ",
                "zh-cn": "改进了VALVE_STATES的获取，更改了按钮图标，添加了加载 - 微调器，如果断开连接，由于新的iOs 12-2 PWD模式添加了可见性检查和连接检查，在编辑设备对话框中添加了角色选择框的角色图标，修复了丢失"
            },
            "0.0.17": {
                "en": "Changed description of slider (level/dimmer/value/height).",
                "de": "Geänderte Beschreibung des Sliders (Level / Dimmer / Wert / Höhe).",
                "ru": "Изменено описание слайдера (уровень / диммер / значение / высота).",
                "pt": "Descrição alterada do controle deslizante (nível / dimmer / valor / altura).",
                "nl": "Gewijzigde beschrijving van schuifregelaar (niveau / dimmer / waarde / hoogte).",
                "fr": "Modification de la description du curseur (niveau / gradateur / valeur / hauteur).",
                "it": "Descrizione modificata del cursore (livello / dimmer / valore / altezza).",
                "es": "Se modificó la descripción del control deslizante (nivel / dimmer / valor / altura).",
                "pl": "Zmieniono opis suwaka (poziom / dimmer / wartość / wysokość).",
                "zh-cn": "更改了滑块的说明（水平/调光器/值/高度）。"
            },
            "0.0.16": {
                "en": "Role of device is displayed in devices-table, VALVE_STATES is now editable via GUI (show opening of valves associated with a thermostat in percentage), Added Role 'Button': You can define a constant SET_VALUE wich will be written to the ID that is linked with STATE if the button is pressed, Rewritten parts of front-end to guarentee better compatibility, Boost-Mode for Homematic-Thermostat should work now, Added state BOOST_STATE for Homematic-Thermostat - ability to display remaining boost-time if in boost-mode, Added dessription of roles and corresponding states, Temperature und Humidity-Sensors can now display a STATE at bottom of device, and both, TEMPERATURE and HUMIDITY, in small in the upper right corner, Better handling of Auto-Create of Temperature- und Humidity-Sensors, German translation: 'geöffnet' lower case, Zigbee humidity and temperature added to auto-creation, Fixed not scrollable selectbox at devices tab.",
                "de": "Die Rolle des Geräts wird in der Gerätetabelle angezeigt. VALVE_STATES kann jetzt über die grafische Benutzeroberfläche bearbeitet werden (Anzeige des Öffnens von Ventilen, die einem Thermostat zugeordnet sind, in Prozent). Hinzugefügte Rolle 'Button': Sie können eine Konstante SET_VALUE definieren, die in die ID geschrieben wird, die ist ",
                "ru": "Роль устройства отображается в таблице устройств, VALVE_STATES теперь редактируется через GUI (отображать открытие клапанов, связанных с термостатом в процентах), Добавлена ​​роль «Кнопка»: вы можете определить постоянную SET_VALUE, которая будет записана в идентификатор, который ",
                "pt": "A função do dispositivo é exibida na tabela de dispositivos, VALVE_STATES é agora editável via GUI (mostrar abertura de válvulas associada a um termostato em porcentagem), Adicionado função 'Botão': Você pode definir uma constante SET_VALUE que será gravada no ID que é ",
                "nl": "De rol van het apparaat wordt weergegeven in de apparaten-tabel, VALVE_STATES kan nu worden bewerkt via GUI (toon opening van kleppen geassocieerd met een thermostaat in percentage), Toegevoegd Rol 'Knop': U kunt een constante SET_VALUE definiëren die zal worden geschreven naar de ID die is ",
                "fr": "Le rôle de l'appareil est affiché dans la table des appareils, VALVE_STATES est maintenant éditable via une interface graphique (affiche l'ouverture des vannes associées à un thermostat en pourcentage), Bouton 'Rôle' ajouté: vous pouvez définir une constante SET_VALUE qui sera écrite dans l'ID ",
                "it": "Il ruolo del dispositivo viene visualizzato nella tabella dei dispositivi, VALVE_STATES ora è modificabile tramite GUI (mostra l'apertura delle valvole associate a un termostato in percentuale), Ruolo aggiunto 'Pulsante': puoi definire una costante SET_VALUE che verrà scritta nell'ID che è ",
                "es": "El rol del dispositivo se muestra en la tabla de dispositivos, VALVE_STATES ahora se puede editar a través de la GUI (muestre la apertura de las válvulas asociadas con un termostato en porcentaje), 'Botón' de rol agregado: puede definir una constante SET_VALUE que se escribirá en la ID que es ",
                "pl": "Rola urządzenia jest wyświetlana w tabeli urządzeń, VALVE_STATES można teraz edytować za pomocą GUI (pokaż otwarcie zaworów związanych z termostatem w procentach), Dodano przycisk „Rola”: Możesz zdefiniować stałą SET_VALUE, która zostanie zapisana na identyfikatorze, który jest ",
                "zh-cn": "设备的角色显示在设备表中，VALVE_STATES现在可通过GUI编辑（显示与恒温器相关的阀门打开百分比），添加角色'按钮'：您可以定义一个常量SET_VALUE，它将写入ID，即"
            },
            "0.0.15": {
                "en": "Improved check for value type of states, Improved slider-tooltip to lower font-size at large numbers.",
                "de": "Verbesserte Überprüfung des Werttyps von Zuständen. Verbesserter Slider-Tooltip zum Verringern der Schriftgröße bei großen Zahlen.",
                "ru": "Улучшена проверка типа значений состояний, Улучшена подсказка ползунка для уменьшения размера шрифта при больших числах.",
                "pt": "Verificação aprimorada do tipo de valor dos estados, Melhoria na dica da barra deslizante para diminuir o tamanho da fonte em grandes números.",
                "nl": "Verbeterde controle op waardetype toestanden, verbeterde schuifregelaar-tooltip om de lettergrootte bij grote aantallen te verlagen.",
                "fr": "Amélioration de la vérification du type d’états de valeur, info-bulle du curseur améliorée pour réduire la taille de la police pour les grands nombres.",
                "it": "Controllo migliorato per il tipo di valore degli stati, migliorato tooltip per ridurre la dimensione del font a grandi numeri.",
                "es": "Comprobación mejorada para el tipo de valor de los estados, Mejorada la información sobre herramientas de control deslizante para reducir el tamaño de fuente en números grandes",
                "pl": "Ulepszone sprawdzanie typu wartości stanów, Ulepszona etykieta suwaka, aby zmniejszyć rozmiar czcionki w dużych ilościach.",
                "zh-cn": "改进了对值类型状态的检查，改进了滑块 - 工具提示以降低大数字的字体大小。"
            },
            "0.0.14": {
                "en": "If role of state is not further specified, then check for role of parent object.",
                "de": "Wenn die Rolle des Status nicht weiter spezifiziert ist, prüfen Sie, ob das übergeordnete Objekt die Rolle hat.",
                "ru": "Если роль состояния не указана, проверьте роль родительского объекта.",
                "pt": "Se a função do estado não for especificada posteriormente, verifique a função do objeto pai.",
                "nl": "Als de rol van de staat niet nader wordt gespecificeerd, controleert u de rol van het bovenliggende object.",
                "fr": "Si le rôle de l'état n'est pas précisé, recherchez le rôle de l'objet parent.",
                "it": "Se il ruolo dello stato non viene ulteriormente specificato, controllare il ruolo dell'oggetto principale.",
                "es": "Si no se especifica más la función de estado, verifique la función del objeto principal.",
                "pl": "Jeśli rola stanu nie jest dalej określona, ​​sprawdź rolę obiektu nadrzędnego.",
                "zh-cn": "如果未进一步指定state的角色，则检查父对象的角色。"
            },
            "0.0.13": {
                "en": "Doors and Windows now force true/false to be translated to opened/closed, Double Entrys on WelcomeScreen/Overview removed, States are now set with the correct value type, Changed recognition of state types.",
                "de": "Türen und Fenster erzwingen nun die Übersetzung von wahr / falsch in geöffnet / geschlossen, Doppeleinträge auf Begrüßungsbildschirm / Übersicht entfernt, Zustände werden jetzt mit dem richtigen Werttyp festgelegt, Erkennung von Zustandstypen geändert.",
                "ru": "Двери и Windows теперь принудительно переводят значение true / false в открытое / закрытое состояние, двойные записи на WelcomeScreen / Overview удалены, состояния теперь устанавливаются с правильным типом значения, измененное распознавание типов состояний.",
                "pt": "Portas e Windows agora forçam true / false para serem convertidos para aberto / fechado, Entradas duplas no WelcomeScreen / Overview removidas, Estados agora são definidos com o tipo de valor correto, Reconhecimento de tipos de estado alterado.",
                "nl": "Deuren en Windows dwingen nu waar / vals om te worden vertaald naar geopend / gesloten, dubbele vermeldingen op WelcomeScreen / Overzicht verwijderd, Staten zijn nu ingesteld met het juiste waardetype, Gewijzigde herkenning van statietypen.",
                "fr": "Les portes et les fenêtres forcent maintenant la conversion de vrai / faux en ouvert / fermé, les entrées doubles sur WelcomeScreen / Overview sont supprimées, les états sont maintenant définis avec le type de valeur correct, Reconnaissance modifiée des types d'état.",
                "it": "Porte e Windows ora impongono true / false per la conversione in aperto / chiuso, Double Entrys su WelcomeScreen / Panoramica rimossa, Gli stati sono ora impostati con il tipo di valore corretto, Riconoscimento modificato dei tipi di stato.",
                "es": "Las puertas y Windows ahora obligan a verdadero / falso a ser traducido a abierto / cerrado, se eliminan las entradas dobles en WelcomeScreen / Overview, los estados ahora se configuran con el tipo de valor correcto, se cambió el reconocimiento de los tipos de estado.",
                "pl": "Drzwi i Windows wymuszają teraz przetłumaczenie true / false na otwarte / zamknięte, Double Entrys na WelcomeScreen / Overview usunięte, Stany są teraz ustawione z poprawnym typem wartości, Zmieniono rozpoznawanie typów stanów.",
                "zh-cn": "门和Windows现在强制将true / false转换为打开/关闭，删除WelcomeScreen / Overview上的Double Entrys，现在使用正确的值类型设置状态，更改状态类型的识别。"
            },
            "0.0.12": {
                "en": "Check for unallowed chars in object names, Check for duplicates in view names, Level fires a slider in dialog - even when it has a state list (HUE again), Added Blinds (Homematic) - please test it, i don't have one to test.",
                "de": "Prüfe auf unzulässige Zeichen in Objektnamen, Prüfe auf Duplikate in Ansichtsnamen, Level löst einen Schieberegler im Dialogfeld aus - auch wenn es eine Statusliste (wieder HUE) hat, Blinds hinzugefügt (Homematic) - bitte teste es, ich habe keine ",
                "ru": "Проверьте наличие недопустимых символов в именах объектов, Проверьте наличие дубликатов в именах представлений, Уровень запускает ползунок в диалоге - даже когда у него есть список состояний (снова HUE), Добавлены жалюзи (Homematic) - пожалуйста, проверьте его, у меня его нет ",
                "pt": "Verifique por chars não permitidos em nomes de objetos, verifique se há duplicatas em nomes de exibição, Level dispara um controle deslizante na caixa de diálogo - mesmo quando tem uma lista de estado (HUE novamente), Blinds Adicionado (Homematic) - teste, não tenho ",
                "nl": "Controleer op niet-toegestane tekens in objectnamen, Controleer op duplicaten in weergavenamen, Niveau vuurt een schuifregelaar in dialoog - zelfs wanneer het een toestandslijst heeft (HUE opnieuw), Toegevoegde blinds (Homematic) - test het, ik heb er geen ",
                "fr": "Vérifiez les caractères non autorisés dans les noms d'objet, Vérifiez les doublons dans les noms de vue, Level déclenche un curseur dans la boîte de dialogue - même s'il contient une liste d'états (HUE encore), Added Blinds (Homematic) - testez-le, je n'en ai pas. ",
                "it": "Controlla i caratteri non consentiti nei nomi degli oggetti, Controlla i duplicati nei nomi delle visualizzazioni, Livello attiva un cursore nella finestra di dialogo - anche quando ha una lista di stati (HUE di nuovo), Aggiunti Blinds (Homematic) - per favore testalo, non ne ho uno ",
                "es": "Compruebe si hay caracteres no permitidos en los nombres de los objetos, Compruebe si hay duplicados en los nombres de las vistas, Level dispara un control deslizante en el cuadro de diálogo, incluso cuando tiene una lista de estados (HUE nuevamente), Blinds agregados (Homematic): pruébelo, no tengo uno ",
                "pl": "Sprawdź, czy nie ma niedozwolonych znaków w nazwach obiektów, Sprawdź, czy nie ma duplikatów w nazwach widoków, Level uruchamia suwak w oknie dialogowym - nawet jeśli ma listę stanów (ponownie HUE), Dodano Blinds (Homematic) - sprawdź, czy nie ",
                "zh-cn": "检查对象名称中的不允许的字符，检查视图名称中的重复项，Level会在对话框中触发滑块 - 即使它有状态列表（再次是HUE），添加了Blinds（Homematic） - 请测试它，我没有"
            },
            "0.0.11": {
                "en": "Added compatibility for edge and firefox, Again Hue bugfixes, Removed Tooltip from Toolbar.",
                "de": "Kompatibilität für Edge und Firefox hinzugefügt, Fehlerbehebungen in Again Hue, Tooltip aus der Toolbar entfernt.",
                "ru": "Добавлена ​​совместимость для edge и firefox, исправлены ошибки Hue, удалена подсказка с панели инструментов.",
                "pt": "Adicionado compatibilidade para borda e firefox, Correções de bugs Novamente em Matiz, Removido Tooltip da Barra de Ferramentas.",
                "nl": "Compatibiliteit toegevoegd voor edge en firefox, Again Hue-bugfixes, Removed Tooltip from Toolbar.",
                "fr": "Compatibilité ajoutée pour edge et firefox, corrections de bugs Again Hue, info-bulle supprimée de la barre d'outils.",
                "it": "Aggiunta compatibilità per edge e firefox, correzioni di bug di nuovo hue, tooltip rimosso dalla barra degli strumenti.",
                "es": "Se agregó compatibilidad para Edge y Firefox, una vez más las correcciones de errores, se eliminó la información sobre herramientas de la barra de herramientas.",
                "pl": "Dodano kompatybilność z krawędziami i firefoxem, poprawiono ponownie błędy Hue, usunięto podpowiedź z paska narzędzi.",
                "zh-cn": "添加了edge和firefox的兼容性，再次Hue错误修正，从工具栏删除了工具提示。"
            },
            "0.0.10": {
                "en": "Added ColorTemperature - Hoepfully HUE works now? Can't test ist, because i do not own any hue lamp :)",
                "de": "ColorTemperature hinzugefügt - Hoepfully HUE funktioniert jetzt? ",
                "ru": "Добавлена ​​ColorTe Temperature - HoUEful HUE теперь работает? ",
                "pt": "Adicionado ColorTemperature - Hoepfully HUE funciona agora? ",
                "nl": "Kleurtemperatuur toegevoegd - Hoepfully HUE werkt nu? ",
                "fr": "Ajouté ColorTemperature - Hoepfully HUE fonctionne maintenant? ",
                "it": "Aggiunto ColorTemperature - Hoepfully HUE funziona ora? ",
                "es": "Se agregó ColorTemperature - Hoepfully HUE funciona ahora? ",
                "pl": "Dodano ColorTemperature - Hoepfully HUE działa teraz? ",
                "zh-cn": "添加ColorTemperature  -  Hoepfully HUE现在可以使用吗？"
            },
            "0.0.9": {
                "en": "HUE added, LinkedView now also works on windows, doors and fire-sensor, Added translation (thanks ldittmar!)",
                "de": "HUE hinzugefügt, LinkedView funktioniert jetzt auch für Fenster, Türen und Feuersensor. Übersetzung hinzugefügt (danke ldittmar!)",
                "ru": "Добавлен HUE, LinkedView теперь также работает на окнах, дверях и пожарном датчике, Добавлен перевод (спасибо ldittmar!)",
                "pt": "HUE acrescentou, LinkedView agora também funciona em janelas, portas e sensores de incêndio, Tradução adicionada (obrigado ldittmar!)",
                "nl": "HUE toegevoegd, LinkedView werkt nu ook op ramen, deuren en brandsensoren, vertaling toegevoegd (bedankt ldittmar!)",
                "fr": "HUE ajouté, LinkedView fonctionne désormais aussi sur les fenêtres, les portes et les capteurs d’incendie, Traduction ajoutée (merci ldittmar!)",
                "it": "Aggiunta HUE, LinkedView ora funziona anche su finestre, porte e sensori antincendio, Aggiunta traduzione (grazie a ldittmar!)",
                "es": "Se agregó HUE, LinkedView ahora también funciona en ventanas, puertas y sensores de incendios, Traducción agregada (¡gracias ldittmar!)",
                "pl": "Dodano HUE, LinkedView teraz działa również na okna, drzwi i czujnik ognia, Dodano tłumaczenie (dzięki ldittmar!)",
                "zh-cn": "HUE补充说，LinkedView现在也适用于窗户，门和火灾传感器，添加翻译（感谢ldittmar！）"
            },
            "0.0.8": {
                "en": "Added icons to image selectboxes.",
                "de": "Icons zu Bildauswahlfeldern hinzugefügt.",
                "ru": "Добавлены значки в окна выбора изображений.",
                "pt": "Adicionado ícones para selecionar caixas de imagem.",
                "nl": "Pictogrammen toegevoegd aan beeldselectieboxen.",
                "fr": "Ajout d'icônes dans les sélections d'images.",
                "it": "Aggiunte icone per selezionare le caselle di immagine.",
                "es": "Se agregaron iconos a los cuadros de selección de imágenes.",
                "pl": "Dodano ikony do skrzynek wyboru obrazów.",
                "zh-cn": "为图像选择框添加了图标。"
            },
            "0.0.7": {
                "en": "Changed order of tabs, Shelly added to autocreate.",
                "de": "Die Reihenfolge der Registerkarten wurde geändert, und Shelly fügte hinzu, dass sie automatisch erstellt.",
                "ru": "Изменен порядок вкладок, добавлена ​​Шелли в автореагентство.",
                "pt": "Ordem mudada das abas, Shelly adicionado ao autocreate.",
                "nl": "De volgorde van de tabbladen is gewijzigd, Shelly is toegevoegd aan autocreate.",
                "fr": "Ordre modifié des onglets, ajouta Shelly pour créer automatiquement.",
                "it": "Ordine modificato delle schede, Shelly aggiunto per l'autocreazione.",
                "es": "Se modificó el orden de las pestañas, Shelly agregó a autocrear.",
                "pl": "Zmieniono kolejność kart, dodano Shelly do autokreacji.",
                "zh-cn": "改变了选项卡的顺序，Shelly添加到autocreate。"
            },
            "0.0.6": {
                "en": "Improved speed of select id and autocreate, set filter to channel on autocreate.",
                "de": "Verbesserte Geschwindigkeit beim Auswählen der ID und beim automatischen Erstellen. Setzen Sie den Filter auf Kanal beim automatischen Erstellen.",
                "ru": "Улучшена скорость выбора идентификатора и автоматического создания, установите фильтр на канал при автоматическом создании.",
                "pt": "Melhor velocidade de seleção de ID e autocreate, defina o filtro para canal em autocreate.",
                "nl": "Verbeterde snelheid van select id en autocreate, zet filter op kanaal bij automatisch maken.",
                "fr": "Amélioration de la vitesse de sélection de l'identifiant et de la création automatique, définissez le filtre sur channel pour la création automatique",
                "it": "Migliorata la velocità di selezionare id e autocreare, impostare il filtro sul canale su autocreate.",
                "es": "Mejora la velocidad de selección de identificación y creación automática, configure el filtro a canal en la creación automática.",
                "pl": "Zwiększona prędkość wyboru identyfikatora i autokreacji, ustaw filtr na kanał w autokreacji.",
                "zh-cn": "改进了select id和autocreate的速度，在自动创建时将过滤器设置为通道。"
            },
            "0.0.5": {
                "en": "Bugfix: creation of many devices schould work now.",
                "de": "Bugfix: Erstellung vieler Geräte sollte jetzt funktionieren.",
                "ru": "Исправлено: создание многих устройств должно работать сейчас.",
                "pt": "Bugfix: a criação de muitos dispositivos deve funcionar agora.",
                "nl": "Bugfix: het maken van veel apparaten zou nu kunnen werken.",
                "fr": "Correction: la création de nombreux périphériques devrait fonctionner maintenant.",
                "it": "Bugfix: la creazione di molti dispositivi funziona ora.",
                "es": "Corrección de errores: la creación de muchos dispositivos debería funcionar ahora.",
                "pl": "Bugfix: tworzenie wielu urządzeń powinno teraz działać.",
                "zh-cn": "修正：创建许多设备现在可以工作。"
            },
            "0.0.4": {
                "en": "Bugfix: copy device created just a reference to old object, added Toolbar icons.",
                "de": "Bugfix: Kopiergerät erstellt nur einen Verweis auf altes Objekt, Toolbar Icons hinzugefügt.",
                "ru": "Исправлено: при копировании устройства создавалась просто ссылка на старый объект, добавлены значки панели инструментов.",
                "pt": "Bugfix: dispositivo de cópia criado apenas uma referência ao objeto antigo, adicionado ícones da barra de ferramentas.",
                "nl": "Bugfix: kopie apparaat gemaakt alleen een verwijzing naar oud object, werkbalkpictogrammen toegevoegd.",
                "fr": "Correction: le périphérique de copie créait uniquement une référence à un ancien objet, ajoutant des icônes de la barre d’outils.",
                "it": "Bugfix: copia dispositivo creato solo un riferimento al vecchio oggetto, aggiunte le icone della barra degli strumenti.",
                "es": "Solución de error: el dispositivo de copia creó solo una referencia a un objeto antiguo, agregó íconos de la barra de herramientas.",
                "pl": "Bugfix: urządzenie kopiujące stworzyło tylko odniesienie do starego obiektu, dodano ikony paska narzędzi.",
                "zh-cn": "修正：复制设备只创建了对旧对象的引用，添加了工具栏图标。"
            },
            "0.0.3": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "iQontrol",
        "titleLang": {
            "en": "iQontrol",
            "de": "iQontrol",
            "ru": "iQontrol",
            "pt": "iQontrol",
            "nl": "iQontrol",
            "fr": "iQontrol",
            "it": "iQontrol",
            "es": "iQontrol",
            "pl": "iQontrol",
            "zh-cn": "iQontrol"
        },
        "desc": {
            "en": "Fast Web-App for Visualization",
            "de": "Schnelle Web-App zur Visualisierung",
            "ru": "Быстрое веб-приложение для визуализации",
            "pt": "Fast Web-App para visualização",
            "nl": "Snelle web-app voor visualisatie",
            "fr": "Web-App rapide pour la visualisation",
            "it": "App Web veloce per visualizzazione",
            "es": "Rápida aplicación web para visualización",
            "pl": "Szybka aplikacja internetowa do wizualizacji",
            "zh-cn": "用于可视化的快速Web应用程序"
        },
        "authors": [
            "Sebastian Bormann <sebastian@bormann.net>"
        ],
        "keywords": [
            "visualization",
            "user",
            "interface",
            "webapp",
            "ui"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "iqontrol.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/sbormann/ioBroker.iqontrol/master/admin/iqontrol.png",
        "readme": "https://github.com/sbormann/ioBroker.iqontrol/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "visualization",
        "highlight": true,
        "compact": true,
        "singleton": false,
        "materialize": true,
        "materializeTab": true,
        "localLink": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
        "welcomeScreen": false,
        "welcomeScreenPro": {
            "link": "iqontrol/index.html",
            "name": "iQontrol",
            "img": "iqontrol.admin/iqontrol.png",
            "color": "gray",
            "order": 1,
            "localLink": false
        },
        "noIntro": false,
        "adminTab": {
            "singleton": true,
            "name": {
                "en": "iQontrol",
                "de": "iQontrol",
                "ru": "iQontrol",
                "pt": "iQontrol",
                "nl": "iQontrol",
                "fr": "iQontrol",
                "it": "iQontrol",
                "es": "iQontrol",
                "pl": "iQontrol",
                "zh-cn": "iQontrol"
            },
            "link": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
            "fa-icon": "blur_on"
        },
        "supportCustoms": true,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=1.4.2"
            },
            {
                "web": ">=1.7.1"
            }
        ]
    },
    "native": {
        "demotoolbar": [
            {
                "commonName": "Home",
                "nativeLinkedView": "Home",
                "nativeIcon": "home"
            },
            {
                "commonName": "Rooms",
                "nativeLinkedView": "Rooms",
                "nativeIcon": "grid"
            },
            {
                "commonName": "Functions",
                "nativeLinkedView": "Functions",
                "nativeIcon": "gear"
            }
        ],
        "demoviews": [
            {
                "commonName": "Home",
                "nativeBackgroundImage": ".\\userimages\\demo\\bakestone.jpg",
                "devices": [
                    {
                        "commonName": "ioBroker uptime",
                        "nativeHeading": "ioBroker",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                        "commonRole": "iQontrolValue",
                        "states": [
                            {
                                "state": "STATE",
                                "value": "system.adapter.admin.0.uptime"
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Rooms",
                "nativeBackgroundImage": ".\\userimages\\demo\\grass.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "1st floor",
                        "nativeLinkedView": "Living-Room",
                        "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "2nd floor",
                        "nativeLinkedView": "Kitchen",
                        "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Functions",
                "nativeBackgroundImage": ".\\userimages\\demo\\decor.jpg",
                "devices": [
                    {
                        "commonName": "Lights",
                        "nativeHeading": "",
                        "nativeLinkedView": "Lights",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Climate-Control",
                        "nativeHeading": "",
                        "nativeLinkedView": "Climate-Control",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Living-Room",
                "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                "devices": [
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Heater",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "TV",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolSwitch",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Kitchen",
                "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                "devices": [
                    {
                        "commonName": "Fan",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolFan",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Lights",
                "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Climate-Control",
                "nativeBackgroundImage": ".\\userimages\\demo\\green.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "objects": [
        {
            "_id": "iqontrol.meta",
            "type": "meta",
            "common": {
                "name": "userfiles and images for iQontrol",
                "type": "meta.user",
                "expert": true
            },
            "native": {}
        }
    ],
    "instanceObjects": []
}