{
    "common": {
        "name": "iqontrol",
        "version": "1.1.10",
        "news": {
            "1.1.10": {
                "en": "Added universal remote control including a track-pad to media-device, Device-Options are now sorted in categories, Collapsibles like additional informations are animated now, Added option for the device button to change the caption of the button in the dialog, Added option to open URL in new window instead of box inside dialog, Made toggeling of a state more fault tolerant if the type is not set correctly (iQontrol presumes now, it is a switch)."
            },
            "1.1.9": {
                "en": "Enhanced popup with the ability to add buttons and confirmation messages, Fixed crash on some toolbar specifications.",
                "de": "Verbessertes Popup mit der Möglichkeit, Schaltflächen und Bestätigungsmeldungen hinzuzufügen. Absturz bei einigen Symbolleistenspezifikationen behoben.",
                "ru": "Улучшено всплывающее окно с возможностью добавления кнопок и подтверждающих сообщений. Исправлен сбой на некоторых характеристиках панели инструментов.",
                "pt": "Popup aprimorado com a capacidade de adicionar botões e mensagens de confirmação, falha corrigida em algumas especificações da barra de ferramentas.",
                "nl": "Verbeterde pop-up met de mogelijkheid om knoppen en bevestigingsberichten toe te voegen, Crash op sommige werkbalkspecificaties opgelost.",
                "fr": "Fenêtre contextuelle améliorée avec la possibilité d'ajouter des boutons et des messages de confirmation, Correction d'un crash sur certaines spécifications de la barre d'outils.",
                "it": "Popup migliorato con la possibilità di aggiungere pulsanti e messaggi di conferma, Risolto crash su alcune specifiche della barra degli strumenti.",
                "es": "Ventana emergente mejorada con la capacidad de agregar botones y mensajes de confirmación, Se corrigió el bloqueo en algunas especificaciones de la barra de herramientas.",
                "pl": "Ulepszone wyskakujące okienko z możliwością dodawania przycisków i komunikatów potwierdzających, Naprawiono awarię niektórych specyfikacji paska narzędzi.",
                "zh-cn": "增强的弹出窗口具有添加按钮和确认消息的功能，修复了某些工具栏规格上的崩溃。"
            },
            "1.1.8": {
                "en": "Enhanced rendering of colour-lights with alternative colorspace, Added rounded corners to iframe, Added sans-serif as standard font-family to iframe (may overwrite your settings - you can overwrite this by marking your own font-family css with '!important'), Added sentry plugin.",
                "de": "Verbessertes Rendern von Farblichtern mit alternativem Farbraum, Abgerundete Ecken zum Iframe hinzugefügt, Serifenlose Standard-Schriftfamilie zum Iframe hinzugefügt (möglicherweise überschreiben Sie Ihre Einstellungen - Sie können dies überschreiben, indem Sie Ihre eigene CSS-Schriftfamilie mit '! Wichtig' markieren ",
                "ru": "Улучшенный рендеринг цветных источников света с альтернативным цветовым пространством, добавлены закругленные углы в iframe, добавлен sans-serif в качестве стандартного семейства шрифтов в iframe (может перезаписать ваши настройки - вы можете перезаписать это, пометив свой собственный набор шрифтов css знаком! ",
                "pt": "Renderização aprimorada de luzes coloridas com espaço de cores alternativo, cantos arredondados adicionados ao iframe, sans-serif adicionados como família de fontes padrão ao iframe (pode sobrescrever suas configurações - você pode sobrescrever isso marcando sua própria css da família de fontes com '! Important' ",
                "nl": "Verbeterde weergave van kleurenlichten met alternatieve kleurruimte, afgeronde hoeken toegevoegd aan iframe, schreefloos als standaard lettertypefamilie toegevoegd aan iframe (kan uw instellingen overschrijven - u kunt dit overschrijven door uw eigen lettertypefamilie css te markeren met '! Belangrijk') ",
                "fr": "Rendu amélioré des lumières de couleur avec un espace colorimétrique alternatif, Ajout de coins arrondis à l'iframe, Ajout de sans-serif en tant que famille de polices standard à l'iframe (peut écraser vos paramètres - vous pouvez écraser cela en marquant votre propre css de famille de polices avec ``! Important '' ",
                "it": "Rendering migliorato di luci di colore con spazio colore alternativo, Aggiunti angoli arrotondati a iframe, Aggiunto sans-serif come famiglia di caratteri standard a iframe (può sovrascrivere le tue impostazioni - puoi sovrascriverlo contrassegnando il tuo css di famiglia di caratteri con '! Important') ",
                "es": "Representación mejorada de luces de color con espacio de color alternativo, Esquinas redondeadas agregadas al iframe, Sans-serif agregado como familia de fuentes estándar al iframe (puede sobrescribir sus configuraciones; puede sobrescribir esto marcando su propio CSS de familia de fuentes con '! Important' ",
                "pl": "Ulepszone renderowanie kolorowych świateł z alternatywną przestrzenią kolorów, Dodano zaokrąglone rogi do elementu iframe, Dodano bezszeryfową jako standardową rodzinę czcionek do elementu iframe (można nadpisać swoje ustawienia - można to zastąpić, oznaczając własny plik CSS rodziny czcionek znakiem „! Important” ",
                "zh-cn": "使用其他色彩空间增强了对彩色灯光的渲染，向iframe添加了圆角，向iframe添加了sans-serif作为标准字体系列（可能会覆盖您的设置-您可以通过用'！important'标记自己的字体系列css来覆盖此设置"
            },
            "1.1.7": {
                "en": "Improved long press and forced touch handling, Added URL-Parameters returnAfterTimeDestiationView and returnAfterTimeTreshold.",
                "de": "Verbesserte Handhabung für langes Drücken und erzwungenes Berühren, URL-Parameter returnAfterTimeDestiationView und returnAfterTimeTreshold hinzugefügt.",
                "ru": "Улучшена обработка при длительном нажатии и принудительном касании, добавлены URL-параметры returnAfterTimeDestiationView и returnAfterTimeTreshold.",
                "pt": "Pressão longa aprimorada e manipulação forçada de toque, parâmetros de URL adicionados returnAfterTimeDestiationView e returnAfterTimeTreshold.",
                "nl": "Verbeterde lange druk en geforceerde aanraakbehandeling, URL-parameters toegevoegd returnAfterTimeDestiationView en returnAfterTimeTreshold.",
                "fr": "Amélioration de la pression longue et du toucher forcé, ajout de paramètres d'URL returnAfterTimeDestiationView et returnAfterTimeTreshold.",
                "it": "Migliore pressione prolungata e gestione forzata del tocco, parametri URL aggiunti returnAfterTimeDestiationView e returnAfterTimeTreshold.",
                "es": "Mejora de la pulsación prolongada y manejo táctil forzado, parámetros de URL agregados returnAfterTimeDestiationView y returnAfterTimeTreshold.",
                "pl": "Ulepszona obsługa długiego naciśnięcia i wymuszonego dotyku, dodano parametry adresu URL returnAfterTimeDestiationView i returnAfterTimeTreshold.",
                "zh-cn": "改进了长按和强制触摸处理，添加了URL参数returnAfterTimeDestiationView和returnAfterTimeTreshold。"
            },
            "1.1.6": {
                "en": "Added some roles to recognize water and fire sensors more reliable, Added a block to blockly to send popup messages to iQontrol, Set option 'Always use time instead of pressure' as standard - if you want to use ForcedTouch, disable this option.",
                "de": "Einige Rollen hinzugefügt, um Wasser- und Feuersensoren zuverlässiger zu erkennen. Block blockiert, um Popup-Nachrichten an iQontrol zu senden. Option \"Immer Zeit anstelle von Druck verwenden\" als Standard festlegen. Wenn Sie ForcedTouch verwenden möchten, deaktivieren Sie diese Option.",
                "ru": "Добавлены некоторые роли для более надежного распознавания датчиков воды и пожара, Добавлен блок для блокирования отправки всплывающих сообщений в iQontrol, Установите опцию «Всегда использовать время вместо давления» в качестве стандарта - если вы хотите использовать ForcedTouch, отключите эту опцию.",
                "pt": "Foram adicionadas algumas funções para reconhecer os sensores de água e fogo mais confiáveis; Adicionado um bloco para enviar mensagens pop-up para o iQontrol, definir opção como sempre usar o tempo em vez de pressão 'como padrão - se você deseja usar o ForcedTouch, desative esta opção.",
                "nl": "Enkele rollen toegevoegd om water- en brandsensoren betrouwbaarder te herkennen, Blok toegevoegd om pop-upberichten naar iQontrol te sturen, Optie 'Altijd tijd gebruiken in plaats van druk' standaard instellen - als u ForcedTouch wilt gebruiken, schakel deze optie dan uit.",
                "fr": "Ajout de certains rôles pour reconnaître les capteurs d'eau et d'incendie plus fiables, Ajout d'un bloc pour envoyer des messages contextuels à iQontrol, Définissez l'option `` Toujours utiliser le temps au lieu de la pression '' en standard - si vous souhaitez utiliser ForcedTouch, désactivez cette option.",
                "it": "Aggiunti alcuni ruoli per riconoscere i sensori di acqua e fuoco più affidabili, Aggiunto un blocco a blocco per inviare messaggi popup a iQontrol, Impostare l'opzione 'Usa sempre il tempo invece della pressione' come standard - se si desidera utilizzare ForcedTouch, disabilitare questa opzione.",
                "es": "Se agregaron algunas funciones para reconocer los sensores de agua y fuego más confiables, Se agregó un bloque para enviar mensajes emergentes a iQontrol, Establecer la opción 'Usar siempre el tiempo en lugar de la presión' como estándar; si desea usar ForcedTouch, desactive esta opción.",
                "pl": "Dodano pewne role, aby rozpoznawać czujniki wody i ognia bardziej niezawodne, Dodano blokowanie blokowania wysyłania wyskakujących wiadomości do iQontrol, Ustaw opcję `` Zawsze używaj czasu zamiast ciśnienia '' jako standard - jeśli chcesz używać ForcedTouch, wyłącz tę opcję.",
                "zh-cn": "添加了一些角色以更可靠地识别水和火传感器，添加了一个块以阻止将弹出消息发送到iQontrol，将选项“始终使用时间而不是压力”作为标准设置-如果要使用ForcedTouch，请禁用此选项。"
            },
            "1.1.5": {
                "en": "Made dialog movable by dragging title, Added LEVEL to fan, Fixed flickering of SVG-Background change on some devices.",
                "de": "Dialog durch Ziehen des Titels beweglich gemacht, LEVEL zum Lüfter hinzugefügt, Flackern der SVG-Hintergrundänderung auf einigen Geräten behoben.",
                "ru": "Сделано перемещение диалога путем перетаскивания заголовка, Добавлен УРОВЕНЬ в веер, Исправлено мерцание изменения SVG-фона на некоторых устройствах.",
                "pt": "Tornou a caixa de diálogo móvel arrastando o título, Adicionando LEVEL ao ventilador, Corrigida oscilação da alteração SVG-Background em alguns dispositivos.",
                "nl": "Dialoog verplaatsbaar gemaakt door titel te slepen, LEVEL toegevoegd aan ventilator, Vaste flikkering van SVG-achtergrondverandering op sommige apparaten.",
                "fr": "Boîte de dialogue mobile en faisant glisser le titre, Ajout de NIVEAU au ventilateur, Correction du scintillement du changement d'arrière-plan SVG sur certains appareils.",
                "it": "Rende mobile la finestra di dialogo trascinando il titolo, Aggiunto LIVELLO alla ventola, Risolto lo sfarfallio della modifica dello sfondo SVG su alcuni dispositivi.",
                "es": "Diálogo movido arrastrando el título, NIVEL agregado al ventilador, parpadeo fijo del cambio de fondo SVG en algunos dispositivos.",
                "pl": "Okno dialogowe można było przenosić, przeciągając tytuł, Dodano POZIOM do wentylatora, Naprawiono migotanie zmiany tła SVG na niektórych urządzeniach.",
                "zh-cn": "通过拖动标题使对话框可移动，向风扇添加了LEVEL，修复了某些设备上SVG-Background更改的闪烁。"
            }
        },
        "title": "iQontrol",
        "titleLang": {
            "en": "iQontrol",
            "de": "iQontrol",
            "ru": "iQontrol",
            "pt": "iQontrol",
            "nl": "iQontrol",
            "fr": "iQontrol",
            "it": "iQontrol",
            "es": "iQontrol",
            "pl": "iQontrol",
            "zh-cn": "iQontrol"
        },
        "desc": {
            "en": "Fast Web-App for Visualization",
            "de": "Schnelle Web-App zur Visualisierung",
            "ru": "Быстрое веб-приложение для визуализации",
            "pt": "Fast Web-App para visualização",
            "nl": "Snelle web-app voor visualisatie",
            "fr": "Web-App rapide pour la visualisation",
            "it": "App Web veloce per visualizzazione",
            "es": "Rápida aplicación web para visualización",
            "pl": "Szybka aplikacja internetowa do wizualizacji",
            "zh-cn": "用于可视化的快速Web应用程序"
        },
        "authors": [
            "Sebastian Bormann <sebastian@bormann.net>"
        ],
        "keywords": [
            "visualization",
            "user",
            "interface",
            "webapp",
            "ui"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "iqontrol.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/sbormann/ioBroker.iqontrol/master/admin/iqontrol.png",
        "readme": "https://github.com/sbormann/ioBroker.iqontrol/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "visualization",
        "highlight": true,
        "compact": true,
        "singleton": false,
        "materialize": true,
        "materializeTab": true,
        "blockly": true,
        "messagebox": true,
        "subscribe": "messagebox",
        "localLink": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
        "welcomeScreen": false,
        "welcomeScreenPro": {
            "link": "iqontrol/index.html",
            "name": "iQontrol",
            "img": "iqontrol.admin/iqontrol.png",
            "color": "gray",
            "order": 1,
            "localLink": false
        },
        "noIntro": false,
        "adminTab": {
            "singleton": true,
            "name": {
                "en": "iQontrol",
                "de": "iQontrol",
                "ru": "iQontrol",
                "pt": "iQontrol",
                "nl": "iQontrol",
                "fr": "iQontrol",
                "it": "iQontrol",
                "es": "iQontrol",
                "pl": "iQontrol",
                "zh-cn": "iQontrol"
            },
            "link": "%web_protocol%://%ip%:%web_port%/iqontrol/index.html?namespace=iqontrol.%instance%",
            "fa-icon": "blur_on"
        },
        "supportCustoms": true,
        "plugins": {
            "sentry": {
                "dsn": "https://1bc875a7a671418dbe4d5765e4e3cd2f@sentry.iobroker.net/96"
            }
        },
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=1.4.2"
            },
            {
                "web": ">=1.7.1"
            }
        ]
    },
    "native": {
        "demotoolbar": [
            {
                "commonName": "Home",
                "nativeLinkedView": "Home",
                "nativeIcon": "home"
            },
            {
                "commonName": "Rooms",
                "nativeLinkedView": "Rooms",
                "nativeIcon": "grid"
            },
            {
                "commonName": "Functions",
                "nativeLinkedView": "Functions",
                "nativeIcon": "gear"
            }
        ],
        "demoviews": [
            {
                "commonName": "Home",
                "nativeBackgroundImage": ".\\userimages\\demo\\bakestone.jpg",
                "devices": [
                    {
                        "commonName": "ioBroker uptime",
                        "nativeHeading": "ioBroker",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                        "commonRole": "iQontrolValue",
                        "states": [
                            {
                                "state": "STATE",
                                "value": "system.adapter.admin.0.uptime"
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Rooms",
                "nativeBackgroundImage": ".\\userimages\\demo\\grass.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "1st floor",
                        "nativeLinkedView": "Living-Room",
                        "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "2nd floor",
                        "nativeLinkedView": "Kitchen",
                        "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Functions",
                "nativeBackgroundImage": ".\\userimages\\demo\\decor.jpg",
                "devices": [
                    {
                        "commonName": "Lights",
                        "nativeHeading": "",
                        "nativeLinkedView": "Lights",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Climate-Control",
                        "nativeHeading": "",
                        "nativeLinkedView": "Climate-Control",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolView",
                        "states": [
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Living-Room",
                "nativeBackgroundImage": ".\\userimages\\demo\\bottle.jpg",
                "devices": [
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Heater",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "TV",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolSwitch",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Kitchen",
                "nativeBackgroundImage": ".\\userimages\\demo\\whitestone.jpg",
                "devices": [
                    {
                        "commonName": "Fan",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolFan",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Light",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Lights",
                "nativeBackgroundImage": ".\\userimages\\demo\\orangedrops.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    },
                    {
                        "commonName": "Kitchen",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolLight",
                        "states": [
                            {
                                "state": "STATE",
                                "value": ""
                            },
                            {
                                "state": "LEVEL",
                                "value": ""
                            },
                            {
                                "state": "HUE",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            },
            {
                "commonName": "Climate-Control",
                "nativeBackgroundImage": ".\\userimages\\demo\\green.jpg",
                "devices": [
                    {
                        "commonName": "Living Room",
                        "nativeHeading": "",
                        "nativeLinkedView": "",
                        "nativeBackgroundImage": "",
                        "commonRole": "iQontrolThermostat",
                        "states": [
                            {
                                "state": "SET_TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "TEMPERATURE",
                                "value": ""
                            },
                            {
                                "state": "HUMIDITY",
                                "value": ""
                            },
                            {
                                "state": "CONTROL_MODE",
                                "value": ""
                            },
                            {
                                "state": "VALVE_STATES",
                                "value": ""
                            },
                            {
                                "state": "BATTERY",
                                "value": ""
                            },
                            {
                                "state": "UNREACH",
                                "value": ""
                            },
                            {
                                "state": "ERROR",
                                "value": ""
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "objects": [
        {
            "_id": "iqontrol.meta",
            "type": "meta",
            "common": {
                "name": "userfiles and images for iQontrol",
                "type": "meta.user",
                "expert": true
            },
            "native": {}
        }
    ],
    "instanceObjects": []
}